{
"azkar":[
 {
  "ZekarID": 1,
  "ZekarText": "Alhamdu lillahil-lathee ahyana baAAda ma amatana wa-ilayhin-nushoor.\r\n‘All praise is for Allah who gave us life after having taken it from us and unto Him is the resurrection.’",
  "RepeatNumber": 1,
  "Tabweeb": "When waking up"
 },
 {
  "ZekarID": 2,
  "ZekarText": "Alhamdu lillahil-lathee AAafanee fee jasadee waradda AAalayya roohee wa-athina lee bithikrih.\r\n‘All praise is for Allah who restored to me my health and returned my soul and  has allowed me to remember Him.’",
  "RepeatNumber": 1,
  "Tabweeb": "When waking up"
 },
 {
  "ZekarID": 3,
  "ZekarText": "The Prophet  said : ‘Whoever awakes at night and then says:\r\nLa ilaha illal-lahu wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shay-in qadeer, subhanal-lah, walhamdu lillah, wala  ilaha illal-lah wallahu akbar, wala hawla wala quwwata illa billahil-AAaliyyil AAatheem.\r\n‘None has the right to be worshipped except Allah, alone without associate, to Him belongs sovereignty and praise and He is over all things wholly capable.  How perfect Allah is, and all praise is for Allah, and none has the right to be worshipped except Allah, Allah is the greatest and there is no power nor might except with Allah, The Most High, The Supreme.\r\n…and then supplicates:",
  "RepeatNumber": 1,
  "Tabweeb": "When waking up"
 },
 {
  "ZekarID": 4,
  "ZekarText": "(Inna fee khalqi alssamawati waal-ardi wa-ikhtilafi allayli wa-alnnahari la-ayatin li-olee al-albab…)\r\n(From Verse 3:190 till the end of the chapter Ali AAimran)",
  "RepeatNumber": 1,
  "Tabweeb": "When waking up"
 },
 {
  "ZekarID": 5,
  "ZekarText": "Alhamdu lillahil-lathee kasanee hatha (aththawb) warazaqaneehi min ghayri hawlin minnee wala quwwah.\r\n‘All Praise is for Allah who has clothed me with this garment and provided it for me, with no power nor might from myself.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication when wearing a garment"
 },
 {
  "ZekarID": 6,
  "ZekarText": "Allahumma lakal-hamdu anta kasawtaneeh, as-aluka min khayrihi wakhayri ma suniAAa lah, wa-aAAoothu bika min sharrihi washarri ma suniAAa lah.\r\n‘O Allah, for You is all praise, You have clothed me with it (i.e. the garment), I ask You for the good of it and the good for which it was made, and I seek refuge with You from the evil of it and the evil for which it was made.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said when wearing a new garment"
 },
 {
  "ZekarID": 7,
  "ZekarText": "Ilbas jadeedan waAAish hameedan wamut shaheedan.\r\n‘Wear anew, live commendably and die a shaheed.’\r\nshaheed:One who dies fighting the kuffar in order to make the word of Allah superior or in defense of Islam.  It also has other meanings found in the Sunnah such as: the one who dies defending his life, wealth or family; the woman who passes away due to childbirth; one who drowns…etc.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said to someone wearing a new garment"
 },
 {
  "ZekarID": 8,
  "ZekarText": "Tublee wayukhliful-lahu taAAala.\r\n‘May you wear it out and Allah تعالى replace it (with another).’ The intended meaning: A supplication for long life. “",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said to someone wearing a new garment"
 },
 {
  "ZekarID": 9,
  "ZekarText": "Bismil-lah\r\n‘In the name of Allah.’",
  "RepeatNumber": 1,
  "Tabweeb": "Before undressing"
 },
 {
  "ZekarID": 10,
  "ZekarText": "(Bismil-lah) allahumma innee aAAoothu bika minal-khubthi wal-khaba-ith\r\n‘(In the name of Allah).  O Allah, I take refuge with you from all evil and evil-doers.’",
  "RepeatNumber": 1,
  "Tabweeb": "Before entering the toilet"
 },
 {
  "ZekarID": 11,
  "ZekarText": "Ghufranak\r\n‘I ask You (Allah) for forgiveness.’",
  "RepeatNumber": 1,
  "Tabweeb": "After leaving the toilet"
 },
 {
  "ZekarID": 12,
  "ZekarText": "Bismil-lah\r\n‘In the name of Allah.’",
  "RepeatNumber": 1,
  "Tabweeb": "When starting ablution"
 },
 {
  "ZekarID": 13,
  "ZekarText": "Ashhadu an la ilaha illal-lahu wahdahu la shareeka lah, wa-ashhadu anna Muhammadan AAabduhu warasooluh.\r\n‘I bear witness that none has the right to be worshipped except Allah, alone without partner, and I bear witness that Muhammad is His slave and Messenger.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon completing the ablution"
 },
 {
  "ZekarID": 14,
  "ZekarText": "Allahummaj-AAalnee minat-tawwabeena wajAAalnee minal-mutatahhireen.\r\n‘O Allah, make me of those who return to You often in repentance and make me of those who remain clean and pure.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon completing the ablution"
 },
 {
  "ZekarID": 15,
  "ZekarText": "Subhanakal-lahumma wabihamdika ashhadu an la ilaha illa anta astaghfiruka wa-atoobu ilayk.\r\n‘How perfect You are O Allah, and I praise You, I bear witness that none has the right to be worshipped except You, I seek Your forgiveness and turn in repentance to You.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon completing the ablution"
 },
 {
  "ZekarID": 16,
  "ZekarText": "Allahumma innee aAAoothu bika an adilla aw odal, aw azilla aw ozall, aw athlima aw othlam, aw ajhala aw yujhala AAalay.\r\n‘O Allah, I take refuge with You lest I should stray or be led astray, or slip or be tripped, or oppress or be oppressed, or behave foolishly or be treated foolishly.’\r\nslip: i.e. to commit a sin unintentionally",
  "RepeatNumber": 1,
  "Tabweeb": "When leaving the home"
 },
 {
  "ZekarID": 17,
  "ZekarText": "Bismil-lah, tawakkaltu AAalal-lah, wala hawla wala quwwata illa billah.\r\n‘In the name of Allah, I place my trust in Allah, and there is no might nor power except with Allah.’",
  "RepeatNumber": 1,
  "Tabweeb": "When leaving the home"
 },
 {
  "ZekarID": 18,
  "ZekarText": "Bismil-lahi walajna, wabismil-lahi kharajna, waAAala rabbina tawakkalna.\r\n‘In the name of Allah we enter and in the name of Allah we leave, and upon our Lord we place our trust.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon entering the home"
 },
 {
  "ZekarID": 19,
  "ZekarText": "Allahumma ijAAal fee qalbee noora, wafee lisanee noora, wajAAal fee samAAee noora,wajAAal fee basaree noora, wajAAal min khalfee noora, wamin amamee noora ,wajAAal min fawqee noora, wamin tahtee noora, allahumma aAAtinee noora.\r\n‘O Allah, place within my heart light, and upon my tongue light, and within my ears light, and within my eyes light, and place behind me light and in front of me light and above me light and beneath me light.  O Allah, bestow upon me light.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication when going to the mosque"
 },
 {
  "ZekarID": 21,
  "ZekarText": "Bismil-lah wassalatu wassalamu AAala rasoolil-lah, allahumma innee as-aluka min fadlik, allahumma iAAsimnee minash-shaytanir-rajeem.\r\n‘In the name of Allah, and prayers and peace be upon the Messenger of Allah.  O Allah, I ask You from Your favour.  O Allah, guard me from the accursed devil.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon leaving the mosque"
 },
 {
  "ZekarID": 22,
  "ZekarText": "‘One repeats just as the mu-aththin (one who calls to prayer) says, except when he says:\r\n\r\nHayya AAalas-salah (or) hayya AAalal-falah\r\n‘come to prayer, come to success’\r\ninstead, one should say:\r\n\r\nLa hawla wala quwwata illa billah.\r\n‘There is no might nor power except with Allah.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplications related to the athan (the call to prayer)"
 },
 {
  "ZekarID": 23,
  "ZekarText": "Immediately following the declaration of faith called by the mu-aththin, one says:\r\nWa-ana ashhadu an la ilaha illal-lahu wahdahu la shareeka lah, wa-anna Muhammadan AAabduhu warasooluh, radeetu billahi rabban wabimuhammadin rasoolan wabil-islami deena.\r\n‘And I too bear witness that none has the right to be worshipped except Allah, alone, without partner, and that Muhammad is His salve and Messenger.  I am pleased with Allah as a Lord, and Muhammad as a Messenger and Islam as a religion.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplications related to the athan (the call to prayer)"
 },
 {
  "ZekarID": 24,
  "ZekarText": "‘One should then send prayers on the Prophet  after answering the call of the mu-aththin’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplications related to the athan (the call to prayer)"
 },
 {
  "ZekarID": 25,
  "ZekarText": "Allahumma rabba hathihid-daAAwatit-tammah, wassalatil-qa-imah ati Muhammadan alwaseelata wal-fadeelah, wabAAath-hu maqaman mahmoodan allathee waAAadtah, innaka la tukhliful-meeAAad.\r\n‘O Allah, Owner of this perfect call and Owner of this prayer to be performed, bestow upon Muhammad al-waseelah and al-fadeelah and send him upon a praised platform which You have promised him.  Verily, You never fail in Your promise.’\r\nal-waseelah: A station in paradise.\r\nal-fadeelah: A rank above the rest of creation.\r\npraised platform: One in which all of creation will praise him on, in order to bring about the account quickly and be relieved from the lengthy standing or the role of intercession.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplications related to the athan (the call to prayer)"
 },
 {
  "ZekarID": 26,
  "ZekarText": "One should also supplicate for himself during the time between the athan and the iqamah as supplication at such time is not rejected.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplications related to the athan (the call to prayer)"
 },
 {
  "ZekarID": 27,
  "ZekarText": "Allahumma baAAid baynee wabayna khatayaya kama baAAadta baynal-mashriqi walmaghrib, allahumma naqqinee min khatayaya kama yunaqqath-thawbul-abyadu minad-danas, allahummagh-silnee min khatayaya biththalji walma\/i walbarad.\r\n‘O Allah, distance me from my sins just as You have distanced The East from The West, O Allah, purify me of my sins as a white robe is purified of filth, O Allah, cleanse me of my sins with snow, water, and ice.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication at the start of the prayer (after takbeer)"
 },
 {
  "ZekarID": 28,
  "ZekarText": "Subhanakal-lahumma wabihamdika watabarakas-muka wataAAala jadduka wala ilaha ghayruk.\r\n‘How perfect You are O Allah, and I praise You.  Blessed be Your name, and lofty is Your position and none has the right to be worshipped except You.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication at the start of the prayer (after takbeer)"
 },
 {
  "ZekarID": 29,
  "ZekarText": "Wajjahtu wajhiya lillathee fataras-samawati wal-arda haneefan wama ana minal-mushrikeen, inna salatee wanusukee wamahyaya wamamatee lillahi rabbil-AAalameen, la shareeka lahu wabithalika omirtu wa-ana minal-muslimeen. Allahumma antal-maliku la ilaha illa ant. anta rabbee wa-ana AAabduk, thalamtu nafsee waAAtaraftu bithanbee faghfir lee thunoobee jameeAAan innahu la yaghfiruth-thunooba illa ant.wahdinee li-ahsanil-akhlaqi la yahdee li-ahsaniha illa ant, wasrif AAannee sayyi-aha la yasrifu AAannee sayyi-aha illa ant, labbayka wasaAAdayk,walkhayru kulluhu biyadayk, washsharru laysa ilayk, ana bika wa-ilayk, tabarakta wataAAalayt, astaghfiruka wa-atoobu ilayk.\r\n‘I have turned my face sincerely towards He who has brought forth the heavens and the Earth and I am not of those who associate (others with Allah).  Indeed my prayer, my sacrifice, my life and my death are for Allah, Lord of the worlds, no partner has He, with this I am commanded and I am of the Muslims. O Allah, You are the Sovereign, none has the right to be worshipped except You.  You are my Lord and I am Your servant, I have wronged my own soul and have acknowledged my sin, so forgive me all my sins for no one forgives sins except You.  Guide me to the best of characters for none can guide to it other than You, and deliver me from the worst of characters for none can deliver me from it other than You.  Here I am, in answer to Your call, happy to serve you.  All good is within Your hands and evil does not stem from You.  I exist by your will and will return to you.  Blessed and High are You, I seek Your forgiveness and repent unto You.’\r\nAllah does not create pure evil which does not have any good or contain any benefit, wisdom or mercy at all, nor does He punish anyone without having commited a sin. Something can be good in terms of its creation when viewed in a particular  perspective and at the same time be evil when viewed in another way. Allah created the devil and by him, He tests His servants, so there are those who hate the devil, fight him and his way and they stand at enmity towards him and his followers and there are others who are at allegiance with the devil and follow his steps. So evil exists in His creatures by His will and wisdom, not in His actions or act of creating.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication at the start of the prayer (after takbeer)"
 },
 {
  "ZekarID": 30,
  "ZekarText": "Allahumma rabba jibra-eel, wameeka-eel, wa-israfeel fatiras-samawati walard, AAalimal-ghaybi washshahadah, anta tahkumu bayna AAibadika feema kanoo feehi yakhtalifoon. ihdinee limakh-tulifa feehi minal-haqqi bi-ithnik, innaka tahdee man tasha-o ila siratin mustaqeem.\r\n‘O Allah, Lord of Jibra-eel, Meeka-eel and Israfeel (great angles), Creator of the heavens and the Earth, Knower of the seen and the unseen.  You are the arbitrator  between Your servants in that which they have disputed.  Guide me to the truth by Your leave, in that which they have differed, for verily You guide whom You will to a straight path.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication at the start of the prayer (after takbeer)"
 },
 {
  "ZekarID": 31,
  "ZekarText": "Allahu akbaru kabeera, Allahu akbaru kabeera, Allahu akbaru kabeera, walhamdu lillahi katheera, walhamdu lillahi katheera, walhamdu lillahi katheera, wasubhanal-lahi bukratan wa-aseela. (three times)\r\naAAoothu billahi minash-shaytani min nafkhihi wanafthihi wahamzih.  \r\n‘Allah is Most Great, Allah is Most Great, Allah is Most Great, much praise is for Allah, much praise is for Allah, much praise is for Allah, and I declare the perfection of Allah in the early morning and in the late afternoon.’(three times)\r\n‘I take refuge with Allah from the devil, from his pride, his poetry and his madness.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication at the start of the prayer (after takbeer)"
 },
 {
  "ZekarID": 32,
  "ZekarText": "The prophet  would say (as an opening supplication in prayer) when rising from sleep to perform prayers during the night:\r\nAllahumma lakal-hamd anta noorus-samawati wal-ardi waman feehin, walakal-hamd, anta qayyimus-samawati walardi waman feehin, [walakal-hamd, anta rabbus-samawati walardi waman feehin], [walakal-hamd, laka mulkus-samawati walardi waman feehin] [walakal-hamd, anta malikus-samawati walard] [walakal-hamd] [antal-haq, wawaAAdukal-haq, waqawlukal-haq, waliqa-okal-haq, waljannatu haq wannaru haq, wannabiyyoona haq, wa Muhammadun  haq, wassaAAatu haq] [allahumma laka aslamt, waAAalayka tawakkalt, wabika amant, wa-ilayka anabt, wabika khasamt, wa-ilayka hakamt, faghfir lee ma qaddamt, wama akhkhart, wama asrart, wama aAAlant] [antal-muqaddim, wa-antal-mu-akhkhir, la ilaha illa ant] [anta ilahee la ilaha illa ant .\r\n‘O Allah, to You belongs all praise, You are the Light of the heavens and the Earth and all that is within them.  To You belongs all praise, You are the Sustainer of the heavens and the Earth and all that is within them.  To You belongs all praise.  You are Lord of the heavens and the Earth and all that is within them.  To You belongs all praise and the kingdom of the heavens and the Earth and all that is within them.  To You belongs all praise, You are the King of the heavens and the Earth and to You belongs all praise. You are The Truth, Your promise is true, your Word is true, and the Day in which we will encounter You is true, the Garden of Paradise is true and the Fire is true, and the Prophets are true, Muhammad  is true and the Final Hour is true.  O Allah, unto You I have submitted, and upon You I have relied, and in You I have believed, and to You I have turned in repentance, and over You I have disputed, and to You I have turned for judgment.  So forgive me for what has come to pass of my sins and what will come to pass, and what I have hidden and what I have made public.  You are Al-Muqaddim and Al-Mu-akhkhir. None has the right to be worshipped except You, You are my Deity, none has the right to be worshipped except You.’\r\nMeaning of Al-Muqaddim and Al-Mu-akhkhir: Allah puts forward and favours whom He wills from amongst His creation just as He defers and holds back whom He wills in accordance to His wisdom.  E.g. Favouring man over the rest of creation, favouring the Prophets over the rest of mankind, favouring Muhammad  over all the Prophets and Messengers…etc.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication at the start of the prayer (after takbeer)"
 },
 {
  "ZekarID": 33,
  "ZekarText": "Subhana rabbiyal-AAatheem (three times)\r\n‘How perfect my Lord is, The Supreme.’(three times)",
  "RepeatNumber": 3,
  "Tabweeb": "While bowing in prayer (rukooAA)"
 },
 {
  "ZekarID": 34,
  "ZekarText": "Subhanakal-lahumma rabbana wabihamdik, allahummagh-fir lee\r\n‘How perfect You are O Allah, our Lord and I praise You.  O Allah, forgive me.’",
  "RepeatNumber": 1,
  "Tabweeb": "While bowing in prayer (rukooAA)"
 },
 {
  "ZekarID": 35,
  "ZekarText": "Subboohun quddoos, rabbul-mala-ikati warrooh.\r\n‘Perfect and Holy (He is), Lord of the angles and the Rooh (i.e. Jibra-eel).’",
  "RepeatNumber": 3,
  "Tabweeb": "While bowing in prayer (rukooAA)"
 },
 {
  "ZekarID": 36,
  "ZekarText": "Allahumma laka rakaAAt, wabika amant, walaka aslamt, khashaAAa laka samAAee, wabasaree, wamukhkhee, waAAathmee, waAAasabee, wamas-taqalla bihi qadamee.\r\n‘O Allah, unto You I have bowed, and in You I have believed, and to You I have submitted. My hearing, sight, mind, bones, tendons and what my feet carry are humbled before You.’",
  "RepeatNumber": 1,
  "Tabweeb": "While bowing in prayer (rukooAA)"
 },
 {
  "ZekarID": 37,
  "ZekarText": "Subhana thil-jabaroot, walmalakoot, walkibriya\/, walAAathamah.\r\n‘How perfect He is, The Possessor of total power, sovereignty, magnificence and grandeur.’",
  "RepeatNumber": 1,
  "Tabweeb": "While bowing in prayer (rukooAA)"
 },
 {
  "ZekarID": 38,
  "ZekarText": "SamiAAal-lahu liman hamidah\r\n‘May Allah answer he who praises Him.’\r\nThis supplication is to be made while rising.",
  "RepeatNumber": 1,
  "Tabweeb": "Upon rising from the bowing posision"
 },
 {
  "ZekarID": 39,
  "ZekarText": "Rabbana walakal-hamdu hamdan katheeran tayyiban mubarakan feeh.\r\n‘Our Lord, for You is all praise, an abundant beautiful blessed praise.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon rising from the bowing posision"
 },
 {
  "ZekarID": 40,
  "ZekarText": "Mil-as-samawati wamil-al-ard, wama baynahuma, wamil\/a ma shi\/ta min shay-in baAAd, ahlath-thana-i walmajd, ahaqqu ma qalal-AAabd, wakulluna laka AAabd. Allahumma la maniAAa lima aAAtayt, wala muAAtiya lima manaAAt, wala yanfaAAu thal-jaddi minkal-jad.\r\n‘The heavens and the Earth and all between them abound with Your praises, and all that You will abounds with Your praises. O Possessor of praise and majesty, the truest thing a slave has said (of You) and we are all Your slaves.  O Allah, none can prevent what You have willed to bestow and none can bestow what You have willed to prevent, and no wealth or majesty can benefit anyone, as from You is all wealth and majesty.’\r\nThis supplication is made optionally only in conjunction with the previous one.",
  "RepeatNumber": 1,
  "Tabweeb": "Upon rising from the bowing posision"
 },
 {
  "ZekarID": 41,
  "ZekarText": "Subhana rabbiyal-aAAla. (three times)\r\n‘How perfect my Lord is, The Most High.’(three times)",
  "RepeatNumber": 3,
  "Tabweeb": "Supplication whilst prostrating (sujood)"
 },
 {
  "ZekarID": 42,
  "ZekarText": "Subhanakal-lahumma rabbana wabihamdik, allahummagh- fir lee.\r\n‘How perfect You are O Allah, our Lord, and I praise You. O Allah, forgive me.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication whilst prostrating (sujood)"
 },
 {
  "ZekarID": 43,
  "ZekarText": "Subbohoon quddos, rabbul-mala-ikati warrooh. \r\n‘Perfect and Holy (He is), Lord of the angles and the Rooh (i.e. Jibra-eel).’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication whilst prostrating (sujood)"
 },
 {
  "ZekarID": 44,
  "ZekarText": "Allahumma laka sajadt, wabika amant, walaka aslamt, sajada wajhee lillathee khalaqahu wasawwarahu washaqqa samAAahu wabasarahu, tabarakal-lahu ahsanul-khaliqeen.\r\n‘O Allah, unto You I have prostrated and in You I have believed, and unto You I have submitted. My face has prostrated before He Who created it and fashioned it, and brought forth its faculties of hearing and seeing. Blessed is Allah, the Best of creators.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication whilst prostrating (sujood)"
 },
 {
  "ZekarID": 45,
  "ZekarText": "Subhana thil-jabaroot, walmalakoot, walkibriya\/, walAAathamah.\r\n‘How perfect He is, The Possessor of total power, sovereignty, magnificence and grandeur.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication whilst prostrating (sujood)"
 },
 {
  "ZekarID": 46,
  "ZekarText": "Allahummagh-fir lee thanbee kullah, diqqahu wajillah, wa-awwalahu wa-akhirah, wa- AAalaniyyatahu wa-sirrah.\r\n‘O Allah, forgive me all of my sins, the small and great of them, the first and last of them, and the seen and hidden of them.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication whilst prostrating (sujood)"
 },
 {
  "ZekarID": 47,
  "ZekarText": "Allahumma innee aAAoothu biridaka min sakhatik, wa-bimuAAafatika min AAuqoobatik, wa-aAAoothu bika mink, la ohsee thana-an AAalayk, anta kama athnayta AAala nafsik.\r\n‘O Allah, I take refuge within Your pleasure from Your displeasure and within Your pardon from Your punishment, and I take refuge in You from You. I cannot enumerate Your praise, You are as You have praised Yourself.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication whilst prostrating (sujood)"
 },
 {
  "ZekarID": 48,
  "ZekarText": "Rabbigh-fir lee, rabbigh-fir lee.\r\n‘My Lord forgive me, My Lord forgive me.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication between the two prostrations"
 },
 {
  "ZekarID": 49,
  "ZekarText": "Allahummagh-fir lee, warhamnee, wahdinee, wajburnee, waAAafinee, warzuqnee warfaAAnee.\r\n‘O Allah, forgive me, have mercy upon me, guide me, enrich me, give me health, grant me sustenance and raise my rank.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication between the two prostrations"
 },
 {
  "ZekarID": 50,
  "ZekarText": "Sajada wajhee lillathee khalaqahu washaqqa samAAahu wabasarahu bihawlihi waquwwatih  { tabaraka Allahu ahsanu alkhaliqeen}. \r\n‘My face fell prostrate before He who created it and brought forth its faculties of hearing and seeing by His might and power.  So Blessed is Allah, the best of creators. ’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication when prostrating due to recitation of the Quran"
 },
 {
  "ZekarID": 51,
  "ZekarText": "Allahummak-tub lee biha  AAindaka ajra, wadaAA  AAannee biha wizra, wajAAalha lee AAindaka thukhra, wataqabbalha minnee kama taqabbaltaha min AAabdika Dawood.\r\n‘O Allah, record for me a reward for this (prostration), and remove from me a sin.  Save it for me and accept it from me just as You had accepted it from Your servant Dawood.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication when prostrating due to recitation of the Quran"
 },
 {
  "ZekarID": 52,
  "ZekarText": "Tashahhud: what one says in the sitting position in prayer\r\nAttahiyyatu lillahi wassalawatu wattayyibat, assalamu AAalayka ayyuhan-nabiyyu warahmatul-lahi wabarakatuh, assalamu AAalayna waAAala AAibadil-lahis-saliheen. Ash-hadu an la ilaha illal-lah, wa-ashhadu anna Muhammadan AAabduhu warasooluh.\r\n‘At-tahiyyat is for Allah. All acts of worship and good deeds are for Him.  Peace and the mercy and blessings of Allah be upon you O Prophet.  Peace be upon us and all of Allah’s righteous servants. I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger.’\r\nAt-tahiyyat: all words which indicate the glorification of Allah.  His eternal existence, His perfection and His sovereignty.",
  "RepeatNumber": 1,
  "Tabweeb": "The Tashahhud"
 },
 {
  "ZekarID": 53,
  "ZekarText": "Allahumma salli AAala Muhammad, wa-AAala ali Muhammad, kama sallayta AAala Ibraheema wa-AAala ali Ibraheem, innaka Hameedun Majeed, allahumma barik AAala  Muhammad, wa-AAala ali Muhammad, kama barakta AAala Ibraheema wa-AAala ali Ibraheem, innaka Hameedun Majeed.\r\n‘O Allah, send prayers upon Muhammad and the followers of Muhammad, just as You sent prayers upon Ibraheem and upon the followers of Ibraheem.  Verily, You are full of praise and majesty. O Allah, send blessings upon Mohammad and upon the family of Muhammad, just as You sent blessings upon Ibraheem and upon the family of Ibraheem.  Verily, You are full of praise and majesty.’\r\nsend prayers: praise and exalt him in the highest and superior of gatherings: that of the closest angels to Allah.\r\n(al) has been translated in it’s broadest sense: some scholars are of the view that the meaning here is more specific and that it means: his  followers from among his family.",
  "RepeatNumber": 1,
  "Tabweeb": "Prayers upon the Prophet  after the tashahhud"
 },
 {
  "ZekarID": 54,
  "ZekarText": "Allahumma innee aAAoothu bika min AAathabil-qabr, wamin AAathabi jahannam, wamin fitnatil-mahya walmamat, wamin shari fitnatil-maseehid-dajjal.\r\n‘O Allah, I take refuge in You from the punishment of the grave, from the torment of the Fire, from the trials and tribulations of life and death and from the evil affliction of Al-Maseeh Ad-Dajjal.’\r\nAl-Maseeh Ad-Dajjal: among the great signs of the last hour and the greatest trials to befall mankind, which every Prophet has warned about.  Most of mankind will follow him. He will appear from Asbahan, Iran at the time when the Muslims will conquer Constantinople.  He will be given special powers and will make the truth seem false and vice versa.  He will claim to be righteous and then he will claim prophethood and finally, divinity.  From his features is that he will be blind in his right eye which is a definite proof that contradicts his claim to be Allah as it is a sign of imperfection.  The word Kafir will be written between his eyes which every believer, literate or illiterate will recognise.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said after the last tashahhud and before salam"
 },
 {
  "ZekarID": 55,
  "ZekarText": "Allahumma innee aAAoothu bika min AAathabil-qabr, wa-aAAoothu bika min fitnatil-maseehid-dajjal, wa-aAAoothu bika min fitnatil-mahya walmamat. Allahumma innee aAAoothu bika minal-ma\/thami walmaghram.\r\n‘O Allah, I take refuge in You from the punishment of the grave, and I take refuge in You from the temptation and trial of Al-Maseeh Ad-Dajjal, and I take refuge in You from the trials and tribulations of life and death.  O Allah, I take refuge in You from sin and debt.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said after the last tashahhud and before salam"
 },
 {
  "ZekarID": 56,
  "ZekarText": "Allahumma innee thalamtu nafsee thulman katheeran wala yaghfiruth-thunooba illa ant, faghfir lee maghfiratan min AAindik warhamnee, innaka antal-Ghafoorur-Raheem.\r\n‘O Allah, I have indeed oppressed my soul excessively and none can forgive sin except You, so forgive me a forgiveness from Yourself and have mercy upon me.  Surely, You are The Most-Forgiving, The Most-Merciful.’\r\nFrom Yourself: i.e. from Your innermost grace without deserving it and a forgiveness which is befitting to your tremendous generosity.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said after the last tashahhud and before salam"
 },
 {
  "ZekarID": 57,
  "ZekarText": "Allahummagh-fir lee ma qaddamtu,  wama akhkhart, wama asrartu wama aAAlant, wama asraftt, wama anta aAAlamu bihi minnee, antal-muqaddimu wa-antal-mu-akhkhiru la ilaha illa ant.\r\n‘O Allah, forgive me for those sins which have come to pass as well as those which shall come to pass, and those I have committed in secret as well as those I have made public, and where I have exceeded all bounds as well as those things about which You are more knowledgeable. You are Al-Muqaddim and Al-Mu-akhkhir.  None has the right to be worshipped except You.’\r\nMeaning of Al-Muqaddim and Al-Mu-akhkhir: Allah puts forward and favours whom He wills from amongst His creation just as He defers and holds back whom He wills in accordance to His wisdom.  E.g.  Favouring man over the rest of creation, favouring the Prophets over the rest of mankind, favouring Muhammad  over all the Prophets and Messengers…etc.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said after the last tashahhud and before salam"
 },
 {
  "ZekarID": 58,
  "ZekarText": "Allahumma aAAinnee AAala thikrik, washukrik, wahusni AAibadatik.\r\n‘O Allah, help me to remember You, to thank You, and to worship You in the best of manners.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said after the last tashahhud and before salam"
 },
 {
  "ZekarID": 59,
  "ZekarText": "Allahumma innee aAAoothu bika minal-bukhl, wa-aAAoothu bika minal-jubn, wa-aAAoothu bika min an oradda ila arthalil- AAumur, wa-aAAoothu bika min fitnatid-dunya waAAathabil-qabr.\r\n‘O Allah, I take refuge in You from miserliness and cowardice, I take refuge in You lest I be returned to the worst of lives “i.e. old age, being weak, incapable and in a state of fear”, and I take refuge in You from the trials and tribulations of this life and the punishment of the grave.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said after the last tashahhud and before salam"
 },
 {
  "ZekarID": 60,
  "ZekarText": "Allahumma innee as-alukal-jannah, wa-aAAoothu bika minan-nar.\r\n‘O Allah, I ask You to grant me Paradise and I take refuge in You from the Fire.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said after the last tashahhud and before salam"
 },
 {
  "ZekarID": 61,
  "ZekarText": "Allahumma biAAilmikal-ghayb, waqudratika AAalal-khalq, ahyinee ma AAalimtal-hayata khayran lee watawaffanee itha AAalimtal-wafata khayran lee, allahumma innee as-aluka khashyataka fil-ghaybi washshahadah, wa-as-aluka kalimatal-haqqi fir-rida walghadab, wa-as-alukal-qasda fil-ghina walfaqr, wa-as-aluka naAAeeman la yanfad, wa-as-aluka qurrata AAaynin la tanqatiAA, wa-as-alukar-rida baAAdal-qada\/, wa-as-aluka bardal-AAayshi baAAdal-mawt, wa-as-aluka laththatan-nathari ila wajhik, washshawqa ila liqa-ik fee ghayri darraa mudirrah, wala fitnatin mudillah, allahumma zayyinna bizeenatil-eeman wajAAalna hudatan muhtadeen.\r\n‘O Allah, by Your knowledge of the unseen and Your power over creation, keep me alive so long as You know such life to be good for me and take me if You know death to be better for me.  O Allah, make me fearful of You whether in secret or in public and I ask You to make me true in speech, in times of pleasure and anger.I ask you to make me moderate in times of wealth and poverty and I ask You for everlasting bliss and joy which will never cease.I ask You to make me pleased with what You have decreed and for an easy life after death.I ask You for the sweetness of looking upon Your Face and a longing to encounter You in a manner which does not entail a calamity which will bring about harm nor a trial which will cause deviation. O Allah, beautify us with the adornment of faith and make us of those who guide and are rightly guided.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said after the last tashahhud and before salam"
 },
 {
  "ZekarID": 62,
  "ZekarText": "Allahumma innee as-aluka ya Allah bi-annakal-wahidul-ahadus-samad, allathee lam yalid walam yoolad, walam yakun lahu kufuwan ahad, an taghfira lee thunoobee innaka antal-Ghafoorur-Raheem.\r\n‘O Allah, I ask You O Allah, as You are The One, The Only, AS-Samad, The One who begets not, nor was He begotten and there is none like unto Him that You forgive me my sins for verily You are The Oft-Forgiving, Most-Merciful.’\r\nAS-Samad: The Self-Sufficient Master, Possessor of perfect attributes whom all of creation turn to in all their needs.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said after the last tashahhud and before salam"
 },
 {
  "ZekarID": 63,
  "ZekarText": "Allahumma innee as-aluka bianna lakal-hamd, la ilaha illa ant wahdaka la shareeka lak, almannan, ya badeeAAas-samawati wal-ard, ya thal-jalali wal-ikram, ya hayyu ya qayyoom, innee as-alukal-jannah, wa-aAAoothu bika minan-nar.\r\n‘O Allah, I ask You as unto You is all praise, none has the right to be worshipped except You, alone, without partner. You are the Benefactor. O Originator of the heavens and the Earth, O Possessor of majesty and honour, O Ever Living, O Self-Subsisting and Supporter of all, verily I ask You for Paradise and I take refuge with You from the Fire.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said after the last tashahhud and before salam"
 },
 {
  "ZekarID": 64,
  "ZekarText": "Allahumma inne as-aluka biannee ashhadu annaka antal-lah, la ilaha illa ant, al-ahadus-samad, allathee lam yalid walam yoolad walam yakun lahu kufuwan ahad.\r\n‘O Allah, I ask You, as I bear witness that You are Allah, none has the right to be worshipped except You, The One, AS-Samad Who begets not nor was He begotten and there is none like unto Him.’\r\nAS-Samad: The Self-Sufficient Master, Possessor of perfect attributes whom all of creation turn to in all their needs.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said after the last tashahhud and before salam"
 },
 {
  "ZekarID": 65,
  "ZekarText": "Astaghfirul-lah (three times)\r\nAllahumma antas-salam waminkas-salam, tabarakta ya thal-jalali wal-ikram.\r\n‘I ask Allah for forgiveness.’\t(three times)\r\n‘O Allah, You are As-Salam and from You is all peace, blessed are You, O Possessor of majesty and honour.’\r\nAS-Salam: The One Who is free from all defects and deficiencies.",
  "RepeatNumber": 3,
  "Tabweeb": "Remembrance after salam"
 },
 {
  "ZekarID": 66,
  "ZekarText": "La ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer. la hawla wala quwwata illa billah, la ilaha illal-lah, wala naAAbudu illa iyyah, lahun-niAAmatu walahul-fadl walahuth-thana-ol- hasan, la ilaha illal-lah mukhliseena lahud-deen walaw karihal-kafiroon.\r\n‘None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent.  There is no might nor power except with Allah, none has the right to be worshipped except Allah and we worship none except Him.  For Him is all favour, grace, and glorious praise.  None has the right to be worshipped except Allah and we are sincere in faith and devotion to Him although the disbelievers detest it.’",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance after salam"
 },
 {
  "ZekarID": 67,
  "ZekarText": "La ilaha illal-lahu wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer, allahumma la maniAAa lima aAAtayt, wala muAAtiya lima manaAAt, wala yanfaAAu thal-jaddi minkal-jad.\r\n‘None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent.O Allah, none can prevent what You have willed to bestow and none can bestow what You have willed to prevent, and no wealth or majesty can benefit anyone, as from You is all wealth and majesty.’",
  "RepeatNumber": 3,
  "Tabweeb": "Remembrance after salam"
 },
 {
  "ZekarID": 68,
  "ZekarText": "Subhanal-lah walhamdu lillah, wallahu akbar (thirty-three times).\r\nLa ilaha illal-lahu wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer.\r\n‘How perfect Allah is, all praise is for Allah, and Allah is the greatest.’\r\n(thirty-three times)\r\n‘None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent.’",
  "RepeatNumber": 33,
  "Tabweeb": "Remembrance after salam"
 },
 {
  "ZekarID": 69,
  "ZekarText": "The following three chapters should be recited once after Thuhr, AAasr and AAisha prayers and thrice after Fajr and Maghrib.\r\n) \r\n{Qul huwa Allahu ahad…}\t[Al-Ikhlas]\r\n) \r\n{Qul aAAoothu birabbi alfalaq…..}\t[Al-Falaq]\r\n\r\n{Qul aAAoothu birabbi alnnas…..}\t[An-Nas]",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance after salam"
 },
 {
  "ZekarID": 70,
  "ZekarText": "It is also from the sunnah to recite the verse of the Footstool (Ayat-Al-Kursiy) after each prayer:\r\n\r\n{Allahu la ilaha illa huwa alhayyu alqayyoomu la ta\/khuthuhu sinatun wala nawm…}\r\n[Al-Baqarah:255]",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance after salam"
 },
 {
  "ZekarID": 71,
  "ZekarText": "La ilaha illal-lahu wahdahu la shareeka lah, lahul-mulku walahul-hamd, yuhyee wayumeet, wahuwa AAala kulli shayin qadeer.(ten times after the maghrib & fajr prayers)\r\n‘None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise, He gives life and causes death and He is over all things omnipotent.’\r\n(ten times after the maghrib and fajr prayers)",
  "RepeatNumber": 10,
  "Tabweeb": "Remembrance after salam"
 },
 {
  "ZekarID": 72,
  "ZekarText": "Allahumma innee as-aluka AAilman nafiAAan, warizqan tayyiban, waAAamalan mutaqabbalan.(after salam from fajr prayer).\r\n‘O Allah, I ask You for knowledge which is beneficial and sustenance which is good, and deeds which are acceptable.’\r\n(To be said after giving salam for the fajr prayer)",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance after salam"
 },
 {
  "ZekarID": 73,
  "ZekarText": "On the authority of Jabir Ibn AAabdullah , he said: ’The Prophet  would instruct us to pray for guidance in all of our concerns, just as he would teach us a chapter from the Quran.  He  would say ’ If any of you intends to undertake a matter then let him pray two supererogatory units (two rakAAah nafilah) of prayer and after which he should supplicate:\r\nAllahumma innee astakheeruka biAAilmik, wa-astaqdiruka biqudratik, wa-as-aluka min fadlikal-AAatheem, fa-innaka taqdiru wala aqdir, wataAAlamu wala aAAlam ,wa-anta AAallamul ghuyoob, allahumma in kunta taAAlamu anna hathal-amr (say your need) khayrun lee fee deenee wamaAAashee waAAaqibati amree faqdurhu lee, wayassirhu lee, thumma barik lee feeh, wa-in kunta taAAlamu anna hathal-amr sharrun lee fee deenee wamaAAashee waAAaqibati amree fasrifhu AAannee wasrifnee AAanh, waqdur liyal-khayra haythu kan, thumma ardinee bih.\r\n‘O Allah, I seek Your counsel by Your knowledge and by Your power I seek strength and I ask You from Your immense favour, for verily You are able while I am not and verily You know while I do not and You are the Knower of the unseen.  O Allah, if You know this affair -and here he mentions his need- to be good for me in relation to my religion, my life, and end, then decree and facilitate it for me, and bless me with it, and if You know this affair to be ill for me towards my religion, my life, and end, then remove it from me and remove me from it, and decree for me what is good wherever it be and make me satisfied with such.’\r\nOne who seeks guidance from his Creator and consults his fellow believers and then remains firm in his resolve does not regret, for Allah has said:\r\n\r\n(washawirhum fee al-amri fa-itha AAazamta fatawakkal AAala Allah )\r\n(chapter 3 verse 159)\r\n‘…and consult them in the affair. Then when you have taken a decision, put your trust in Allah…’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for seeking guidance in forming a decision or choosing the proper course…etc (Al-Istikharah)"
 },
 {
  "ZekarID": 75,
  "ZekarText": "{Allahu la ilaha illa huwa alhayyu alqayyoomu la ta\/khuthuhu sinatun wala nawm…}\r\n[Al-Baqarah:255]",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 76,
  "ZekarText": "‘AAabdullah Ibn Khubaib  said: ‘The Messenger of Allah  said to me ‘Recite!’ I replied ‘O Messenger of Allah, what shall I recite?’ he said ‘Recite:\r\n\r\n{Qul huwa Allahu ahad…}\t[Al-Ikhlas]\r\n\r\n{Qul aAAoothu birabbi alfalaq…..}\t[Al-Falaq]\r\n\r\n{Qul aAAoothu birabbi alnnas…..}\t[An-Nas]\r\n\r\n…in the evening and the morning three times for it will suffice you of all else.’",
  "RepeatNumber": 3,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 77,
  "ZekarText": "Amsayna wa-amsal-mulku lillah walhamdu lillah la ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer, rabbi as-aluka khayra ma fee hathihil-laylah, wakhayra ma baAAdaha, wa-aAAoothu bika min sharri hathihil-laylah, washarri ma baAAdaha, rabbi aAAoothu bika minal-kasal, wasoo-il kibar, rabbi aAAoothu bika min AAathabin fin-nar, waAAathabin fil-qabr.\r\n‘We have reached the evening and at this very time unto Allah belongs all sovereignty, and all praise is for Allah.  None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. My Lord, I ask You for the good of this night and the good of what follows it and I take refuge in You from the evil of this night and the evil of what follows it.  My Lord, I take refuge in You from laziness and senility.  My Lord, I take refuge in You from torment in the Fire and punishment in the grave.’\r\n…likewise, one says in the morning:\r\n\r\nAsbahna wa-asbahal-mulku lillah….\r\n‘We have reached the morning and at this very time unto Allah belongs all sovereignty…’",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 78,
  "ZekarText": "Allahumma bika asbahna wabika amsayna, wabika nahya ,wabika namootu wa-ilaykan-nushoor.\r\n‘O Allah, by your leave we have reached the morning and by Your leave we have reached the evening, by Your leave we live and die and unto You is our resurrection.’\r\nIn the evening:\r\n.\r\nAllahumma bika amsayna, wabika asbahna, wabika nahya wabika namootu wa-ilaykal-maseer.\r\n‘O Allah, by Your leave we have reached the evening and by Your leave we have reached the morning, by Your leave we live and die and unto You is our return.’",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 79,
  "ZekarText": "Allahumma anta rabbee la ilaha illa ant, khalaqtanee wa-ana AAabduk, wa-ana AAala AAahdika wawaAAdika mas-tataAAt, aAAoothu bika min sharri ma sanaAAt, aboo-o laka biniAAmatika AAalay, wa-aboo-o bithanbee, faghfir lee fa-innahu la yaghfiruth-thunooba illa ant.\r\n‘O Allah, You are my Lord, none has the right to be worshipped except You, You created me and I am Your servant and I abide to Your covenant and promise as best I can, I take refuge in You from the evil of which I have committed.  I acknowledge Your favour upon me and I acknowledge my sin, so forgive me, for verily none can forgive sin except You.’",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 80,
  "ZekarText": "Allahumma innee asbahtu oshhiduk, wa-oshhidu hamalata AAarshik, wamala-ikatak, wajameeAAa khalqik, annaka antal-lahu la ilaha illa ant, wahdaka la shareeka lak, wa-anna Muhammadan AAabduka warasooluk (four times in the morning & evening).\r\n‘O Allah, verily I have reached the morning and call on You, the bearers of Your throne, Your angles, and all of Your creation to witness that You are Allah, none has the right to be worshipped except You, alone, without partner and that Muhammad is Your Servant and Messenger.’\r\n(four times in the morning and evening.)\r\nNote: for the evening, one reads (amsaytu) instead of (asbahtu).",
  "RepeatNumber": 4,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 81,
  "ZekarText": "Allahumma ma asbaha bee min niAAmatin, aw bi-ahadin min khalqik, faminka wahdaka la shareeka lak, falakal-hamdu walakash-shukr.\r\n‘O Allah, what blessing I or any of Your creation have risen upon, is from You alone, without partner, so for You is all praise and unto You all thanks.’\r\n…whoever says this in the morning has indeed offered his day’s thanks and whoever says this in the evening has indeed offered his night’s thanks.\r\nNote: for the evening, one reads (amsa) instead of (asbaha).",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 82,
  "ZekarText": "Allahumma AAafinee fee badanee, allahumma AAafinee fee samAAee, allahumma AAafinee fee basaree, la ilaha illa ant.(three times).\r\nAllahumma innee aAAoothu bika minal-kufr, walfaqr, wa-aAAoothu bika min AAathabil-qabr, la ilaha illa ant (three times).\r\n‘O Allah, grant my body health, O Allah, grant my hearing health, O Allah, grant my sight health.  None has the right to be worshipped except You.’\r\n(three times)\r\n‘O Allah, I take refuge with You from disbelief and poverty, and I take refuge with You from the punishment of the grave.  None has the right to be worshipped except You.’ (three times)",
  "RepeatNumber": 3,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 83,
  "ZekarText": "Hasbiyal-lahu la ilaha illa huwa, AAalayhi tawakkalt, wahuwa rabbul-AAarshil-AAatheem (seven times morning & evening)\r\n‘Allah is Sufficient for me, none has the right to be worshipped except Him, upon Him I rely and He is Lord of the exalted throne.’\r\n(seven times morning and evening)",
  "RepeatNumber": 7,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 84,
  "ZekarText": "Allahumma innee as-alukal-AAafwa walAAafiyah, fid-dunya wal-akhirah, allahumma innee as-alukal-AAafwa walAAafiyah fee deenee, wadunyaya wa-ahlee, wamalee, allahummas-tur AAawratee, wa-amin rawAAatee, allahummah-fathnee min bayni yaday, wamin khalfee, waAAan yameenee, waAAan shimalee, wamin fawqee, wa-aAAoothu biAAathamatika an oghtala min tahtee.\r\n‘O Allah, I ask You for pardon and well-being in this life and the next. O Allah, I ask You for pardon and well-being in my religious and worldly affairs, and my family and my wealth. O Allah, veil my weaknesses and set at ease my dismay. O Allah, preserve me from the front and from behind and on my right and on my left and from above, and I take refuge with You lest I be swallowed up by the earth.’",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 85,
  "ZekarText": "Allahumma AAalimal-ghaybi washshahadah, fatiras-samawati wal-ard, rabba kulli shayin wamaleekah, ashhadu an la ilaha illa ant, aAAoothu bika min sharri nafsee wamin sharrish-shaytani washirkih, waan aqtarifa AAala nafsee soo-an aw ajurrahu ila muslim.\r\n‘O Allah, Knower of the unseen and the seen, Creator of the heavens and the Earth, Lord and Sovereign of all things, I bear witness that none has the right to be worshipped except You. I take refuge in You from the evil of my soul and from the evil and shirk of the devil, and from committing wrong against my soul or bringing such upon another Muslim.’\r\nshirk: to associate others with Allah in those things which are specific to Him.  This can occur in (1) belief, e.g. to believe that other than Allah has the power to benefit or harm, (2) speech, e.g. to swear by other than Allah and (3) action, e.g. to bow or prostrate to other than Allah.",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 86,
  "ZekarText": "Bismil-lahil-lathee la yadurru maAAas-mihi shay-on fil-ardi wala fis-sama-i wahuwas-sameeAAul-AAaleem. (three times).\r\n‘In the name of Allah with whose name nothing is harmed on earth nor in the heavens and He is The All-Seeing, The All-Knowing.’(three times)",
  "RepeatNumber": 3,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 87,
  "ZekarText": "Radeetu billahi rabban wabil-islami deenan wabiMuhammadin  nabiyya. (three times)\r\n‘I am pleased with Allah as a Lord, and Islam as a religion and Muhammad  as a Prophet.’(three times)",
  "RepeatNumber": 3,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 88,
  "ZekarText": "Ya hayyu ya qayyoom, birahmatika astagheeth, aslih lee sha\/nee kullah, wala takilnee ila nafsee tarfata AAayn.\r\n‘O Ever Living, O Self-Subsisting and Supporter of all, by Your mercy I seek assistance, rectify for me all of my affairs and do not leave me to myself, even for the blink of an eye.’",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 89,
  "ZekarText": "Asbahna wa-asbahal-mulku lillahi rabbil-AAalameen, allahumma innee as-aluka khayra hathal-yawm, fat-hahu, wanasrahu, wanoorahu, wabarakatahu, wahudahu, wa-aAAoothu bika min sharri ma feehi, washarri ma baAAdah.\r\n‘We have reached the morning and at this very time all sovereignty belongs to Allah, Lord of the worlds. O Allah, I ask You for the good of this day, its triumphs and its victories, its light and its blessings and its guidance, and I take refuge in You from the evil of this day and the evil that follows it.’\r\nFor the evening, the supplication is read as follows: \r\n\r\nAmsayna wa-amsal-mulku lillahi rabbil-AAalameen, allahumma innee as-aluka khayra hathihil-laylah, fat-haha, wanasraha, wanooraha, wabarakataha, wahudaha, wa-aAAoothu bika min sharri ma feeha washarri ma baAAdaha.\r\n‘We have reached the evening and at this very time all sovereignty belongs to Allah, Lord of the worlds. O Allah, I ask You for the good of tonight, its triumphs and its victories, its light and its blessings and its guidance, and I take refuge in You from the evil of tonight and the evil that follows it.’",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 90,
  "ZekarText": "Asbahna AAala fitratil-islam, waAAala kalimatil-ikhlas, waAAala deeni nabiyyina Muhammad  waAAala millati abeena Ibraheem, haneefan musliman wama kana minal-mushrikeen.\r\n‘We rise upon the fitrah of Islam, and the word of pure faith, and upon the religion of our Prophet Muhammad  and the religion of our forefather Ibraheem, who was a Muslim and of true faith and was not of those who associate others with Allah.’\r\nfitrah: the religion of Islam, the way of Ibraheem .\r\npure faith: the Shahada.\r\nNote: for the evening, one reads amsayna instead of asbahna.",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 91,
  "ZekarText": "Subhanal-lahi wabihamdih.  (one hundred times)\r\n‘How perfect Allah is and I praise Him.’(one hundred times)",
  "RepeatNumber": 100,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 92,
  "ZekarText": "The messenger of Allah  said: ‘Whoever says in the morning:\r\n\r\nLa ilaha illal-lahu wahdahu la shareeka lah, lahul-mulk, walahul-hamd, wahuwa AAala kulli shayin qadeer.\r\n‘None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent.’\r\n…has indeed gained the reward of freeing a slave from the children of IsmaAAeel, and ten of his sins are wiped away and he is raised ten degrees, and he has found a safe retreat from the devil until evening. Similarly, if he says it at evening time, he will be protected until the morning.’",
  "RepeatNumber": 10,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 93,
  "ZekarText": "La ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shay-in qadeer. (one hundred times)\r\n‘None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise, and He is over all things omnipotent.’\r\n(one hundred times every day)",
  "RepeatNumber": 100,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 94,
  "ZekarText": "Subhanal-lahi wabihamdih, AAadada khalqihi warida nafsih, wazinata AAarshih, wamidada kalimatih.(three times).\r\n‘How perfect Allah is and I praise Him by the number of His creation and His pleasure, and by the weight of His throne, and the ink of His words.’(three times)",
  "RepeatNumber": 3,
  "Tabweeb": "Remembrance said in the morning and evening"
 },
 {
  "ZekarID": 99,
  "ZekarText": "‘When retiring to his bed every night, the Prophet  would hold his palms together, spit (A form of spitting comprising mainly of air with little spittle) in them, recite the last three chapters (Al-Ikhlas, Al-Falaq, An-Nas) of the Quran and then wipe over his entire body as much as possible with his hands, beginning with his head and face and then all parts of the body, he would do this three times.’",
  "RepeatNumber": 3,
  "Tabweeb": "Remembrance before sleeping"
 },
 {
  "ZekarID": 100,
  "ZekarText": "The Prophet  also said: ‘When you are about to sleep recite ayat-al-kursee (The verse of the foot-stool, chapter 2:255) till the end of the verse for there will remain over you a protection from Allah and no devil will draw near to you until morning.’",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance before sleeping"
 },
 {
  "ZekarID": 101,
  "ZekarText": "The Prophet  also said: ‘Whoever recites the last two verses of Soorat Al-Baqarah at night, those two verses shall be sufficient for him (i.e. protect him from all that can cause him harm).’\r\n\r\n(Amana alrrasoolu bima onzila ilayhi min rabbihi wa almu\/minoona….)\r\n[Al-Baqarah: 285-286]",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance before sleeping"
 },
 {
  "ZekarID": 102,
  "ZekarText": "‘If one of you rises from his bed and then returns to it he should dust it with the edge of his garment three times for he does not know what has occurred in his absence and when he lies down he should supplicate:\r\n\r\nBismika rabbee wadaAAtu janbee wabika arfaAAuh, fa-in amsakta nafsee farhamha, wa-in arsaltaha fahfathha bima tahfathu bihi AAibadakas-saliheen.\r\n‘In Your name my Lord, I lie down and in Your name I rise, so if You should take my soul then have mercy upon it, and if You should return my soul then protect it in the manner You do so with Your righteous servants.’",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance before sleeping"
 },
 {
  "ZekarID": 103,
  "ZekarText": "Allahumma innaka khalaqta nafsee wa-anta tawaffaha, laka mamatuha wamahyaha in ahyaytaha fahfathha, wa-in amattaha faghfir laha. Allahumma innee as-alukal-AAafiyah.\r\n‘O Allah, verily You have created my soul and You shall take it’s life, to You belongs it’s life and death. If You should keep my soul alive then protect it, and if You should take it’s life then forgive it. O Allah, I ask You to grant me good health.’",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance before sleeping"
 },
 {
  "ZekarID": 104,
  "ZekarText": "The Prophet  would place his right hand under his cheek when about to sleep and supplicate:\r\n\r\nAllahumma qinee AAathabaka yawma tabAAathu AAibadak. (three times).\r\n‘O Allah, protect me from Your punishment on the day Your servants are resurrected.’ (three times)",
  "RepeatNumber": 3,
  "Tabweeb": "Remembrance before sleeping"
 },
 {
  "ZekarID": 105,
  "ZekarText": "Bismikal-lahumma amootu wa-ahya.\r\n‘In Your name O Allah, I live and die.’",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance before sleeping"
 },
 {
  "ZekarID": 106,
  "ZekarText": "‘Shall I not direct you both (The Prophet  was addressing Ali and Fatimah-may Allah be pleased with them- when they approached him for a servant) to something better than a servant?  When you go to bed say:\r\nSubhanal-lah. (thirty-three times)\t\t \r\n‘How Perfect Allah is.’ (thirty-three times)        \r\nAlhamdu lillah. (thirty-three times)                 \r\n‘All praise is for Allah.’ (thirty-three times)\r\nAllahu akbar. (thirty-four times)                           \r\n‘Allah is the greatest.’ (thirty-four times)\r\n…for that is indeed better for you both than a servant.’",
  "RepeatNumber": 33,
  "Tabweeb": "Remembrance before sleeping"
 },
 {
  "ZekarID": 107,
  "ZekarText": "Allahumma rabbas-samawatis-sabAA, warabbal-AAarshil-AAatheem, rabbana warabba kulli shay\/, faliqal-habbi wannawa, wamunazzilat-tawra, wal-injeel, walfurqan, aAAoothu bika min sharri kulli shayin anta akhithun binasiyatih. Allahumma antal-awwal, falaysa qablaka shay\/, wa-antal-akhir, falaysa baAAdaka shay\/, wa-antath-thahir falaysa fawqaka shay\/, waantal-batin, falaysa doonaka shay\/, iqdi AAannad-dayna wa-aghnina minal-faqr.\r\n‘O Allah, Lord of the seven heavens and the exalted throne, our Lord and Lord of all things, Splitter of the seed and the date stone, Revealer of the Tawrah, the Injeel and the Furqan, I take refuge in You from the evil of all things You shall seize by the forelock (i.e. You have total mastery over). O Allah, You are The First so there is nothing before You and You are The Last so there is nothing after You.You are Aththahir so there is nothing above You and You are Al-Batin so there is nothing closer than You.Settle our debt for us and spare us from poverty.’\r\nTawrah: The book revealed to Moosa .\r\nInjeel: The book revealed to Easa .\r\nFurqan: One of the many names of the Quran, means: The Criterion which distinguishes between truth and falsehood.\r\nAththahir: Indicates the greatness of His attributes and the insignificance of every single creation in respect to His greatness and Highness, for He is above all of His creation as regards His essence and attributes.\r\nAl-Batin: Indicates His awareness and knowledge of all secrets, of that which is in the hearts and the most intimate of things just as it indicates His closeness and nearness to all in a manner which befits His majesty.",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance before sleeping"
 },
 {
  "ZekarID": 108,
  "ZekarText": "Alhamdu lillahil-lathee atAAamana wasaqana, wakafana, wa-awana, fakam mimman la kafiya lahu wala mu\/wee.\r\n‘All praise is for Allah, Who fed us and gave us drink, and Who is sufficient for us and has sheltered us, for how many have none to suffice them or shelter them.’",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance before sleeping"
 },
 {
  "ZekarID": 109,
  "ZekarText": "Allahumma AAalimal-ghaybi washshahadah, fatiras-samawati wal-ard, rabba kulli shayin wamaleekah, ashhadu an la ilaha illa ant, aAAoothu bika min sharri nafsee wamin sharrish-shaytani washirkih, wa-an aqtarifa AAala nafsee soo-an aw ajurrahu ila muslim.\r\n‘O Allah, Knower of the seen and the unseen, Creator of the heavens and the earth, Lord and Sovereign of all things I bear witness that none has the right to be worshipped except You.  I take refuge in You from the evil of my soul and from the evil and shirk of the devil, and from committing wrong against my soul or bringing such upon another Muslim.’\r\nshirk: to associate others with Allah in those things which are specific to Him.  This can occur in (1) belief, e.g. to believe that other than Allah has the power to benefit or harm, (2) speech, e.g. to swear by other than Allah and (3) action, e.g. to bow or prostrate to other than Allah.",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance before sleeping"
 },
 {
  "ZekarID": 110,
  "ZekarText": "‘The Prophet  never used to sleep until he had recited Soorat As-Sajdah (chapter 32) and Soorat Al-Mulk (chapter 67).’",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance before sleeping"
 },
 {
  "ZekarID": 111,
  "ZekarText": "Allahumma aslamtu nafsee ilayk, wafawwadtu amree ilayk, wawajjahtu wajhee ilayk, wa-alja\/tu thahree ilayk, raghbatan warahbatan ilayk, la maljaa wala manja minka illa ilayk, amantu bikitabikal-lathee anzalt, wabinabiyyikal-lathee arsalt.\r\n‘O Allah, I submit my soul unto You, and I entrust my affair unto You, and I turn my face towards You, and I totally rely on You, in hope and fear of You.Verily there is no refuge nor safe haven from You except with You.  I believe in Your Book which You have revealed and in Your Prophet whom You have sent.’\r\n…If you then die, you will die upon the fitrah.’\r\nfitrah: the religion of Islam, the way of Ibraheem .",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance before sleeping"
 },
 {
  "ZekarID": 112,
  "ZekarText": "‘AAa-isha رضي الله عنها narrated that the Messenger of Allah  used to say at night if he turned during sleep:\r\n\r\nLa ilaha illal-lahul-wahidul-qahhar, rabbus-samawati wama baynahuma, alAAazeezul-ghaffar.\r\n‘None has the right to be worshipped except Allah, The One, AL-Qahhar.Lord of the heavens and the Earth and all between them, The Exalted in Might, The Oft-Forgiving.’\r\nAL-Qahhar:The One Who has subdued all of creation and Whom all of creation are subservient to.  All movements occur by His will.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication when turning over during the night"
 },
 {
  "ZekarID": 113,
  "ZekarText": "aAAoothu bikalimatil-lahit-tammat min ghadabih,waAAiqabih, washarri AAibadih, wamin hamazatish-shayateen, wa-an yahduroon.\r\n‘I take refuge in the perfect words of Allah from His anger and punishment, and from the evil of His servants, and from the madness and appearance of devils.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon experiencing unrest, fear, apprehensiveness and the like during sleep"
 },
 {
  "ZekarID": 115,
  "ZekarText": "‘The righteous dream is from Allah and the bad dream is from the devil, so if anyone sees something which pleases him then he should only relate it to one whom he loves…’\r\nSummary of what to do upon having a bad dream:\r\n■ Spit on your left three times\r\nSpit: A form of spitting comprising mainly of air with little spittle\r\n■ Seek refuge in Allah from shaytan and the evil of what you saw\r\n■ Do not relate it to anyone\r\n■ Turn and sleep on the opposite side to which you were sleeping on previously.",
  "RepeatNumber": 3,
  "Tabweeb": "Upon seeing a good dream or a bad dream"
 },
 {
  "ZekarID": 117,
  "ZekarText": "Allahummah-dinee feeman hadayt, waAAafinee feeman AAafayt, watawallanee feeman tawallayt, wabarik lee feema aAAtayt, waqinee sharra ma qadayt, fa-innaka taqdee wala yuqda AAalayk, innahu la yathillu man walayt, [wala yaAAizzu man AAadayt], tabarakta rabbana wataAAalayt.\r\n‘O Allah, guide me along with those whom You have guided, pardon me along with those whom You have pardoned, be an ally to me along with those whom You are an ally to and bless for me that which You have bestowed.  Protect me from the evil You have decreed for verily You decree and none can decree over You.For surety, he whom you show allegiance to is never abased and he whom You take as an enemy is never honoured and mighty. O our Lord, Blessed and Exalted are You.’\r\nEvil you have decreed: Allah does not create pure evil which does not have any good or contain any benefit, wisdom or mercy at all, nor does He punish anyone without having commited a sin. Something can be good in terms of its creation when viewed in a particular perspective and at the same time be evil when viewed in another way.Allah created the devil and by him, He tests His servants, so there are those who hate the devil, fight him and his way and they stand at enmity towards him and his followers and there are others who are at allegiance with the devil and follow his steps. So evil exists in His creatures by His will and wisdom, not in His actions or act of creating.",
  "RepeatNumber": 1,
  "Tabweeb": "Qunoot Al-Witr"
 },
 {
  "ZekarID": 118,
  "ZekarText": "Allahumma innee aAAoothu biridaka min sakhatik, wabimuAAafatika min AAuqoobatik, wa-aAAoothu bika mink, la ohsee thana-an AAalayk, anta kama athnayta AAala nafsik.\r\n‘O Allah, I take refuge within Your pleasure from Your displeasure and within Your pardon from Your punishment, and I take refuge in You from You. I cannot enumerate Your praise. You are as You have praised Yourself.’",
  "RepeatNumber": 1,
  "Tabweeb": "Qunoot Al-Witr"
 },
 {
  "ZekarID": 119,
  "ZekarText": "Allahumma iyyaka naAAbud, walaka nusallee wanasjud, wa-ilayka nasAAa wanahfid, narjoo rahmatak, wanakhsha AAathabak, inna AAathabaka bilkafireena mulhaq. Allahumma inna nastaAAeenuk, wanastaghfiruk, wanuthnee AAalaykal- khayr, wala nakfuruk, wanu\/minu bik, wanakhdaAAu lak wanakhlaAAu man yakfuruk.\r\n‘O Allah, it is You we worship, and unto You we pray and prostrate, and towards You we hasten and You we serve. We hope for Your mercy and fear Your punishment, verily Your punishment will fall upon the disbelievers.O Allah, we seek Your aid and ask Your pardon, we praise You with all good and do not disbelieve in You.We believe in You and submit unto You, and we disown and reject those who disbelieve in You.",
  "RepeatNumber": 1,
  "Tabweeb": "Qunoot Al-Witr"
 },
 {
  "ZekarID": 120,
  "ZekarText": "The Messenger of Allah  would recite (the following chapters) during the witr prayer:\r\n( Sabbih isma rabbika al-aAAla ….)  \r\n[Al-aAAla]\r\n( Qul ya ayyuha alkafiroon …..)        \r\n[Al-kafiroon]\r\n( Qul huwa Allahu ahad …..)           \r\n[Al-ikhlas]\r\n…after giving salam he would supplicate three times:\r\n\r\nSubhanal-malikil-quddoos.(three times).\r\n‘How perfect The King, The Holy One is.’\t(three times)\r\n…on the third time he would raise his voice, elongate it and add:\r\nRabbil-mala-ikati warrooh.           \r\n‘Lord of the angles and the Rooh (i.e. Jibra-eel).",
  "RepeatNumber": 3,
  "Tabweeb": "Remembrance immediately after salam of the witr prayer"
 },
 {
  "ZekarID": 121,
  "ZekarText": "Allahumma innee AAabduk, ibnu AAabdik, ibnu amatik, nasiyatee biyadik, madin fiyya hukmuk, AAadlun fiyya qada-ok, as-aluka bikulli ismin huwa lak, sammayta bihi nafsak, aw anzaltahu fee kitabik, aw AAallamtahu ahadan min khalqik awis-ta\/tharta bihi fee AAilmil-ghaybi AAindak, an tajAAalal-Qurana rabeeAAa qalbee, wanoora sadree, wajalaa huznee wathahaba hammee.\r\n‘O Allah, I am Your servant, son of Your servant, son of Your maidservant, my forelock is in Your hand (i.e. You have total mastery over), Your command over me is forever executed and Your decree over me is just. I ask You by every name belonging to You which You named Yourself with, or revealed in Your Book, or You taught to any of Your creation, or You have preserved in the knowledge of the unseen with You, that You make the Quran the life of my heart and the light of my breast, and a departure for my sorrow and a release for my anxiety.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for anxiety and sorrow"
 },
 {
  "ZekarID": 122,
  "ZekarText": "Allahumma innee aAAoothu bika minal-hammi walhuzn, walAAajzi walkasali walbukhli waljubn, wadalAAid-dayni waghalabatir-rijal.\r\n‘O Allah, I take refuge in You from anxiety and sorrow, weakness and laziness, miserliness and cowardice, the burden of debts and from being over powered by men.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for anxiety and sorrow"
 },
 {
  "ZekarID": 123,
  "ZekarText": "La ilaha illal-lahul-AAatheemul-haleem, la ilaha illal-lahu rabbul-AAarshil-AAatheem, la ilaha illal-lahu  rabbus-samawati warabbul-ardi warabbul-AAarshil-kareem.\r\n‘None has the right to be worshipped except Allah Forbearing.  None has the right to be worshipped except Allah, Lord of the magnificent throne.  None has the right to be worshipped except Allah, Lord of the heavens, Lord of the Earth and Lord of the noble throne.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for one in distress"
 },
 {
  "ZekarID": 124,
  "ZekarText": "Allahumma rahmataka arjoo fala takilnee ila nafsee tarfata AAayn, wa-aslih lee sha\/nee kullah, la ilaha illa ant.\r\n‘O Allah, it is Your mercy that I hope for, so do not leave me in charge of my affairs even for a blink of an eye and rectify for me all of my affairs.None has the right to be worshipped except You.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for one in distress"
 },
 {
  "ZekarID": 125,
  "ZekarText": "La ilaha illa anta subhanaka innee kuntu minath-thalimeen.\r\n‘None has the right to be worshipped except You.  How perfect You are, verily I was among the wrong-doers.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for one in distress"
 },
 {
  "ZekarID": 126,
  "ZekarText": "Allahu Allahu rabbi la oshriku bihi shaya.\r\n‘Allah, Allah is my Lord, I do not associate anything with Him.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for one in distress"
 },
 {
  "ZekarID": 127,
  "ZekarText": "Allahumma inna najAAaluka fee nuhoorihim wanaAAoothu bika min shuroorihim.\r\n‘O Allah, we place You before them and we take refuge in You from their evil.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon encountering an enemy or those of authority"
 },
 {
  "ZekarID": 128,
  "ZekarText": "Allahumma anta AAadudee, wa-anta naseeree, bika ajoolu wabika asoolu wabika oqatil.\r\n‘O Allah, You are my supporter and You are my helper, by You I move and by You I attack and by You I battle.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon encountering an enemy or those of authority"
 },
 {
  "ZekarID": 129,
  "ZekarText": "Hasbunal-lahu waniAAmal-wakeel.\r\n‘Allah is sufficient for us, and how fine a trustee (He is).’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon encountering an enemy or those of authority"
 },
 {
  "ZekarID": 132,
  "ZekarText": "Allahumma munzilal-kitab, sareeAAal-hisab, ihzimil-ahzab, allahummah-zimhum wazalzilhum.\r\n‘O Allah, Revealer of the Book, Swift at reckoning, defeat the confederates. O Allah, defeat them and convulse them.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication made against an enemy"
 },
 {
  "ZekarID": 135,
  "ZekarText": "Allahummak-fineehim bima shi\/t.\r\n‘O Allah, protect me from them with what You choose.’",
  "RepeatNumber": 1,
  "Tabweeb": "What to say when in fear of a people"
 },
 {
  "ZekarID": 137,
  "ZekarText": "■ He should seek refuge in Allah\r\n■ He should renounce that which is causing such doubt.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for one afflicted with doubt in his faith"
 },
 {
  "ZekarID": 139,
  "ZekarText": "He should say:\r\n\r\nAmantu billahi warusulih.\r\n‘I have believed in Allah and His Messenger.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for one afflicted with doubt in his faith"
 },
 {
  "ZekarID": 140,
  "ZekarText": "■ He should also recite the following verse:\r\n\r\n(Huwa al-awwalu, waal-akhiru, waalththahiru waalbatinu wahuwa bikulli shayin AAaleem).\r\n‘He is The First and The Last, Aththahir and Al-Batin and He knows well all things.’\r\nAththahir: Indicates the greatness of His attributes and the insignificance of every single creation in respect to His greatness and Highness, for He is above all of His creation as regards His essence and attributes.\r\nAl-Batin: Indicates His awareness and knowledge of all secrets, of that which is in the hearts and the most intimate of things just as it indicates His closeness and nearness to all in a manner which befits His majesty.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for one afflicted with doubt in his faith"
 },
 {
  "ZekarID": 141,
  "ZekarText": "Allahummak-finee bihalalika AAan haramik, wa-aghninee bifadlika AAamman siwak.\r\n‘O Allah, make what is lawful enough for me, as opposed to what is unlawful, and spare me by Your grace, of need of others.’",
  "RepeatNumber": 1,
  "Tabweeb": "Settling a debt"
 },
 {
  "ZekarID": 142,
  "ZekarText": "Allahumma innee aAAoothu bika minal-hammi walhuzn, walAAajzi walkasal, walbukhl, waljubn, wadalAAid-dayni waghalabatir-rijal.\r\n‘O Allah, I take refuge in You from anxiety and sorrow, weakness and laziness, miserliness and cowardice, the burden of debts and from being over powered by men.’",
  "RepeatNumber": 1,
  "Tabweeb": "Settling a debt"
 },
 {
  "ZekarID": 143,
  "ZekarText": "‘othman Ibn Al-AAas  narrated: I said ‘O Messenger of Allah, verily the devil comes between me and my prayer and recitation making me confused’ The Messenger of Allah  replied ‘That is a devil called Khanzab, so if you sense his presence then seek refuge in Allah from him and spit (A form of spitting comprising mainly of air with little spittle) on your left side three times.’",
  "RepeatNumber": 3,
  "Tabweeb": "Supplication for one afflicated by whisperings in prayer or recitation"
 },
 {
  "ZekarID": 144,
  "ZekarText": "Allahumma la sahla illa ma jaAAaltahu sahla, wa-anta tajAAalul- hazana in shi\/ta sahla.\r\n‘O Allah, there is no ease except in that which You have made easy, and You make the difficulty, if You wish, easy.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for one whose affairs have become difficult"
 },
 {
  "ZekarID": 145,
  "ZekarText": "‘Any servant who commits a sin and as a result, performs ablution, prays two units of prayer (i.e. two rakAAas) and then seeks Allah’s forgiveness, Allah would forgive him.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon committing a sin"
 },
 {
  "ZekarID": 146,
  "ZekarText": "Seeking refuge from him.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for expelling the devil and his whisperings"
 },
 {
  "ZekarID": 147,
  "ZekarText": "The athan (call to prayer).",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for expelling the devil and his whisperings"
 },
 {
  "ZekarID": 148,
  "ZekarText": "Recitation of the Quran and the authentic texts of remembrance and supplications.\r\ne.g. ‘Do not make your homes like the graveyards, indeed the devils flee from the house in which soorat Al-Baqarah has been read’ related by Muslim 1\/539, also supplication and remembrance for the morning & evening, before sleep, when getting up, entering and leaving the toilet, entering and leaving the mosque, the recitation of ayat Al-kursiyy and the last two verses of soorat Al-Baqarah before sleeping, the athan…etc.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for expelling the devil and his whisperings"
 },
 {
  "ZekarID": 149,
  "ZekarText": "‘The strong believer is better and more beloved to Allah, than the weak believer and there is goodness in both. Strive for that which will benefit you ,seek help from Allah and do not despair.  If a mishap should happen to befall you then do not say ‘If only I had acted…such and such would have happened’.  Rather, say:\r\n\r\nQaddaral-lah, wama shaa faAAal.\r\n‘Allah has decreed and what He wills, He does.’\r\n…for verily ‘If’ lets in the work of the devil.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication when stricken with a mishap or overtaken by an affair"
 },
 {
  "ZekarID": 151,
  "ZekarText": "Ibn AAabbas related that the Messenger of Allah  used to commend Al-Hasan and Al-Husayn to Allah’s protection, saying:\r\n\r\nOAAeethukuma bikalimatil-lahit-tammah, min kulli shaytanin wahammah, wamin kulli AAaynin lammah.\r\n‘I commend you two to the protection of Allah’s perfect words from every devil, vermin, and every evil eye.’",
  "RepeatNumber": 1,
  "Tabweeb": "Placing childen under Allah’s protection"
 },
 {
  "ZekarID": 152,
  "ZekarText": "When the Prophet  would enter upon a sick person, he would say:\r\n\r\nLa ba\/sa tahoorun in shaal-lah.\r\n‘Never mind, may it (the sickness) be a purification, if Allah wills.’",
  "RepeatNumber": 1,
  "Tabweeb": "When visiting the sick"
 },
 {
  "ZekarID": 153,
  "ZekarText": "‘Any Muslim servant who visits a sick person whose prescribed moment of death has not arrived and supplicates seven times:\r\n\r\nAsalul-lahal-AAatheem rabbal-AAarshil-AAatheem an yashfeek (7times).\r\n‘I ask Allah The Supreme, Lord of the magnificent throne to cure you’.\r\n…he (the sick person) will be cured.’",
  "RepeatNumber": 7,
  "Tabweeb": "When visiting the sick"
 },
 {
  "ZekarID": 154,
  "ZekarText": "‘Ali Ibn Abee Talib  related that he heard the Messenger of Allah  say: ‘If a man calls on his sick Muslim brother, it is as if he walks reaping the fruits of Paradise until he sits, and when he sits he is showered in mercy, and if this was in the morning, seventy thousand angles send prayers upon him until the evening, and if this was in the evening, seventy thousand angles send prayers upon him until the morning.’",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of visiting the sick"
 },
 {
  "ZekarID": 155,
  "ZekarText": "Allahummagh-fir lee, warhamnee wa-alhiqnee birrafeeqil-aAAla.\r\n‘O Allah, forgive me, have mercy upon me and unite me with the higher companions.’\r\nRefer to the Quran, chapter 4, verse: 69.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication of the sick who have renounced all hope of life"
 },
 {
  "ZekarID": 156,
  "ZekarText": "AAaishah رضي الله عنها  related that the Prophet  (during his illness in which he passed away) would dip his hands in water and then he would wipe his face and say:\r\n\r\nLa ilaha illal-lah, inna lilmawti lasakarat.\r\n‘None has the right to be worshipped except Allah, death does indeed contain agony.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication of the sick who have renounced all hope of life"
 },
 {
  "ZekarID": 157,
  "ZekarText": "La ilaha illal-lah, wallahu akbar, la ilaha illal-lahu wahdah, la shareeka lah, la ilaha illal-lahu lahul-mulku walahul-hamd, la ilaha illal-lah, wala hawla wala quwwata illa billah.\r\n‘None has the right to be worshipped except Allah and Allah is the greatest.None has the right to be worshipped except Allah, alone.None has the right to be worshipped except Allah, alone, without partner.None has the right to be worshipped except Allah, to Him belongs all sovereignty and praise.  None has the right to be worshipped except Allah and there is no might and no power except with Allah.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication of the sick who have renounced all hope of life"
 },
 {
  "ZekarID": 158,
  "ZekarText": "i.e. those around the sick should instruct and encourage him to say the shahadah. \r\n(145) \t\r\n‘He whose last words are:\r\n\r\nLa ilaha illal-lah.\r\n‘None has the right to be worshipped except Allah.’\r\n…will enter Paradise.’",
  "RepeatNumber": 1,
  "Tabweeb": "Instruction for the one nearing death"
 },
 {
  "ZekarID": 159,
  "ZekarText": "Inna lillahi wa-inna ilayhi rajiAAoon, allahumma\/- jurnee fee museebatee wakhluf lee khayran minha.\r\n‘To Allah we belong and unto Him is our return.O Allah, recompense me for my affliction and replace it for me with something better.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for one afflicted by a calamity"
 },
 {
  "ZekarID": 160,
  "ZekarText": "Allahummagh-fir li-name the dead- warfaAA darajatahu fil-mahdiyyeen, wakhlufhu fee AAaqibihi fil-ghabireen, waghfir lana walahu ya rabbal-AAalameen wafsah lahu fee qabrih, wanawwir lahu feeh.\r\n‘O Allah, forgive -here the name of the deceased is mentioned- and raise his rank among the rightly guided, and be a successor to whom he has left behind, and forgive us and him O Lord of the worlds.  Make spacious his grave and illuminate it for him.’\r\nA successor: one who succeeds another due to the latter’s absence or death. This is the correct meaning of the word khaleefah; thus, it is incorrect to believe that Adam is the khaleefah (vicegerent, as is commonly translated) of Allah on earth because Allah is never absent, and will never die.  This supplication proves the correct understanding of this term and shows that Allah succeeds us and guards whom we leave behind when we die or are absent (also refer to supplication #198).",
  "RepeatNumber": 1,
  "Tabweeb": "When closing the eyes of the deceased"
 },
 {
  "ZekarID": 161,
  "ZekarText": "Allahummagh-fir lahu warhamh, waAAafihi, waAAfu AAanh, wa-akrim nuzulah, wawassiAA mudkhalah, waghsilhu bilma-i waththalji walbarad, wanaqqihi minal-khataya kama naqqaytath-thawbal-abyada minad-danas, wa-abdilhu daran khayran min darih, wa-ahlan khayran min ahlih wazawjan khayran min zawjih, wa-adkhilhul-jannah, wa-aAAithhu min AAathabil-qabr, waAAathabin-nar.\r\n‘O Allah, forgive and have mercy upon him, excuse him and pardon him, and make honourable his reception. Expand his entry, and cleanse him with water, snow, and ice, and purify him of sin as a white robe is purified of filth.  Exchange his home for a better home, and his family for a better family, and his spouse for a better spouse. Admit him into the Garden, protect him from the punishment of the grave and the torment of the Fire.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for the deceased at the funeral prayer"
 },
 {
  "ZekarID": 162,
  "ZekarText": "Allahummagh-fir lihayyina wamayyitina washahidina, wagha-ibina, wasagheerina wakabeerina, wathakarina wa-onthana. Allahumma man ahyaytahu minna fa-ahyihi AAalal-islam, waman tawaffaytahu minna fatawaffahu AAalal-eeman, allahumma la tahrimna ajrah, wala tudillana baAAdah.\r\n‘O Allah, forgive our living and our dead, those present and those absent, our young and our old, our males and our females.  O Allah, whom amongst us You keep alive, then let such a life be upon Islam, and whom amongst us You take unto Yourself, then let such a death be upon faith.  O Allah, do not deprive us of his reward and do not let us stray after him.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for the deceased at the funeral prayer"
 },
 {
  "ZekarID": 163,
  "ZekarText": "Allahumma inna -name the dead- fee thimmatik, wahabli jiwarik, faqihi min fitnatil-qabr waAAathabin-nar, wa-anta ahlul-wafa\/, walhaq, faghfir lahu warhamh, innaka antal-ghafoorur-raheem.\r\n‘O Allah, so-and-so is under Your care and protection so protect him from the trial of the grave and torment of the Fire.  Indeed You are faithful and truthful. Forgive and have mercy upon him, surely You are The Oft-Forgiving, The Most-Merciful.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for the deceased at the funeral prayer"
 },
 {
  "ZekarID": 164,
  "ZekarText": "Allahumma AAabduka wabnu amatik, ihtaja ila rahmatik, wa-anta ghaniyyun AAan AAathabih, in kana muhsinan fazid fee hasanatih, wa-in kana museean fatajawaz AAanh.\r\n‘O Allah, Your servant and the son of Your maidservant is in need of Your mercy and You are without need of his punishment. If he was righteous then increase his reward and if he was wicked then look over his sins.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for the deceased at the funeral prayer"
 },
 {
  "ZekarID": 165,
  "ZekarText": "This supplication is made when the deceased is a baby\/child (i.e. one not having reached the age of puberty).\r\n\r\nAfter seeking forgiveness for the deceased, one can say:\r\n\r\nAllahummaj-AAalhu faratan, wathukhran liwalidayh, washafeeAAan mujaban. Allahumma thaqqil bihi mawazeenahuma wa-aAAthim bihi ojoorahuma, wa-alhiqhu bisalihil-mu\/mineen, wajAAalhu fee kafalati Ibraheem, waqihi birahmatika AAathabal-jaheem.\r\n‘O Allah, make him a preceding reward and a stored treasure for his parents, and an answered intercessor. O Allah, through him, make heavy their scales and magnify their reward.  Unite him with the righteous believers, place him under the care of Ibraheem, and protect him by Your mercy from the torment of Hell.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for the advancement of reward during the   funeral prayer"
 },
 {
  "ZekarID": 166,
  "ZekarText": "Al-Hasan used to recite the opening chapter of the Quran (i.e. AL-Fatihah) over the child and then supplicates:\r\n\r\nAllahummaj-AAalhu lana farata, wasalafan wa-ajra.\r\n‘O Allah, make him a preceding reward, a prepayment and a recompense for us.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for the advancement of reward during the   funeral prayer"
 },
 {
  "ZekarID": 167,
  "ZekarText": "Inna lillahi ma akhath, walahu ma aAAta, wakullu shayin AAindahu bi-ajalin musamma…faltasbir waltahtasib.\r\n‘Verily to Allah, belongs what He took and to Him belongs what He gave, and everything with Him has an appointed time…and then he  ordered for her to be patient and hope for Allah’s reward.’\r\nThe words (faltasbir waltahtasib) are commands in the feminine 3rd person form, so they will need to be changed in respect to whom is being addressed.\r\n...and one can also say:\r\n\r\naAAthamal-lahu ajrak, wa-ahsana AAazaak, waghafara limayyitik.\r\n‘May Allah magnify your reward, make better your solace and forgive your deceased.’\r\nThis is the saying of some of the scholars, not a hadeeth.",
  "RepeatNumber": 1,
  "Tabweeb": "Condolence"
 },
 {
  "ZekarID": 168,
  "ZekarText": "Bismil-lahi waAAala sunnati rasoolil-lah.\r\n‘In the name of Allah and upon the sunnah of the Messenger of Allah.’",
  "RepeatNumber": 1,
  "Tabweeb": "Placing the deceased in the grave"
 },
 {
  "ZekarID": 169,
  "ZekarText": "‘After the Prophet  would bury the deceased he would stand by the grave and say: ‘Seek forgiveness for your brother and pray that he remains firm, for he is now being questioned’.’",
  "RepeatNumber": 1,
  "Tabweeb": "After burying the deceased"
 },
 {
  "ZekarID": 170,
  "ZekarText": "Assalamu AAalaykum ahlad-diyari minal-mu\/mineena walmuslimeen, wa-inna in shaal-lahu bikum lahiqoon, nas-alul-laha lana walakumul-AAafiyah.\r\n‘Peace be upon you all, O inhabitants of the graves, amongst the believers and the Muslims. Verily we will, Allah willing, be united with you, we ask Allah for well-being for us and you.’",
  "RepeatNumber": 1,
  "Tabweeb": "Visiting the graves"
 },
 {
  "ZekarID": 171,
  "ZekarText": "Allahumma innee as-aluka khayraha wa-aAAoothu bika min sharriha.\r\n‘O Allah, I ask You for it’s goodness and I take refuge with You from it’s evil.’",
  "RepeatNumber": 1,
  "Tabweeb": "Prayer said during a wind storm"
 },
 {
  "ZekarID": 172,
  "ZekarText": "Allahumma innee as-aluka khayraha wakhayra ma feeha, wakhayra ma orsilat bih, wa-aAAoothu bika min sharriha, washarri ma feeha washarri ma orsilat bih.\r\n‘O Allah, I ask You for it’s goodness, the good within it, and the good it was sent with, and I take refuge with You from it’s evil, the evil within it, and from the evil it was sent with.’",
  "RepeatNumber": 1,
  "Tabweeb": "Prayer said during a wind storm"
 },
 {
  "ZekarID": 173,
  "ZekarText": "When AAabdullah Ibn Az-Zubayr  used to hear thunder he would stop talking and say:\r\n\r\n Subhanal-lathee yusabbihur-raAAdu bihamdih, walmala-ikatu min kheefatih.\r\n‘How perfect He is, (The One) Whom the thunder declares His perfection with His praise, as do the angles out of fear of Him.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication upon hearing thunder"
 },
 {
  "ZekarID": 174,
  "ZekarText": "Allahummas-qina ghaythan mugheethan maree-an mureeAAan, nafiAAan, ghayra dar, AAajilan ghayra ajil.\r\n‘O Allah, send upon us helpful, wholesome and healthy rain, beneficial not harmful rain, now, not later.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for rain"
 },
 {
  "ZekarID": 175,
  "ZekarText": "Allahumma aghithna, allahumma aghithna, allahumma aghithna.\r\n‘O Allah, relieve us, O Allah, relieve us, O Allah, relieve us.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for rain"
 },
 {
  "ZekarID": 176,
  "ZekarText": "Allahummas-qi AAibadak, wabaha-imak, wanshur rahmatak, wa-ahyi baladakal-mayyit.\r\n‘O Allah, provide water for Your servants and Your cattle, spread out Your mercy and resurrect Your dead land.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for rain"
 },
 {
  "ZekarID": 177,
  "ZekarText": "Allahumma sayyiban nafiAAa.\r\n‘O Allah, may it be a beneficial rain cloud.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said when it rains"
 },
 {
  "ZekarID": 178,
  "ZekarText": "Mutirna bifadlil-lahi warahmatih.\r\n‘We have been given rain by the grace and mercy of Allah.’",
  "RepeatNumber": 1,
  "Tabweeb": "After rainfall"
 },
 {
  "ZekarID": 179,
  "ZekarText": "Allahumma hawalayna wala AAalayna, allahumma AAalal-akami waththirab, wabutoonil-awdiyah, wamanabitish-shajar.\r\n‘O Allah, let the rain fall around us and not upon us, O Allah, (let it fall) on the pastures, hills, valleys and the roots of trees.’",
  "RepeatNumber": 1,
  "Tabweeb": "Asking for clear skies"
 },
 {
  "ZekarID": 180,
  "ZekarText": "Allahu akbar, allahumma ahillahu AAalayna bil-amni wal-eeman, wassalamati wal-islam, wattawfeeiqi lima tuhibbu watarda, rabbuna warabbukal-lah.\r\n‘Allah is the greatest. O Allah, let the crescent loom above us in safety, faith, peace, and Islam, and in agreement with all that You love and pleases You. Our Lord and your Lord is Allah.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon sighting the crescent moon"
 },
 {
  "ZekarID": 181,
  "ZekarText": "Thahabath-thama-o wabtallatil-AAurooq, wathabatal-ajru in shaal-lah.\r\n‘The thirst has gone and the veins are quenched, and reward is confirmed, if Allah wills.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon breaking fast"
 },
 {
  "ZekarID": 182,
  "ZekarText": "‘AAabdullah Ibn AAamr Ibn Al-AAas  related that the Messenger of Allah  said: ‘Indeed the fasting person has at the time of breaking fast, a supplication which is not rejected’.  Ibn Abee Mulaykah رحمه الله  said: ‘I Heard AAabdullah Ibn AAomar say when he broke his fast:\r\n\r\nAllahumma inne as-aluka birahmatikal-latee wasiAAat kulla shay, an taghfira lee.\r\n‘O Allah, I ask You by Your mercy which envelopes all things, that You forgive me.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon breaking fast"
 },
 {
  "ZekarID": 183,
  "ZekarText": "‘When you are about to eat, you should say:\r\n\r\n Bismil-lah.\r\n…and if you forget to say it before starting, then you should say (when you remember):\r\n\r\nBismil-lahi fee awwalihi wa-akhirih.\r\n‘In the name of Allah in it’s beginning and end.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication before eating"
 },
 {
  "ZekarID": 184,
  "ZekarText": "‘Whomever Allah feeds, should say:\r\n\r\n Allahumma barik lana feehi wa-atAAimna khayran minh.\r\n ‘O Allah, bless it for us and feed us better than it.’\r\n….and whomever Allah gives milk to drink should say:\r\n\r\nAllahumma barik lana feehi wazidna minh.\r\n‘O Allah, bless it for usand give us more of it.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication before eating"
 },
 {
  "ZekarID": 185,
  "ZekarText": "Alhamdu lillahil-lathee atAAamanee hatha warazaqaneehi min ghayri hawlin minnee wala quwwah.\r\n‘All praise is for Allah who fed me this and provided it for me without any might nor power from myself.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon completing the meal"
 },
 {
  "ZekarID": 186,
  "ZekarText": "Alhamdu lillahi hamdan katheeran tayyiban mubarakan feeh, ghayra makfiyyin wala muwaddaAAin, wala mustaghnan AAanhu rabbuna.\r\n‘Allah be praised with an abundant beautiful blessed praise, a never-ending praise, a praise which we will never bid farewell to and an indispensable praise, He is our Lord.’\r\nThere are other views as regards to the understanding of this supplication, from them: Allah be praised with an abundant beautiful blessed praise. He is The One Who is sufficient, feeds and is not fed. The One Who is longed for, along with that which is with Him and The One Who is needed, He is our Lord.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon completing the meal"
 },
 {
  "ZekarID": 187,
  "ZekarText": "Allahumma barik lahum feema razaqtahum, waghfir lahum warhamhum.\r\n‘O Allah, bless for them, that which You have provided them, forgive them and have mercy upon them.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication of the guest for the host"
 },
 {
  "ZekarID": 188,
  "ZekarText": "Allahumma atAAim man atAAamanee wasqi man saqanee.\r\n‘O Allah, feed him who fed me, and provide with drink him who provided me with drink.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said to one offering a drink or to one who intended to do that"
 },
 {
  "ZekarID": 189,
  "ZekarText": "Aftara AAindakumus-sa-imoon, wa-akala taAAamakumul-abrar, wasallat AAalaykumul-mala-ikah.\r\n‘May the fasting break their fast in your home, and may the dutiful and pious eat your food, and may the angles send prayers upon you.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said when breaking fast in someone’s home"
 },
 {
  "ZekarID": 190,
  "ZekarText": "‘If you are not invited (to a meal) then answer.  If  you happen to be fasting, then supplicate (for those present) and if you are not fasting, then eat.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said by one fasting when presented with food and does not break his fast"
 },
 {
  "ZekarID": 191,
  "ZekarText": "Innee sa-im, innee sa-im.\r\n‘I am fasting, I am fasting.’",
  "RepeatNumber": 1,
  "Tabweeb": "When insulted while fasting"
 },
 {
  "ZekarID": 192,
  "ZekarText": "Allahumma barik lana fee thamarina, wabarik lana fee madeenatina, wabarik lana fee saAAina wabarik lana fee muddina.\r\n‘O Allah, bless our fruit for us, bless our town for us, bless our saAA for us and bless our mudd for us.’\r\nA saAA is equivalent to four mudds and a mudd is equivalent to a dry measure of an average man’s two palms.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said upon seeing the early or premature fruit"
 },
 {
  "ZekarID": 193,
  "ZekarText": "‘When one of you sneezes he should say:\r\n\r\nAlhamdu lillah.\r\n‘All praise if for Allah.’\r\n…and his brother or companion should say to him:\r\n\r\nYarhamukal-lah.\r\n‘May Allah have mercy upon you.’\r\n…and he (i.e. the one who sneezed) replies back to him:\r\n\r\nYahdeekumul-lahu wayuslihu balakum.\r\n‘May Allah guide you and rectify your condition.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said upon sneezing"
 },
 {
  "ZekarID": 194,
  "ZekarText": "Yahdeekum wayuslihu balakum.\r\n‘May Allah guide you and rectify your condition.’",
  "RepeatNumber": 1,
  "Tabweeb": "What is said to a Kafir when he sneezes"
 },
 {
  "ZekarID": 195,
  "ZekarText": "Barakal-lahu lak, wabaraka AAalayk, wajamaAAa baynakuma fee khayr.\r\n‘May Allah bless for you (your spouse) and bless you, and may He unite both of you in goodness.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said to the newlywed"
 },
 {
  "ZekarID": 196,
  "ZekarText": "when you marry a woman or buy a maidservant, you should say:\r\n\r\nAllahumma innee as-aluka khayraha wakhayra ma jabaltaha AAalayh, wa-aAAoothu bika min sharriha washarri ma jabaltaha AAalayh.\r\n‘O Allah, I ask You for the goodness within her and the goodness that you have made her inclined towards, and I take refuge with You from the evil within her and the evil that you have made her inclined towards.’\r\n…and if you buy a camel, then you should take hold of it’s hump and say likewise.’",
  "RepeatNumber": 1,
  "Tabweeb": "The groom’s supplication on the wedding night or when buying an animal"
 },
 {
  "ZekarID": 197,
  "ZekarText": "Bismil-lah, allahumma jannibnash-shaytan, wajannibish-shaytana ma razaqtana.\r\n‘In the name of Allah. O Allah, keep the devil away from us and keep the devil away from what you have blessed us with.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication before sexual intercourse"
 },
 {
  "ZekarID": 198,
  "ZekarText": "aAAoothu billahi minash-shaytanir-rajeem.\r\n‘I take refuge with Allah from the accursed devil.’",
  "RepeatNumber": 1,
  "Tabweeb": "When angry"
 },
 {
  "ZekarID": 199,
  "ZekarText": "This supplication is to be said to one’s self, not directly to the one in trial or tribulation.\r\nAlhamdu lillahil-lathee AAafanee mimmab-talaka bih, wafaddalanee AAala katheerin mimman khalaqa tafdeela.\r\n‘All praise is for Allah Who saved me from that which He tested you with and Who most certainly favoured me over much of His creation.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said upon seeing someone in trial or tribulation"
 },
 {
  "ZekarID": 200,
  "ZekarText": "Ibn AAumar  said: It would be counted that the Messenger of Allah  would say one hundred times at any one sitting before getting up:\r\n Rabbigh-fir lee watub AAalay, innaka antat-tawwabul-ghafoor.\r\n‘O my Lord, forgive me and turn towards me (to accept my repentance). Verily You are The Oft-Returning. The Oft-Forgiving.’",
  "RepeatNumber": 100,
  "Tabweeb": "Remembrance said at a sitting or gathering…etc"
 },
 {
  "ZekarID": 201,
  "ZekarText": "Subhanakal-lahumma wabihamdik, ashhadu an la ilaha illa ant, astaghfiruka wa-atoobu ilayk.\r\n‘How perfect You are O Allah, and I praise You.  I bear witness that None has the right to be worshipped except You.  I seek Your forgiveness and turn to You in repentance.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for the expiation of sins said at the conclusion of a sitting or gathering…etc"
 },
 {
  "ZekarID": 202,
  "ZekarText": "‘AAabdullah Ibn Sarjis  said: ‘I went to see the Prophet  and ate from his food and then said to him: \r\n\r\nGhafaral-lahu laka ya rasoolal-lah.\r\n‘May Allah forgive you, O Messenger of Allah.’\r\n…he  replied:\r\n\t\r\nwa-lak\r\n‘and you.’",
  "RepeatNumber": 1,
  "Tabweeb": "Returning a supplication of forgiveness"
 },
 {
  "ZekarID": 203,
  "ZekarText": "‘If someone does you a favour and you say:\r\n\r\nJazakal-lahu khayran.\r\n‘May Allah reward you with goodness.’\r\n…then you have indeed excelled in praising him.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said to one who does you a favour"
 },
 {
  "ZekarID": 204,
  "ZekarText": "Dajjal: among the great signs of the last hour and the greatest trials to befall mankind, which every Prophet has warned about.  Most of mankind will folow him. He will appear from Asbahan, Iran at the time when Muslims will conquer Constantinople.  He will be given special powers and will make the truth seem false and vice versa. He will claim to be righteous and then he will claim prophet-hood and finally, divinity. From his features is that he will be blind in his right eye which is a definite proof that contradicts his claim to be Allah as it is a sign of imperfection.  The word Kafir will be written between his eyes which every believer, literate or illiterate will recognise\r\n\r\n‘Whoever memorises the first ten verses of soorat Al-Kahf will be protected from Dajjal.’\r\nOne should also seek refuge with Allah from the tribulations of the Dajjal after the last tashahhud in prayer.(Refer to supplications #55 & #56)",
  "RepeatNumber": 1,
  "Tabweeb": "Protection from the Dajjal"
 },
 {
  "ZekarID": 205,
  "ZekarText": "Ahabbakal-lathee ahbabtanee lah.\r\n‘May He, for whom you have loved me, love you.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said to one who pronounces his love for you, for Allah’s sake"
 },
 {
  "ZekarID": 206,
  "ZekarText": "Barakal-lahu laka fee ahlika wamalik.\r\n‘May Allah bless for you, your family and wealth.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said to one who has offered you some of his wealth"
 },
 {
  "ZekarID": 207,
  "ZekarText": "Barakal-lahu laka fee ahlika wamalik, innama jaza-os-salafil-hamdu wal-ada\/.\r\n‘May Allah bless for you, your family and wealth. Surely commendation and payment are the reward for a loan.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said to the debtor when his debt is settled"
 },
 {
  "ZekarID": 208,
  "ZekarText": "shirk: to associate others with Allah in those things which are specific to Him.  This can occur in (1) belief, e.g. to believe that other than Allah has the power to benefit or harm, (2) speech, e.g. to swear by other than Allah and (3) action, e.g. to bow or prostrate to other than Allah.\r\n\r\nAllahumma innee aAAoothu bika an oshrika bika wa-ana aAAlam, wa-astaghfiruka lima la aAAlam.\r\n‘O Allah, I take refuge in You lest I should commit shirk with You knowingly and I seek Your forgiveness for what I do unknowingly.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for fear of shirk"
 },
 {
  "ZekarID": 209,
  "ZekarText": "AAaishah رضي الله عنها  reported that the Messenger of Allah  was given a sheep and he ordered for it’s distribution.  When the servant would come back (from distributing it), AAaishah would ask: ‘What did they say?’, he replied: They would supplicate:\r\n\r\nBarakal-lahu feekum.\r\n‘May Allah bless you all.’\r\n…AAaishah would then say:\r\n\r\n Wafeehim barakal-lah.\r\n‘and may Allah bless them.’\r\n…we return their supplication in a similar way and our reward remains with us.",
  "RepeatNumber": 1,
  "Tabweeb": "Returning a supplication after having bestowed a gift or charity upon someone"
 },
 {
  "ZekarID": 210,
  "ZekarText": "This supplication is used whenever one initially thinks a casual event or occurrence to foretell good or evil, using it as a basis to determine which action he should undertake, but he then denounces such a link, relies on Allah and then says this supplication as an expiation for this act, since it falls under the category of shirk.\r\n\r\nAllahumma la tayra illa tayruk, wala khayra illa khayruk, wala ilaha ghayruk.\r\n‘O Allah, there is no omen but there is reliance on You, there is no good except Your good and none has the right to be worshipped except You.’",
  "RepeatNumber": 1,
  "Tabweeb": "Forbiddance of ascribing things to omens"
 },
 {
  "ZekarID": 211,
  "ZekarText": "Bismil-lah, walhamdu lillah, subhanal-lathee sakhkhara lana hatha wama kunna lahu muqrineen, wainna ila rabbina lamunqaliboon, alhamdu lillah, alhamdu lillah, alhamdu lillah, Allahu akbar, Allahu akbar, Allahu akbar, subhanakal-lahumma innee thalamtu nafsee faghfir lee fainnahu la yaghfiruth-thunooba illa ant.\r\n‘In the name of Allah and all praise is for Allah.  How perfect He is, the One Who has placed this (transport) at our service and we ourselves would not have been capable of that, and to our Lord is our final destiny.  All praise is for Allah, All praise is for Allah, All praise is for Allah,  Allah is the greatest, Allah is the greatest, Allah is the greatest. How perfect You are, O Allah, verily I have wronged my soul, so forgive me, for surely none can forgive sins except You.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said when mounting an animal or any means of transport"
 },
 {
  "ZekarID": 212,
  "ZekarText": "Allahu akbar, Allahu akbar, Allahu akbar, subhanal-lathee sakhkhara lana hatha wama kunna lahu muqrineen, wa-inna ila rabbina lamunqaliboon, allahumma inna nas-aluka fee safarina hatha albirra wattaqwa, waminal-AAamali ma tarda, allahumma hawwin AAalayna safarana hatha, watwi AAanna buAAdah, allahumma antas-sahibu fis-safar, walkhaleefatu fil-ahl, allahumma innee aAAoothu bika min waAAtha-is-safar, waka-abatil-manthar, wasoo-il-munqalabi fil-mali wal-ahl.\r\n‘Allah is the greatest, Allah is the greatest, Allah is the greatest, How perfect He is, The One Who has placed this (transport) at our service, and we ourselves would not have been capable of that, and to our Lord is our final destiny.  O Allah, we ask You for birr and taqwa in this journey of ours, and we ask You for deeds which please You.  O Allah, facilitate our journey and let us cover it’s distance quickly.  O Allah, You are The Companion on the journey and The Successor over the family, O Allah, I take refuge with You from the difficulties of travel, from having a change of hearts and being in a bad predicament, and I take refuge in You from an ill fated outcome with wealth and family.’\r\nbirr and taqwa: two comprehensive terms which individually, refer to all good actions and obedience i.e. performing the commanded actions and avoiding the prohibited actions.  When combined together, birr refers to doing those actions which have been commanded and taqwa refers to avoiding those actions which have been prohibited.\r\nA successor: one who succeeds another due to the latter’s absence or death.  This is the correct meaning of the word khaleefah; thus, it is incorrect to believe that Adam is the khaleefah (vicegerent, as is commonly translated) of Allah on earth because Allah is never absent, and will never die.  This supplication proves the correct understanding of this term and shows that Allah succeeds us and guards whom we leave behind when we die or are absent.\r\n…upon returning the same supplication is recited with the following addition:\r\n\r\nAyiboona, ta-iboona, AAabidoona, lirabbina hamidoon.\r\n‘We return, repent, worship and praise our Lord.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for travel"
 },
 {
  "ZekarID": 213,
  "ZekarText": "Allahumma rabbas-samawatis-sabAAi wama athlaln, warabbal-aradeenas-sabAAi wama aqlaln, warabbash-shayateeni wama adlaln, warabbar-riyahi wama tharayn, as-aluka khayra hathihil-qaryah, wakhayra ahlilha wakhayra ma feeha, wa-aAAoothu bika min sharriha washarri ahliha, washarri ma feeha.\r\n‘O Allah, Lord of the seven heavens and all that they envelop, Lord of the seven earths and all that they carry, Lord of the devils and all whom they misguide, Lord of the winds and all whom they whisk away. I ask You for the goodness of this village, the goodness of its inhabitants and for all the goodness found within it and I take refuge with You from the evil of this village, the evil of its inhabitants and from all the evil found within it.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication upon entering a town or village…etc"
 },
 {
  "ZekarID": 214,
  "ZekarText": "La ilaha illal-lah,  wahdahu la shareeka lah, lahul-mulku walahul-hamd, yuhyee wayumeetu wahuwa hayyun la yamoot, biyadihil-khayru wahuwa  AAala kulli shayin qadeer.\r\n‘None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise.  He gives life and causes death, and He is living and does not die.  In His hand is all good and He is over all things, omnipotent.’",
  "RepeatNumber": 1,
  "Tabweeb": "When entering the market"
 },
 {
  "ZekarID": 215,
  "ZekarText": "Bismil-lah.\r\n‘In the name of Allah.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication for when the mounted animal (or mean of transport) stumbles"
 },
 {
  "ZekarID": 216,
  "ZekarText": "AstawdiAAukumul-lah, allathee la tadeeAAu wada-iAAuh.\r\n‘I place you in the trust of Allah, whose trust is never misplaced.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication of the traveller for the resident"
 },
 {
  "ZekarID": 217,
  "ZekarText": "AstawdiAAul-laha deenak, wa-amanatak, wakhawateema AAamalik.\r\n‘I place your religion, your faithfulness and the ends of your deeds in the trust of Allah.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication of the resident for the traveller"
 },
 {
  "ZekarID": 218,
  "ZekarText": "Zawwadakal-lahut-taqwa, waghafara thanbak, wayassara lakal-khayra haythuma kunt.\r\n‘May Allah endow you with taqwa, forgive your sins and facilitate all good for you, wherever you be.’\r\ntaqwa: a comprehensive term which refers to all good actions and obedience i.e. performing the commanded actions and avoiding the prohibited actions.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication of the resident for the traveller"
 },
 {
  "ZekarID": 219,
  "ZekarText": "Jabir  said: While ascending, we would say:\r\n\r\n Allahu akbar.\r\n‘Allah is the greatest.’\r\n…and when descending, we would say:\r\n\r\nSubhanal-lah.\r\n‘How perfect Allah is.’",
  "RepeatNumber": 1,
  "Tabweeb": "Remembrance while ascending or descending"
 },
 {
  "ZekarID": 220,
  "ZekarText": "SamiAAa samiAAun bihamdil-lahi wahusni bala-ihi AAalayna. Rabbana sahibna wa-afdil AAalayna AAa-ithan billahi minan-nar.\r\n‘May a witness, be witness to our praise of Allah for His favours and bounties upon us.  Our Lord, protect us, show favour on us and deliver us from every evil.  I take refuge in Allah from the fire.’",
  "RepeatNumber": 1,
  "Tabweeb": "Prayer of the traveller as dawn approaches"
 },
 {
  "ZekarID": 221,
  "ZekarText": "aAAoothu bikalimatil-lahit-tammati min sharri ma khalaq.\r\n‘I take refuge in Allah’s perfect words from the evil that He has created.’",
  "RepeatNumber": 1,
  "Tabweeb": "Stopping or lodging somewhere"
 },
 {
  "ZekarID": 222,
  "ZekarText": "Ibn AAumar  reported that the Messenger of Allah  on return from a battle or from performing the pilgrimage would say at every high point:\r\n\r\nAllahu akbar, Allahu akbar, Allahu akbar.\r\n‘Allah is the greatest, Allah is the greatest, Allah is the greatest.’\r\n…and then he would say:\r\nLa ilaha illal-lahu wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shay-in qadeer, ayiboona ta-iboon, AAabidoon, lirabbina hamidoon, sadaqal-lahu waAAdah, wanasara AAabdah, wahazamal-ahzaba wahdah.\r\n‘None has the right to be worshipped except Allah, alone, without partner.  To Him belongs all sovereignty and praise, and He is over all things omnipotent.  We return, repent, worship and praise our Lord.  Allah fulfilled His promise, aided His Servant, and single-handedly defeated the allies.’",
  "RepeatNumber": 1,
  "Tabweeb": "While returning from travel"
 },
 {
  "ZekarID": 223,
  "ZekarText": "When he  used to receive pleasant news, he  would say:\r\n\r\nAlhamdu lillahil-lathee biniAAmatihi tatimmus-salihat.\r\n‘All Praise is for Allah by whose favour good works are accomplished.’\r\n…and upon receiving displeasing news, he  would say:\r\n\r\nAlhamdu lillahi AAala kulli hal.\r\n‘All Praise is for Allah in all circumstances.’",
  "RepeatNumber": 1,
  "Tabweeb": "What to say upon receiving pleasing or displeasing news"
 },
 {
  "ZekarID": 224,
  "ZekarText": "The Prophet  said: ‘Whoever sends a prayer upon me, Allah sends ten upon him.’",
  "RepeatNumber": 10,
  "Tabweeb": "Excellence of sending prayers upon the Prophet "
 },
 {
  "ZekarID": 225,
  "ZekarText": "He  also said: ‘Do not take my grave as a place of habitual ceremony.  Send prayers upon me, for verily your prayers reach me wherever you are.’",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of sending prayers upon the Prophet "
 },
 {
  "ZekarID": 226,
  "ZekarText": "He  also said: ‘A miser is one whom when I am mentioned to him,  fails to send prayers upon me.",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of sending prayers upon the Prophet "
 },
 {
  "ZekarID": 229,
  "ZekarText": "The Messenger of Allah  said: ‘You shall not enter paradise until you believe, and you shall not believe until you love one another. Shall I not inform you of something, if you were to act upon it, you will indeed achieve mutual love for one another?  Spread the greeting amongst yourselves.’",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of spreading the Islamic greeting"
 },
 {
  "ZekarID": 230,
  "ZekarText": "AAammar  said: ‘Three characteristics, whoever combines them, has completed his faith: to be just, to spread greetings to all people and to spend (charitably) out of the little you have.’",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of spreading the Islamic greeting"
 },
 {
  "ZekarID": 231,
  "ZekarText": "‘AAabdullah Ibn AAamr  reported that a man asked the Prophet : ‘Which Islam is the best?’.  He  replied: Feed (the poor), and greet those whom you know as well as those whom you do not.’",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of spreading the Islamic greeting"
 },
 {
  "ZekarID": 232,
  "ZekarText": "When the people of the Book greet you, reply by saying:\r\n\r\nWaAAalaykum.\r\n‘And upon you.’",
  "RepeatNumber": 1,
  "Tabweeb": "Returning a greeting to a Kafir"
 },
 {
  "ZekarID": 233,
  "ZekarText": "‘If you hear the crow of a rooster, ask Allah for his bounty for it has seen an angel and if you hear the braying of an ass, seek refuge in Allah for it has seen a devil.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said upon hearing a rooster crow or the braying of an ass"
 },
 {
  "ZekarID": 234,
  "ZekarText": "‘If you hear the barking of dogs or the braying of asses at night, seek refuge in Allah for they see what you do not.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication upon hearing the barking of dogs at night"
 },
 {
  "ZekarID": 235,
  "ZekarText": "Allahumma fa-ayyuma mu\/minin sababtuhu fajAAal thalika lahu qurbatan ilayka yawmal-qiyamah.\r\n‘O Allah, to any believer whom I have insulted, let that be cause to draw him near to You on the Day of Resurrection.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said for one you have insulted"
 },
 {
  "ZekarID": 236,
  "ZekarText": "He  said: ‘If anyone of you is impelled to praise his brother, then he should say: ‘I deem so-and-so to be…and Allah is his reckoner…and I don’t praise anyone, putting it (i.e. my praising) forward, in front of Allah’s commendation, however I assume him so and so’…if he knows that of him.’",
  "RepeatNumber": 1,
  "Tabweeb": "The etiquette of praising a fellow Muslim"
 },
 {
  "ZekarID": 238,
  "ZekarText": "Labbaykal-lahumma labbayk, labbayka la shareeka laka labbayk, innal-hamda wanniAAmata laka walmulk, la shareeka lak.\r\n‘Here I am O Allah, (in response to Your call), here I am. Here I am, You have no partner, here I am.  Verily all praise, grace and sovereignty belong to You. You have no partner.’",
  "RepeatNumber": 1,
  "Tabweeb": "The Talbiyah"
 },
 {
  "ZekarID": 239,
  "ZekarText": "‘The Prophet  circled the KaAAbah on a camel, every time he reached the black stone he would point to it with his staff and say:\r\n\r\nAllahu akbar\r\n‘Allah is the greatest’",
  "RepeatNumber": 1,
  "Tabweeb": "At the black stone"
 },
 {
  "ZekarID": 240,
  "ZekarText": "The Prophet  used to say between the Yemeni corner and the black stone:\r\n\r\n(Rabbana atina fee alddunya hasanatan wafee al-akhirati hasanatan waqina  AAathaba alnnar )\t[Al-Baqarah: 201]\r\n‘O our Lord, grant us the best in this life and the best in the next life, and protect us from the punishment of the Fire.’",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said between the Yemeni corner and the black stone (at the KaAAbah)"
 },
 {
  "ZekarID": 241,
  "ZekarText": "Jabir  said when describing the Prophet’s  pilgrimage: ‘…and when he approached mount Safa he recited:\r\n\r\n( Innas-safa wa-almarwata min shaAAa-iri Allah ….)\r\n\r\nAbda-o bima badaal-lahu bih.\r\n‘Indeed Safa and Marwah are from the places of worship of Allah…’\r\n‘I begin with what Allah began with.’\r\n…so he started with Safa and climed it until he could see the KaAAbah, he then faced it and said:\r\n\r\nAllahu akbar, Allahu akbar, Allahu akbar.\r\n‘Allah is the greatest, Allah is the greatest, Allah is the greatest.’\r\n…and then he would say the following three times making a supplication (one should make a personal supplication) after each time:\r\nLa ilaha illal-lahu wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer, la ilaha illal-lahu wahdah, anjaza waAAdah, wanasara AAabdah, wahazamal -ahzaba wahdah.\r\n‘None has the right to be worshipped except Allah, alone, without partner.To Him belongs all sovereignty and praise and He is over all things amnipotent. None has the right to be worshipped except Allah alone.  He fulfilled His promise, aided His Servant and single-handedly defeated the allies.’\r\n…he  would repeat this action at Marwah.",
  "RepeatNumber": 1,
  "Tabweeb": "Supplication said when at Mount Safa & Mount Marwah"
 },
 {
  "ZekarID": 242,
  "ZekarText": "‘The best of supplications is the supplication on the day of AAarafah and the best which I and the Prophets before me have said (is):\r\n\r\nLa ilaha illal-lahu wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer.\r\n‘None has the right to be worshipped except Allah, alone, without partner. To Him belongs all praise and sovereignty and He is over all things omnipotent.’",
  "RepeatNumber": 1,
  "Tabweeb": "The Day of AAarafah"
 },
 {
  "ZekarID": 243,
  "ZekarText": "Jabir  said: ‘He  rode Al-Qaswa until he reached Al-MashAAar Al-Haram, he then faced the qiblah, supplicated to Allah, and extoled His greatness and oneness.  He stood until the sun shone but left before it rose.’\r\nAl-Qaswa: The name of the Prophet’s  camel.",
  "RepeatNumber": 1,
  "Tabweeb": "At the Sacred Site (Al-MashAAar Al-Haram)"
 },
 {
  "ZekarID": 244,
  "ZekarText": "i.e. Stoning the three areas at Mina during Hajj.\r\n\t\r\nEvery time the Prophet  threw a pebble at any of the three jamarat, he would say:\r\n\r\nAllahu akbar.\r\n‘Allah is the greatest’\r\n…on completion of the first jamarah, he advanced a little, stood facing the qiblah, raised his hands and supplicated.  He also did this after the second jamarah but not the third.’",
  "RepeatNumber": 1,
  "Tabweeb": "When throwing each pebble at the Jamarat"
 },
 {
  "ZekarID": 245,
  "ZekarText": "Subhanal-lah!.\r\n‘How perfect Allah is.’",
  "RepeatNumber": 1,
  "Tabweeb": "What to say at times of amazement and delight"
 },
 {
  "ZekarID": 246,
  "ZekarText": "Allahu akbar.\r\n‘Allah is the greatest.’",
  "RepeatNumber": 1,
  "Tabweeb": "What to say at times of amazement and delight"
 },
 {
  "ZekarID": 247,
  "ZekarText": "The Prophet  would prostrate in gratitude to Allah تبارك و تعالى  upon receiving news which pleased him or which caused pleasure.",
  "RepeatNumber": 1,
  "Tabweeb": "What to do upon receiving pleasant news"
 },
 {
  "ZekarID": 248,
  "ZekarText": "‘Place your hand at the site of the pain and say:\r\n\r\nBismil-lah (three times)   \r\n‘In the name of Allah’\t   (three times)\r\n…the supplicate seven times:\r\n\r\naAAoothu billahi waqudratih min sharri ma ajidu wa-ohathir. (seven times).\r\n‘I take refuge in Allah and within His omnipotence from the evil that I feel and am wary of.’\t(seven times)",
  "RepeatNumber": 3,
  "Tabweeb": "What to say and do when feeling some pain in the body"
 },
 {
  "ZekarID": 249,
  "ZekarText": "The Evil Eye: To look at something and be impressed with it, causing harm to befall it. This “looking” may or may not involve jealousy, and can occur unintentionally, indeed be part of a person’s nature! A person can even inflict harm on himself.\r\nFrom the supplications for the protection against the Evil Eye:\r\n\r\nAllahumma barik AAalayh.\r\n‘O Allah, send blessing upon him.’\r\n\r\nMa shaal-lah, la quwwata illa billah.\r\n‘(this is) that which Allah has willed, there is no power except with Allah.’\r\n\r\n‘If you see something from your brother, yourself or wealth which you find impressing, then invoke blessings for it, for the evil eye is indeed true’.",
  "RepeatNumber": 1,
  "Tabweeb": "What to say when in fear of afflicting something or someone with one’s eye"
 },
 {
  "ZekarID": 250,
  "ZekarText": "La ilaha illal-lah.\r\n‘None has the right to be worshipped except Allah.’",
  "RepeatNumber": 1,
  "Tabweeb": "What to say when startled"
 },
 {
  "ZekarID": 251,
  "ZekarText": "Bismil-lah wallahu akbar, allahumma minka walak, allahumma taqabbal  minnee.\r\n‘In the name of Allah, and Allah is the greatest.  O Allah, (it is) from You and belongs to You, O Allah, accept this from me.’",
  "RepeatNumber": 1,
  "Tabweeb": "When slaughtering or offering a sacrifice"
 },
 {
  "ZekarID": 252,
  "ZekarText": "aAAoothu bikalimatil-lahit-tammat, allatee la yujawizuhunna barrun wala fajir min sharri ma khalaq, wabaraa watharaa, wamin sharri ma yanzilu minas-sama\/, wamin sharri ma yaAAruju feeha, wamin sharri ma tharaa fil-ard, wamin sharri ma yakhruju minha, wamin sharri fitnanil-layli wannahar, wamin sharri kulli tariqin illa tariqan yatruqu bikhayrin ya Rahman.\r\n‘I take refuge within Allah’s perfect words which no righteous or unrighteous person can transgress, from all the evil that He has created, made and originated.  (I take refuge) from the evil that descends from the sky and the evil that rises up to it.  (I take refuge) from the evil that is spread on Earth and the evil that springs from her, and I take refuge from the evil of the tribulations of night and day, and the evil of one who visits at night except the one who brings good, O Merciful One.’",
  "RepeatNumber": 1,
  "Tabweeb": "What is said to ward off the deception of the Obstinate Shaytans"
 },
 {
  "ZekarID": 253,
  "ZekarText": "‘The Messenger of Allah  said: ‘By Allah, I seek forgiveness and repent to Allah, more than seventy times a day.’",
  "RepeatNumber": 70,
  "Tabweeb": "Seeking forgiveness and repentance"
 },
 {
  "ZekarID": 254,
  "ZekarText": "He  also said: ‘O People, Repent! Verily I repent to Allah, a hundred times a day.’",
  "RepeatNumber": 100,
  "Tabweeb": "Seeking forgiveness and repentance"
 },
 {
  "ZekarID": 255,
  "ZekarText": "He  also said: ‘Whoever says:\r\n\r\nAstaghfirul-lahal-lathee la ilaha illa huwal-hayyul-qayyoomu wa-atoobu ilayh.\r\n‘I seek Allah’s forgiveness, besides whom, none has the right to be worshipped except He, The Ever Living, The Self-Subsisting and Supporter of all, and I turn to Him in repentance.’\r\n…Allah would forgive him even if he was one who fled during the advance of an army.’",
  "RepeatNumber": 1,
  "Tabweeb": "Seeking forgiveness and repentance"
 },
 {
  "ZekarID": 256,
  "ZekarText": "He  said: ‘The nearest the Lord comes to His servant is in the middle of the night, so if you are able to be of those who remember Allah at that time, then be so.’",
  "RepeatNumber": 1,
  "Tabweeb": "Seeking forgiveness and repentance"
 },
 {
  "ZekarID": 257,
  "ZekarText": "He  also said: ‘The nearest a servant is to his Lord is when he is prostrating, so supplicate much therein.’",
  "RepeatNumber": 1,
  "Tabweeb": "Seeking forgiveness and repentance"
 },
 {
  "ZekarID": 258,
  "ZekarText": "He  also said: ‘verily my heart becomes preoccupied, and verily I seek Allah’s forgiveness a hundred times a day.’\r\npreoccupied: i.e. in a state of ‘forgetfulness’. The Prophet  always used to increase in his remembrance of his Lord, in attaining a nearness to Allah and having consciousness of Allah to the extent that if this intensity lessened in anyway, he would regard it as a sin and would then race to seek forgiveness from Allah.",
  "RepeatNumber": 1,
  "Tabweeb": "Seeking forgiveness and repentance"
 },
 {
  "ZekarID": 259,
  "ZekarText": "‘Whoever says:\r\n\r\nSubhanal-lahi wabihamdih. (one hundred times daily)\r\n‘How perfect Allah is and I praise Him.’\r\n…a hundred times during the day, his sins are wiped away, even if they are like the foam of the sea.’",
  "RepeatNumber": 100,
  "Tabweeb": "Excellence of remembrance and glorification of Allah"
 },
 {
  "ZekarID": 260,
  "ZekarText": "Aboo Ayyoob Al-Ansaree  related that The Prophet  said: ‘Whoever says:\r\n\r\nLa ilaha illal-lahu wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer.\r\n‘None has the right to be worshipped except Allah, alone, without partener. To Him belongs all sovereignty and praise and He is over all things omnipotent.’\r\n…..ten times is like one who has freed four souls from among the children of IsmaAAeel.’",
  "RepeatNumber": 10,
  "Tabweeb": "Excellence of remembrance and glorification of Allah"
 },
 {
  "ZekarID": 261,
  "ZekarText": "Aboo Hurayrah  reported that the Messenger of Allah  said:’(There are) Two words, (which are ) light on the tongue, heavy on the Scale and beloved to The Most Gracious:\r\n\t\r\nSubhanal-lahi wabihamdih, wasubhanal-lahil-AAatheem.\r\n‘ How perfect Allah is and I praise Him. How perfect Allah is, The Supreme.’",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of remembrance and glorification of Allah"
 },
 {
  "ZekarID": 262,
  "ZekarText": "Aboo Hurayrah  reported that the Messenger of Allah  said: ‘Saying:\r\n\t\r\nSubhanal-lah, walhamdu lillah, la ilaha illal-lah wallahu akbar.\r\n‘ How perfect Allah is, and all praise is for Allah. None has the right to be worshipped except Allah, and Allah is the greatest.’\r\n….. is more beloved to me than everything the sun has risen over.’",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of remembrance and glorification of Allah"
 },
 {
  "ZekarID": 263,
  "ZekarText": "Sa’d  said: ‘We were sitting with the Messenger of Allah , and he said: ‘Are any of you unable to gain a thousand good deeds each day?’ Somebody then asked him  : How does one achieve a thousand good deeds? He replied: ‘He should say:\r\n\r\nSubhanal-lah.\r\n‘How perfect Allah is.’\r\n….one hundred times, for a thousand good deeds are recorded for him or a thousand bad deeds are wiped away.’",
  "RepeatNumber": 100,
  "Tabweeb": "Excellence of remembrance and glorification of Allah"
 },
 {
  "ZekarID": 264,
  "ZekarText": "Jabbir  related that the Prophet  said: ‘Whoever says:\r\n\t\r\nSubhanal-lahil-AAatheemi wabihamdih.\r\n‘ How perfect Allah is . The Supreme, and I praise Him.’\r\n…..a palm tree is planted for him in paradise.’",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of remembrance and glorification of Allah"
 },
 {
  "ZekarID": 265,
  "ZekarText": "‘AAabdullah Ibn Qays  related that the Prophet  said to him: ‘ O ‘AAabdullah Ibn Qays, shall I not inform you of a treasure from the treasures of paradise?’ He  then said: ‘Say:\r\n\t\r\nLa  hawla wala quwwata illa billah.\r\n‘There is no might nor power except with Allah.’",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of remembrance and glorification of Allah"
 },
 {
  "ZekarID": 266,
  "ZekarText": "‘ the most beloved words to Allah are four:\r\n\t\r\nSubhanal-lah, walhamdu lillah, wala ilaha illal-lah, wallahu akbar.\r\n‘ How perfect Allah is, all praise is for Allah. None has the right to be worshipped except Allah and Allah is the greatest.’\r\n….it does not matter which of them you start with.’",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of remembrance and glorification of Allah"
 },
 {
  "ZekarID": 267,
  "ZekarText": "SaAAd Ibn Abee Waqqas  narrated that a man came to the Messenger of Allah  and said to him: ‘Teach me something which I should say?’ He said: ‘Say: \r\nLa ilaha illal-lah, wahdahu la shareeka lah, Allahu akbaru kabeera, walhamdu lillahi katheera, subhanal-lahi rabbil-AAalameen, la hawla wala quwwata illa billahil-AAazeezil-hakeem.\r\n‘None has the right to be worshipped except Allah, alone without partener. Allah is most great and much praise is for Allah. How perfect Allah is, Lord of the worlds. There is no might nor power except with Allah, The Exalted in might, The Wise.’\r\n…the man then said: ‘These are for my Lord, and what is for me?’ He  replied: \r\n‘Say:\r\n\r\nAllahummagh-fir lee, warhamnee, wahdinee, warzuqnee.\r\n‘O Allah, forgive me, have mercy upon me, guide me and grant me sustenance.’",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of remembrance and glorification of Allah"
 },
 {
  "ZekarID": 268,
  "ZekarText": "Tariq Al-AshjaAAee  said: ‘When someone would embrace Islam, the Prophet  would teach him how to perform prayer and then order him to supplicate with the following words:\r\n\r\nAllahummagh-fir lee, warhamnee, wahdinee, waAAafinee warzuqnee.\r\n‘O Allah, forgive me, have mercy upon me, guide me, give me health and grant me sustenance.’",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of remembrance and glorification of Allah"
 },
 {
  "ZekarID": 269,
  "ZekarText": "Jabir  Ibn ‘AAabdullah  related that the Messenger of Allah  said: ‘Verily, the best supplication is:\r\n\r\nAlhamdu lillah\r\n‘All praise is for Allah.’\r\n…and indeed, the best form of remembrance is:\r\n\r\n  La ilaha illal-lah.\r\n‘None has the right to be worshipped except Allah.’",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of remembrance and glorification of Allah"
 },
 {
  "ZekarID": 270,
  "ZekarText": "Subhanal-lah, walhamdu lillah, la ilaha illal-lah, wallahu akbar, wala hawla wala quwwata illa billah.\r\n‘How perfect Allah is, and all praise is for Allah. None has the right to be worshipped except Allah, and Allah is the greatest. There is no might nor power except with Allah.’",
  "RepeatNumber": 1,
  "Tabweeb": "Excellence of remembrance and glorification of Allah"
 },
 {
  "ZekarID": 271,
  "ZekarText": "Tasbeeh, it means here, to say:\r\nSubhanal-lah, alhamdu lillah, Allahu akbar.\r\n\r\n‘AAabdullah Ibn AAamr  said: ’I saw the prophet  make tasbeeh with his right hand.’",
  "RepeatNumber": 1,
  "Tabweeb": "How the prophet  made tasbeeh"
 },
 {
  "ZekarID": 272,
  "ZekarText": "‘When night falls (i.e. Al-Maghrib), restrain your children (from going out) because at such time the devils spread about.  After a period of time has passed, let them be.  Shut your doors and mention Allah’s name, for verily the devil does not open a shut door, tie up your water-skins and mention Allah’s name, cover your vessels with anything and mention Allah’s name and put out your lamps.’",
  "RepeatNumber": 1,
  "Tabweeb": "Etiquette of retiring for the night"
 },
 {
  "ZekarID": 273,
  "ZekarText": "Allahumma salli AAala Muhammad wa-AAala azwajihi wathurriyyatihi kama sallayta AAala ali Ibraheem, wabarik AAala Muhammad, wa-AAala azwajihi wathurriyyatih, kama barakta AAala ali Ibraheem. innaka Hameedun Majeed.\r\n‘O Allah, send prayers upon Muhammad and upon the wives and descendants of Muhammad, just as You sent prayers upon the family of Ibraheem, and send blessings upon Muhammad and upon the wives and descendants of Muhammad, just as You sent blessings upon the family of Ibraheem. Verily, You are full of praise and majesty.’",
  "RepeatNumber": 1,
  "Tabweeb": "Prayers upon the Prophet  after the tashahhud"
 },
 {
  "ZekarID": 274,
  "ZekarText": "aAAoothu billahil-AAatheem wabiwajhihil-kareem wasultanihil-qadeem minash-shaytanir-rajeem, [bismil-lah, wassalatu] [wassalamu AAala rasoolil-lah] , allahumma iftah lee abwaba rahmatik.\r\n‘I take refuge with Allah, The Supreme and with His Noble Face, and His eternal authority from the accursed devil. In the name of Allah, and prayers and peace be upon the Messenger of Allah.  O Allah, open the gates of Your mercy for me.’",
  "RepeatNumber": 1,
  "Tabweeb": "Upon entering the mosque"
 }
],
"categories":[
 {
  "CategoryID": 1,
  "Category": "When waking up"
 },
 {
  "CategoryID": 2,
  "Category": "Supplication when wearing a garment"
 },
 {
  "CategoryID": 3,
  "Category": "Supplication said when wearing a new garment"
 },
 {
  "CategoryID": 4,
  "Category": "Supplication said to someone wearing a new garment"
 },
 {
  "CategoryID": 5,
  "Category": "Before undressing"
 },
 {
  "CategoryID": 6,
  "Category": "Before entering the toilet"
 },
 {
  "CategoryID": 7,
  "Category": "After leaving the toilet"
 },
 {
  "CategoryID": 8,
  "Category": "When starting ablution"
 },
 {
  "CategoryID": 9,
  "Category": "Upon completing the ablution"
 },
 {
  "CategoryID": 10,
  "Category": "When leaving the home"
 },
 {
  "CategoryID": 11,
  "Category": "Upon entering the home"
 },
 {
  "CategoryID": 12,
  "Category": "Supplication when going to the mosque"
 },
 {
  "CategoryID": 13,
  "Category": "Upon entering the mosque"
 },
 {
  "CategoryID": 14,
  "Category": "Upon leaving the mosque"
 },
 {
  "CategoryID": 15,
  "Category": "Supplications related to the athan (the call to prayer)"
 },
 {
  "CategoryID": 16,
  "Category": "Supplication at the start of the prayer (after takbeer)"
 },
 {
  "CategoryID": 17,
  "Category": "While bowing in prayer (rukooAA)"
 },
 {
  "CategoryID": 18,
  "Category": "Upon rising from the bowing posision"
 },
 {
  "CategoryID": 19,
  "Category": "Supplication whilst prostrating (sujood)"
 },
 {
  "CategoryID": 20,
  "Category": "Supplication between the two prostrations"
 },
 {
  "CategoryID": 21,
  "Category": "Supplication when prostrating due to recitation of the Quran"
 },
 {
  "CategoryID": 22,
  "Category": "The Tashahhud"
 },
 {
  "CategoryID": 23,
  "Category": "Prayers upon the Prophet  after the tashahhud"
 },
 {
  "CategoryID": 24,
  "Category": "Supplication said after the last tashahhud and before salam"
 },
 {
  "CategoryID": 25,
  "Category": "Remembrance after salam"
 },
 {
  "CategoryID": 26,
  "Category": "Supplication for seeking guidance in forming a decision or choosing the proper course…etc (Al-Istikharah)"
 },
 {
  "CategoryID": 27,
  "Category": "Remembrance said in the morning and evening"
 },
 {
  "CategoryID": 28,
  "Category": "Remembrance before sleeping"
 },
 {
  "CategoryID": 29,
  "Category": "Supplication when turning over during the night"
 },
 {
  "CategoryID": 30,
  "Category": "Upon experiencing unrest, fear, apprehensiveness and the like during sleep"
 },
 {
  "CategoryID": 31,
  "Category": "Upon seeing a good dream or a bad dream"
 },
 {
  "CategoryID": 32,
  "Category": "Qunoot Al-Witr"
 },
 {
  "CategoryID": 33,
  "Category": "Remembrance immediately after salam of the witr prayer"
 },
 {
  "CategoryID": 34,
  "Category": "Supplication for anxiety and sorrow"
 },
 {
  "CategoryID": 35,
  "Category": "Supplication for one in distress"
 },
 {
  "CategoryID": 36,
  "Category": "Upon encountering an enemy or those of authority"
 },
 {
  "CategoryID": 38,
  "Category": "Supplication made against an enemy"
 },
 {
  "CategoryID": 39,
  "Category": "What to say when in fear of a people"
 },
 {
  "CategoryID": 40,
  "Category": "Supplication for one afflicted with doubt in his faith"
 },
 {
  "CategoryID": 41,
  "Category": "Settling a debt"
 },
 {
  "CategoryID": 42,
  "Category": "Supplication for one afflicated by whisperings in prayer or recitation"
 },
 {
  "CategoryID": 43,
  "Category": "Supplication for one whose affairs have become difficult"
 },
 {
  "CategoryID": 44,
  "Category": "Upon committing a sin"
 },
 {
  "CategoryID": 45,
  "Category": "Supplication for expelling the devil and his whisperings"
 },
 {
  "CategoryID": 46,
  "Category": "Supplication when stricken with a mishap or overtaken by an affair"
 },
 {
  "CategoryID": 49,
  "Category": "Placing childen under Allah’s protection"
 },
 {
  "CategoryID": 50,
  "Category": "When visiting the sick"
 },
 {
  "CategoryID": 51,
  "Category": "Excellence of visiting the sick"
 },
 {
  "CategoryID": 52,
  "Category": "Supplication of the sick who have renounced all hope of life"
 },
 {
  "CategoryID": 53,
  "Category": "Instruction for the one nearing death"
 },
 {
  "CategoryID": 54,
  "Category": "Supplication for one afflicted by a calamity"
 },
 {
  "CategoryID": 55,
  "Category": "When closing the eyes of the deceased"
 },
 {
  "CategoryID": 56,
  "Category": "Supplication for the deceased at the funeral prayer"
 },
 {
  "CategoryID": 57,
  "Category": "Supplication for the advancement of reward during the   funeral prayer"
 },
 {
  "CategoryID": 58,
  "Category": "Condolence"
 },
 {
  "CategoryID": 59,
  "Category": "Placing the deceased in the grave"
 },
 {
  "CategoryID": 60,
  "Category": "After burying the deceased"
 },
 {
  "CategoryID": 61,
  "Category": "Visiting the graves"
 },
 {
  "CategoryID": 62,
  "Category": "Prayer said during a wind storm"
 },
 {
  "CategoryID": 63,
  "Category": "Supplication upon hearing thunder"
 },
 {
  "CategoryID": 64,
  "Category": "Supplication for rain"
 },
 {
  "CategoryID": 65,
  "Category": "Supplication said when it rains"
 },
 {
  "CategoryID": 66,
  "Category": "After rainfall"
 },
 {
  "CategoryID": 67,
  "Category": "Asking for clear skies"
 },
 {
  "CategoryID": 68,
  "Category": "Upon sighting the crescent moon"
 },
 {
  "CategoryID": 69,
  "Category": "Upon breaking fast"
 },
 {
  "CategoryID": 70,
  "Category": "Supplication before eating"
 },
 {
  "CategoryID": 71,
  "Category": "Upon completing the meal"
 },
 {
  "CategoryID": 72,
  "Category": "Supplication of the guest for the host"
 },
 {
  "CategoryID": 73,
  "Category": "Supplication said to one offering a drink or to one who intended to do that"
 },
 {
  "CategoryID": 74,
  "Category": "Supplication said when breaking fast in someone’s home"
 },
 {
  "CategoryID": 75,
  "Category": "Supplication said by one fasting when presented with food and does not break his fast"
 },
 {
  "CategoryID": 76,
  "Category": "When insulted while fasting"
 },
 {
  "CategoryID": 77,
  "Category": "Supplication said upon seeing the early or premature fruit"
 },
 {
  "CategoryID": 78,
  "Category": "Supplication said upon sneezing"
 },
 {
  "CategoryID": 79,
  "Category": "What is said to a Kafir when he sneezes"
 },
 {
  "CategoryID": 80,
  "Category": "Supplication said to the newlywed"
 },
 {
  "CategoryID": 81,
  "Category": "The groom’s supplication on the wedding night or when buying an animal"
 },
 {
  "CategoryID": 82,
  "Category": "Supplication before sexual intercourse"
 },
 {
  "CategoryID": 83,
  "Category": "When angry"
 },
 {
  "CategoryID": 84,
  "Category": "Supplication said upon seeing someone in trial or tribulation"
 },
 {
  "CategoryID": 85,
  "Category": "Remembrance said at a sitting or gathering…etc"
 },
 {
  "CategoryID": 86,
  "Category": "Supplication for the expiation of sins said at the conclusion of a sitting or gathering…etc"
 },
 {
  "CategoryID": 87,
  "Category": "Returning a supplication of forgiveness"
 },
 {
  "CategoryID": 88,
  "Category": "Supplication said to one who does you a favour"
 },
 {
  "CategoryID": 89,
  "Category": "Protection from the Dajjal"
 },
 {
  "CategoryID": 90,
  "Category": "Supplication said to one who pronounces his love for you, for Allah’s sake"
 },
 {
  "CategoryID": 91,
  "Category": "Supplication said to one who has offered you some of his wealth"
 },
 {
  "CategoryID": 92,
  "Category": "Supplication said to the debtor when his debt is settled"
 },
 {
  "CategoryID": 93,
  "Category": "Supplication for fear of shirk"
 },
 {
  "CategoryID": 94,
  "Category": "Returning a supplication after having bestowed a gift or charity upon someone"
 },
 {
  "CategoryID": 95,
  "Category": "Forbiddance of ascribing things to omens"
 },
 {
  "CategoryID": 96,
  "Category": "Supplication said when mounting an animal or any means of transport"
 },
 {
  "CategoryID": 97,
  "Category": "Supplication for travel"
 },
 {
  "CategoryID": 98,
  "Category": "Supplication upon entering a town or village…etc"
 },
 {
  "CategoryID": 99,
  "Category": "When entering the market"
 },
 {
  "CategoryID": 100,
  "Category": "Supplication for when the mounted animal (or mean of transport) stumbles"
 },
 {
  "CategoryID": 101,
  "Category": "Supplication of the traveller for the resident"
 },
 {
  "CategoryID": 102,
  "Category": "Supplication of the resident for the traveller"
 },
 {
  "CategoryID": 103,
  "Category": "Remembrance while ascending or descending"
 },
 {
  "CategoryID": 104,
  "Category": "Prayer of the traveller as dawn approaches"
 },
 {
  "CategoryID": 105,
  "Category": "Stopping or lodging somewhere"
 },
 {
  "CategoryID": 106,
  "Category": "While returning from travel"
 },
 {
  "CategoryID": 107,
  "Category": "What to say upon receiving pleasing or displeasing news"
 },
 {
  "CategoryID": 108,
  "Category": "Excellence of sending prayers upon the Prophet "
 },
 {
  "CategoryID": 109,
  "Category": "Excellence of spreading the Islamic greeting"
 },
 {
  "CategoryID": 110,
  "Category": "Returning a greeting to a Kafir"
 },
 {
  "CategoryID": 111,
  "Category": "Supplication said upon hearing a rooster crow or the braying of an ass"
 },
 {
  "CategoryID": 112,
  "Category": "Supplication upon hearing the barking of dogs at night"
 },
 {
  "CategoryID": 113,
  "Category": "Supplication said for one you have insulted"
 },
 {
  "CategoryID": 114,
  "Category": "The etiquette of praising a fellow Muslim"
 },
 {
  "CategoryID": 116,
  "Category": "The Talbiyah"
 },
 {
  "CategoryID": 117,
  "Category": "At the black stone"
 },
 {
  "CategoryID": 118,
  "Category": "Supplication said between the Yemeni corner and the black stone (at the KaAAbah)"
 },
 {
  "CategoryID": 119,
  "Category": "Supplication said when at Mount Safa & Mount Marwah"
 },
 {
  "CategoryID": 120,
  "Category": "The Day of AAarafah"
 },
 {
  "CategoryID": 121,
  "Category": "At the Sacred Site (Al-MashAAar Al-Haram)"
 },
 {
  "CategoryID": 122,
  "Category": "When throwing each pebble at the Jamarat"
 },
 {
  "CategoryID": 123,
  "Category": "What to say at times of amazement and delight"
 },
 {
  "CategoryID": 124,
  "Category": "What to do upon receiving pleasant news"
 },
 {
  "CategoryID": 125,
  "Category": "What to say and do when feeling some pain in the body"
 },
 {
  "CategoryID": 126,
  "Category": "What to say when in fear of afflicting something or someone with one’s eye"
 },
 {
  "CategoryID": 127,
  "Category": "What to say when startled"
 },
 {
  "CategoryID": 128,
  "Category": "When slaughtering or offering a sacrifice"
 },
 {
  "CategoryID": 130,
  "Category": "What is said to ward off the deception of the Obstinate Shaytans"
 },
 {
  "CategoryID": 131,
  "Category": "Seeking forgiveness and repentance"
 },
 {
  "CategoryID": 132,
  "Category": "Excellence of remembrance and glorification of Allah"
 },
 {
  "CategoryID": 133,
  "Category": "How the prophet  made tasbeeh"
 },
 {
  "CategoryID": 134,
  "Category": "Etiquette of retiring for the night"
 }
]
}