{
"azkar":[
 {
  "ZekarID": 1,
  "ZekarText": "Aljamdulillah alladhíí ajiaanaa ba'ada maa amáatana wa ileihin-nushur.\r\n1- Alabado sea Allah, quien me ha devuelto la vida, luego de haberme dado la muerte y a El será el retorno.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al despertar"
 },
 {
  "ZekarID": 2,
  "ZekarText": "Aljamdulillahi alladhíí 'aafaanii fii yásadii wa radda 'aleia\r\nrujii wa ádhana lii bi dhíkrihi.\r\n\r\n3-  Alabado sea Allah que me devolvió la salud al cuerpo,\r\nme ha devuelto mi espíritu y me ha permitido recordarle. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al despertar"
 },
 {
  "ZekarID": 3,
  "ZekarText": "Laa ilaha illa Allah wajdahu laa shariika lahu. Lahul Mulku wa lahul Jamd, wa hua 'alaa kulli shei.ín qadir. Subjaana Al- lahi, wal jamdullillahi, wa laa ilaha illa Allah wa Allahu Akbar wa laa Jaula wa laa Quuwata illaa bíllahi al'aliiul 'ADhim.\r\n\r\n2- Dijo el Mensajero de Allah (la paz y las bendiciones de Allah se-\r\nan con él):  Quien al despertarse diga: No hay divinidad ex-\r\ncepto Allah único sin asociados. Suyo es el reino y la\r\nalabanza. Él es el Omnipotente. Glorificado sea Allah, la\r\nAlabanza es para Allah, No hay divinidad excepto Allah.\r\nAllah es más Grande. No hay fuerza ni poder salvo en Allah.\r\nEl Altísimo el Grandioso. Luego si ruega: Rabbi agfir lii iPer-\r\ndóname! Será perdonado.  Relató Walid: y dijo: ruega que\r\nserá escuchado. Y si se levanta y realiza la ablución, luego\r\nuna oración, ésta será aceptada. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al despertar"
 },
 {
  "ZekarID": 4,
  "ZekarText": "Dice Allah, exaltado sea:\r\n\r\n En la creación de los cielos de la tierra y en la sucesión de\r\nla noche y el día hay signos para los dotados de intelecto,\r\nque recuerdan a Dios de pie, sentados o recostados, que\r\nmeditan en la creación de los cielos de la tierra:  iSeñor!\r\nNo has creado todo esto en vano. iGloria a Ti! Presérvanos\r\ndel castigo del Fuego.  [3:190 - 193]",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al despertar"
 },
 {
  "ZekarID": 5,
  "ZekarText": "Aljamdulillahi alladhíí kasaanii haadhaa (az-zaub) wa raz-\r\nhaqaniihi min gairi Jaulin minnii wa laa qúwwata.\r\n\r\n5-  Alabado sea Allah, quien me ha provisto esta vestimen-\r\nta y me ha concedido todo sin esfuerzo ni poder de mi par- te.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al vestir"
 },
 {
  "ZekarID": 6,
  "ZekarText": "Allahumma lakal jamdu Anta kasautaniihi as.áluka min\r\nJairihi wa Jairi maa Suni'a lahu, wa a'udhu bika min sherrihi\r\nwa sherri maa Suni'a lahu.\r\n\r\n6-  iOh Allah! Para Ti es la alabanza, Tú me has vestido es-\r\nto. Te pido su bien y lo bueno para lo que fue hecha y me\r\nrefugio en Ti de su mal y del mal para lo que fuera hecha. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al estrenar una ropa"
 },
 {
  "ZekarID": 7,
  "ZekarText": "Ilbas yadidan wa 'ish jamidan wa mut shahidan.\r\n7-  Viste ropa nueva, vive agradecido y muere mártir. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para quien estrena una ropa"
 },
 {
  "ZekarID": 8,
  "ZekarText": "Tublii wa iuJliful-lahu ta'alaa.\r\n\r\n8-  Que la utilices y que Allah te la reemplace con otra. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para quien estrena una ropa"
 },
 {
  "ZekarID": 9,
  "ZekarText": "Bismillah\r\n9-  En el nombre de Allah. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al desvestirse"
 },
 {
  "ZekarID": 10,
  "ZekarText": "[Bismillah] Allahumma innii 'audhu bika min al Jubzi wal\r\nJabaa.iz.\r\n\r\n10-  Oh Allah! Ciertamente me refugio en Ti del demonio y\r\nsus secuaces. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica antes de entrar al baño"
 },
 {
  "ZekarID": 11,
  "ZekarText": "Gufránaka.\r\n\r\n11-  Te pido perdón. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al salir del baño"
 },
 {
  "ZekarID": 12,
  "ZekarText": "Bismillah.\r\n\r\n12-  En el nombre de Allah. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al iniciar la ablución"
 },
 {
  "ZekarID": 13,
  "ZekarText": "Ashhadu an laa ilaha illa Allah wajdahu laa shariika lahu\r\nwa áshhadu anna Muhámmadan 'abduhu wa rasuuluhu.\r\n\r\n13-  Atestiguo que no hay dios salvo Allah único sin asocia-\r\ndo y atestíguo que Muhámmad es su siervo y mensajero. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al terminar la ablución"
 },
 {
  "ZekarID": 14,
  "ZekarText": "Allahumma aay'alnii min attawuaabín wa ay'alnii min al\r\nmutaTahhiriin.\r\n\r\n14-  Oh Allah, hazme de los que retornan arrepentídos a Ti\r\ny de aquellos que se purifican. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al terminar la ablución"
 },
 {
  "ZekarID": 16,
  "ZekarText": "Allahumma innii 'audhu bika an aDil-la, au uDal-li, au\r\nazhilla, au uzhalla, au aDhlima, au uDhlama, au ayhala, au\r\niuyhala 'aleiia.\r\n\r\n16-  iOh Allah! Me refugio en Ti de desviarme o ser desvia-\r\ndo, de equivocarme o de que me precipite en el error, de\r\noprimir y ser oprimido, de ser ignorante o que sean igno-\r\nrantes conmigo! ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al salir de la casa"
 },
 {
  "ZekarID": 17,
  "ZekarText": "Bismillahi tauakaltu 'alaa Allah wa laa jaula wa laa quu-\r\nwata illa bíl-lah.\r\n\r\n17-  En el nombre de Allah, me encomiendo en Allah, no\r\nhay fuerza ni poder salvo en Allah. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al salir de la casa"
 },
 {
  "ZekarID": 18,
  "ZekarText": "Bismillahi wa laynaa, wa bismillahi Jaraynaa, wa 'alaa\r\nRábbinaa tawuakalnaa.\r\n\r\n18-  En el nombre de Allah regresamos y en nombre de\r\nAllah salimos y nos encomendamos a nuestro Señor. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al regresar a casa"
 },
 {
  "ZekarID": 19,
  "ZekarText": "Allahumma ay'al fii qalbii nuuran, wa fii lisaanii nuuran,\r\nwa ay'al fii sam'ii nuuran, wa ay'al fii báSarii nuuran wa ay'al\r\nmin Jalfii nuuran, wa min amaamii nuuran, wa ay'al min\r\nfauqii nuuran, wa min tajtii nuuran. Allahumma a'aTinii\r\nnuuran.\r\n19-  iOh Allah! Pon luz en mi corazón, luz en mis palabras,\r\nen mis oídos, pon luz en mis ojos, y detrás de mí, y delante\r\nde mí, encima y por debajo de mí. iOh Allah! Dame luz. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al dirigirse a la Mezquita"
 },
 {
  "ZekarID": 21,
  "ZekarText": "Bismillahi wa aSSalaatu wa assalaamu 'alaa rasuulillahi,\r\nAllahumma innii as.áluka min fáDlika, Allahumma a'aSím.nii\r\nmin ashsheiTaan irrayiim.\r\n\r\n21-  En el nombre de Allah y la Paz y las Bendiciones de\r\nAllah sean con el Mensajero de Allah, iOh mi Señor! Cier-\r\ntamente te pido Tu favor, iOh Señor! Protégeme de Sheitán\r\nel maldito. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al salir de la Mezquita"
 },
 {
  "ZekarID": 22,
  "ZekarText": "Se repite (en voz baja) lo que dice el muecín, salvo\r\ncuando dice:\r\n\r\n Haiia 'alaa aSSalat, haiia 'alaal falaji.  que signiﬁca -venid a\r\nla Oración, venid a la felicidad- decimos:\r\n\r\n La jaula wa la qúwwata illa bil-lah.  que significa -No hay\r\nfuerza ni poder salvo en Allah-.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica durante el llamado a la oración"
 },
 {
  "ZekarID": 23,
  "ZekarText": "Decimos: Wa ana áshhadu an laa ilaha illa Allah wáj-\r\ndahu laa shariika lahu wa anna Muhámmadan 'abduhu wa\r\nrasuluhu, raDiitu bil-lahi Rabban, wa bi Muhámmadin ra-\r\nsuulan, wa bil Islaama diinan... y atestiguo que no hay dios\r\nsalvo Allah, único, sin asociados con él, y que Muhámmad\r\nes su siervo y su mensajero, me complazco de Allah como\r\nSeñor, y Muhámmad como mensajero y el Islam como reli-\r\ngión .  Di esto luego de las atestiguaciones de Fe del Mue-\r\ncín ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica durante el llamado a la oración"
 },
 {
  "ZekarID": 24,
  "ZekarText": "Pedir bendiciones sobre el Profeta (la paz y las bendiciones\r\nde Allah sean con él) luego de responder al llamado del mue-\r\ncln.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica durante el llamado a la oración"
 },
 {
  "ZekarID": 25,
  "ZekarText": "Allahumma Rabba haadhihi dá'wuati taammati wa aSSa-\r\niaatil qaa.ímati, aati Muhámmadan al-uasiilata wal faDíílata\r\nwa ab'azhu maqaaman majmuudan alladhíí ua'ád.tahu, ín-\r\nnaka laa tuJliful mii'aadi.\r\n\r\n25- Decimos:  iOh Allah! Señor de este llamado perfecto, y\r\n de esta oración establecida, concede a Muhámmad, al-\r\nUasila (una estación del Paraíso) ual-Fadila (rango por en-\r\ncima del resto de la Creación), y concédenos su intercesión\r\nque le has prometido, Tu no faltas jamás a tu promesa. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica durante el llamado a la oración"
 },
 {
  "ZekarID": 26,
  "ZekarText": " Luego suplica y pide por ti, durante el tiempo entre el\r\nAdhán y el Iqamah, ya que en ese lapso ningún dua' es re-\r\nChazado. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica durante el llamado a la oración"
 },
 {
  "ZekarID": 27,
  "ZekarText": "Luego del Takbir se dice:\r\n\r\nAllahumma baa'id bainii wa baina JaTaaiaaia kama baa'adta\r\nbainal máshriqi wal mágribi Allahumma naqqinii min Ja-\r\nTaaiaaia kama iunqqaa azzaubu al-abiaDu min addánasi, Al-\r\nlahumma agsilnii min JaTaaiaaia bi zzalyi wal máá.i wal\r\nbardi.\r\n\r\n27- Después del Takbir, se dice:  iOh Dios Mío! Aleja los\r\npecados de mí, tanto como has distanciado el Este del Oes-\r\nte. iOh Allah! Purifícame de mis pecados como se purifica el\r\nvestido blanco de la suciedad. iOh Señor! iLímpiame de mis\r\npecados con nieve agua y granizo! ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al comenzar la oración"
 },
 {
  "ZekarID": 28,
  "ZekarText": "Subjáánaka Allahumma wa bi jámdika wa tabaaraka\r\násmuka wa ta'aalaa yádduka wa laa ilaha gairuka.\r\n\r\n28-  Glorificado Seas Mi Señor, alabado y bendito sea Tu\r\nnombre, elevada sea Tu Majestad. No hay divinidad excep-\r\nto Tú. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al comenzar la oración"
 },
 {
  "ZekarID": 29,
  "ZekarText": "Uayyahtu uayhii lilladhíí fáTara assamauaati wal arDa\r\njaniifan wa maa ana minal mushrikiina, inna Salaatii, wa nu-\r\nsukii, wa majiaaia, wa mamaati lillahi Rabbil 'áálamiina, laa\r\nshariika lahu wa bi dháálika umirtu wa ana minal muslimi-\r\nina. Allahumma Anta al-Maliku laa ilaha illa Anta. Anta Rab-\r\nbii wa ana 'ábduka, Dhalamtu nafsii wa a'ataraftu bidhanbii\r\nfaágfir lii dhunuubii yamii'aan ínnahu laa iagfíru dhdhunuu-\r\nba illa Anta. Wahdinii liajsanil aJlaaqi laa iahdii liajsanihaa\r\nilla Anta, waSrif 'annii seii.aha, laa iaSrifu 'annii seii.aha illa\r\n\r\nAnta, labbaika wa sa'adaika, al Jairu kúlluhu bi iádiika, wa\r\nshsharru leisa ileika. Ana bika wa ileika tabaarakta wa ta'aa-\r\nleita astagfíruka wa atuubu ileika.\r\n\r\n29-  He orientado mi rostro sinceramente hacia Aquel que\r\nha creado los cielos y la tierra, monoteista y no soy de los\r\nasociadores. Ciertamente mi oración, mi sacrificio, mi vida y\r\nmi muerte le pertenecen a Allah, Señor de los mundos, sin\r\nasociados, y por eso me ha sido ordenado y soy de los mu-\r\nsulmanes. iOh Allah! Tú eres el Soberano, no existe dios ex-\r\ncepto Tú. Tú eres mi Señor y yo soy tu siervo. He sido\r\ninjusto con mi alma, reconozco mis pecados, perdona todas\r\nmis culpas, y mis faltas porque nadie perdona los pecados\r\nsino Tú. Guíame hacia los mejores modales, no guía a ellos\r\nsino Tú. Aleja de mí las malas obras, no las aleja sino Tú,\r\naquí estoy (en respuesta a tu llamado), feliz (de servirte) y\r\ntodo el bien está en tus manos. Y el mal no proviene de Ti.\r\nYo existo por tu voluntad divina y a Ti retornaré. Bendito y\r\nexaltado Seas, te pido perdón y a Ti vuelvo arrepentido. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al comenzar la oración"
 },
 {
  "ZekarID": 30,
  "ZekarText": "Allahumma Rabba Yibraa.iil, wa Mikaa.iil, wa Israafiil,\r\nfááTira assamauaati ual arDa, 'aalima al gaibi wa ashsha-\r\nháádati Anta tájkumu baina 'ibaadika fiimaa kaanuu fiihi ia-\r\nJtalifuuna. Ihdinii limaa uJtúlifa fiihi min al jaqqi bíí.dhnika\r\nínnaka tahdii man tashaa.u ilaa SiraaT in mustaqiimin.\r\n\r\n30-  Oh Allah Señor de Yibril (el arcángel Gabriel), de Mikail\r\n(el arcángel Miguel), Israfil (el arcángel Rafael). Originador\r\nde los cielos y de la tierra, conocedor de lo oculto y de lo\r\nmanifiesto. Tú decides entre tus siervos sobre lo que solían\r\ntener diferencias. Guíame hacia la verdad con tu benepláci-\r\nto. Ciertamente Tú guias a quien quieres por el sendero\r\nrecto. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al comenzar la oración"
 },
 {
  "ZekarID": 31,
  "ZekarText": "Allahu ákbaru kabiiran (3 veces), wa aljamdulil-lahi kazii-\r\nran (3 veces), wa subjaana Allahi bukratan wa asiilaan (3\r\nveces). A'uudhu billahí min ashsheiTaani min náfJihi wa\r\nnáfzihi wa hámzhihi.\r\n\r\n31-  Allah es grande (3 veces), todas las alabanzas son para\r\nAllah (3 veces), glorificado sea por la mañana y por la tarde\r\n(3 veces). Me refugio en Allah del demonio, de su orgullo,\r\nde su poesía y de su insensatés. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al comenzar la oración"
 },
 {
  "ZekarID": 32,
  "ZekarText": "El Profeta (la paz y las bendiciones de Allah sean con él) solía de-\r\n\r\ncir al levantarse para orar durante la noche: Allahumma la-\r\nka al jamdu, Anta nuuru ssamaauaati wal arDi wa man fii\r\nhinna, wa lakal jamdu Anta qaíímu ssamaauaati wal arDi,\r\nwa man fii hinna, [wa lakal jamdu Anta Rabbu ssamaauaati\r\nwal arDi wa man fii hinna] [wa lakal jamdu laka mulku ssa-\r\nmaauaati wal arDi wa man fii hinna] [wa lakal jamdu Anta\r\nmáliku ssamaauaati wal arDi] [wa lakal jamdu] Antal jaqqu,\r\nwa ua'dukal jaqq, wal yannatu jaqqun, wan naaru jaqqun\r\nwan nabiiuna jaqqun, wa Muhámmadun jaqqun, was\r\nsaa'atu jaqqun] [Allahumma laka aslamtu, wa 'aleika taua-\r\nkaltu, wa bika áamantu, wa ileika anabtu wa bika JaSamtu\r\nwa ileika jáakamtu. Fáagfír lii maa qaddamtu, wa maa aJar-\r\ntu, wa maa asrartu, wa maa 'alantu] [Antal Muqáddimu, wa\r\nAntal mu.aJJiru, laa ilaha illa Anta] [Anta ilahii laa ilaha illa\r\nAnta.]\r\n\r\n32- Solía el Profeta (la paz y las bendiciones de Allah sean con él)\r\n\r\ndecir al levantarse para orar durante la noche:  iOh Señor!\r\nPara Ti es la alabanza, Tú eres la Luz de los cielos, de la tie-\r\nrra y de lo que en ellos existe. Tuya es la alabanza. Tú eres\r\nel Sustentador de los cielos y de la tierra y lo que en ellos\r\nexiste, [a Ti pertenece la alabanza. Tu eres el Señor de los\r\ncielos, de la tierra y de lo que entre ellos existe], [a Ti per-\r\ntenece la alabanza, Tu eres Soberano de los cielos y de la\r\ntierra y de todo lo que existe en ambos]. [Tuya es la alaban-\r\nza, la Soberanía de los cielos y la tierra]. [Tuya es la alaban-\r\nza]. [Tú eres la Verdad, tu promesa es verdadera, tu palabra\r\nes verdad, tu encuentro es cierto, el Paraíso es real, el In-\r\nfierno es real, los Profetas son verdad y Muhámmad (la paz y\r\nlas bendiciones de Allah sean con él) es verdad y la Hora Final es\r\nverdad]. [iOh Allah! a Ti me someto y en Ti confío, en Ti he\r\ncreido y a Ti he vuelto arrepentido, por Ti he discutido y a Ti\r\nhe vuelto para juzgar (sólo con Tú Ley). Entonces perdóna-\r\nme por lo que he cometido y por lo que vaya a cometer,\r\npor lo que haya ocultado y por lo que he manifestado]. [Tú\r\neres el Muqaddim (el que adelanta lo que ya había prede-\r\nterminado) y el MuáJJir (el que retrasa lo que ya había pre-\r\ndeterminado), no hay dios salvo Tú], [Tú eres mi Dios no\r\nhay divinidad excepto Tú]. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al comenzar la oración"
 },
 {
  "ZekarID": 33,
  "ZekarText": "Subjaana Rabbiil 'aDhimi.\r\n33-  Glorificado sea Allah, el Magnífico  (3 veces)",
  "RepeatNumber": 3,
  "Tabweeb": "Súplica durante la inclinación (Ruku')"
 },
 {
  "ZekarID": 34,
  "ZekarText": "Subjaanaka Allahumma Rabbanaa wa bijámdika Alla-\r\nhumma agfir lii.\r\n\r\n34-  iGlorificado Seas Oh Allah! Señor Nuestro, para Ti es la\r\nalabanza, Oh Dios perdoname. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica durante la inclinación (Ruku')"
 },
 {
  "ZekarID": 35,
  "ZekarText": "Subbuujun Quddusun Rabbul malaa.ikati war Ruuji.\r\n35-  Glorificado y Santo, Señor de los ángeles y del Ruh. ",
  "RepeatNumber": 3,
  "Tabweeb": "Súplica durante la inclinación (Ruku')"
 },
 {
  "ZekarID": 36,
  "ZekarText": "Allahumma laka raka'atu, wa bika aamantu wa laka as-\r\nlamtu Jashi'a laka sam'ii, wa baSarii, wa maJiaia, wa\r\n'aDhmii, wa 'aSabii, wa ma istaqalla bihi qádamii.\r\n\r\n36-  iDios mío! Ante Ti me inclino, en Ti he creido, a Ti me\r\nhe sometido en paz. Mis oídos, mi vista, mi mente, mis\r\nhuesos, mis músculos y a todo lo que se dirigen mis pies,\r\nson humildes ante Ti. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica durante la inclinación (Ruku')"
 },
 {
  "ZekarID": 37,
  "ZekarText": "Subjaana dhiil yabaruuti, wal malakuuti, wal kibri.ai, wal\r\n'áDhamah.\r\n\r\n37-  Glorificado sea el Dueño de todo Poder, Soberanía,\r\nMagnificencia y Grandeza. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica durante la inclinación (Ruku')"
 },
 {
  "ZekarID": 38,
  "ZekarText": "Sami'a Allahu liman jamidahu.\r\n38-  Escucha Allah a quien lo alaba. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al levantarse del Ruku'"
 },
 {
  "ZekarID": 39,
  "ZekarText": "Rabbanaa wa lakal jamdu jamdan kaziiran Taiiban mu-\r\nbaarakan fiihi.\r\n39-  Señor Nuestro, tuya es la alabanza, buena y bendita. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al levantarse del Ruku'"
 },
 {
  "ZekarID": 40,
  "ZekarText": "Mil.a assamauaati wa mil.al arDi wa maa bainahuma wa\r\nmil.a maa shi.ta min shei.in ba'du ahla azzanaá.i wa almaydi\r\najaqqu maa qaala al'abdu wa kúllunaa laka 'abdun. Alla-\r\nhumma laa maan'ia limaa a'Teita wa laa mu'Tii limaa ma-\r\nna'ta wa laa ianfa'u dhaal yaddi minkal yaddu.\r\n40-  Llenos están los Cielos y la Tierra y lo que existe entre\r\nellos de alabanzas para Ti y todo lo que quieres se desborda\r\nde alabanzas. Dueño de la alabanza y de la majestad, La\r\nmáxima verdad dicha por un siervo:  todos somos tus sier-\r\nvos . iOh Allah! nadie puede prohibir lo que tu concedes y\r\nnadie puede dar lo que Tú has negado, nadie beneficia ni\r\notorga majestuosidad, porque Tuya es la majestad. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al levantarse del Ruku'"
 },
 {
  "ZekarID": 41,
  "ZekarText": "Subjaana Rabbiil 'alaa.\r\n\r\n41-  Glorificado sea mi Señor el Altísimo.  (3 veces)?",
  "RepeatNumber": 3,
  "Tabweeb": "Súplica durante la postración (Suyúd)"
 },
 {
  "ZekarID": 42,
  "ZekarText": "Subjaanaka Allahumma Rabbanaa wa bijamdika Alla-\r\nhumma agfir lii.\r\n\r\n42-  Glorificado seas, oh Allah, Señor Nuestro alabado seas\r\noh Allah perdóname! ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica durante la postración (Suyúd)"
 },
 {
  "ZekarID": 43,
  "ZekarText": "Subbuujun Qudduusun Rabbul malaa.ikati war Ruuji.\r\n\r\n43-  Glorificado y Santo, Señor de los ángeles y del Ruh\r\n(ángel Gabriel (la paz sea con él)). ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica durante la postración (Suyúd)"
 },
 {
  "ZekarID": 44,
  "ZekarText": "Allahumma laka sayadtu wa bíka aamantu, wa laka as-\r\nlamtu sáyada wayhii lilladhii Jaláqahu wa Sawuárahu wa\r\nshaqqa sam'ahu wa baSarahu tabaaraka Allahu ajsanul Jaa-\r\nliqiin.\r\n44-  iOh Allah! A Ti me he prosternado, he creido y me he\r\nsometido a Ti. Se ha inclinado mi rostro ante Aquel que lo\r\nha creado, le ha dado forma y que ha hecho surgir de él la\r\nfacultad de la audición y la visión, Bendito sea Allah, el me-\r\njor de los creadores. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica durante la postración (Suyúd)"
 },
 {
  "ZekarID": 45,
  "ZekarText": "Subjaana dhiil yabaruuti, wal malakuuti, wa al kibriiaa.i,\r\nwa al 'aDhamati.\r\n\r\n45-  Glorificado seas, Dueño de todo poder, soberanía,\r\ngrandeza y magnificencia. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica durante la postración (Suyúd)"
 },
 {
  "ZekarID": 46,
  "ZekarText": "Allahumma agfir lii dhanbii kúllahu, díqqahu wa yillahu,\r\nwa auuálahu wa aaJirahu wa 'alaaniatahu wa sirrahu.\r\n\r\n46-  Oh Allah, perdóname todos mis pecados, pequeños y\r\ngrandes, pasados y presentes, públicos y secretos. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica durante la postración (Suyúd)"
 },
 {
  "ZekarID": 47,
  "ZekarText": "Allahumma innii a'udhu bi riDaaka min sáJaTika wa bi-\r\nmu'aafaatika min 'uquubatika wa a'uudhu bika minka, laa\r\nujSii zanaa.an 'aleika Anta kama azneita 'ala náfasika.\r\n\r\n47-  Oh Allah, ciertamente me refugio en Tu complacencia\r\nde Tu disgusto, y en Tu indulgencia de Tu castigo, Me refu-\r\n\r\ngio en Ti de Ti (en tu misericordia de tu furia), No puedo\r\nenumerar tus alabanzas, Tu eres tal como te has alabado a\r\nTi mismo. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica durante la postración (Suyúd)"
 },
 {
  "ZekarID": 48,
  "ZekarText": "Rabbi agfir lii Rabbi agfir lii.\r\n48-  Señor perdóname, Señor perdóname. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas al sentarse entre las dos proster-\r\nnaciones"
 },
 {
  "ZekarID": 49,
  "ZekarText": "Allahumma agfir lii, wa arjamanii, wa ahdinii, wa\r\nayburnii wa'aafaanii wa arzhuqnii, wa arfa'anii.\r\n\r\n49-  Oh Allah, perdóname, ten misericordia de mí, guíame,\r\nenriquéceme, concédeme salud, dame el sustento y eleva\r\nmi rango. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas al sentarse entre las dos proster-\r\nnaciones"
 },
 {
  "ZekarID": 50,
  "ZekarText": "Sáyyada wayhii lilladhííjalaqahu wa shaqqa sam'ahu wa\r\nbaSarahu bi jaulihi wa quwatihi {fatabaaraka Allahu ájsanul\r\nJaaliqiin}\r\n\r\n50-  Se ha prosternado mi rostro ante Aquel que lo ha\r\ncreado, le ha dado forma y ha hecho surgir de él la facultad\r\nde la audición y la visión, con su poder y fuerza. {Bendito\r\nsea Allah, el mejor de los creadores}",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica en la prosternación durante la re-\r\ncitación del Corán"
 },
 {
  "ZekarID": 51,
  "ZekarText": "Allahumma aktub lii biha 'aindaka ayran, waDa'a 'annii\r\nbiha wuizhran, way'alha lii 'aindaka dhuJran, wa taqabbalha\r\nminnii kama taqabbáltaha min 'ábdika Dawud.\r\n\r\n51-  Oh Allah, registra para mí una recompensa de Tu parte\r\n[por esta prosternación] y borra de mí un pecado. Sálvame\r\ny acéptalo de mí, como lo aceptaste de Tu siervo el Profeta\r\nDavid (la paz sea con él). ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica en la prosternación durante la re-\r\ncitación del Corán"
 },
 {
  "ZekarID": 52,
  "ZekarText": "At-tahiatu lillahi wa aSSalawatu waT Taibatu, wa assa-\r\nlamu'aleika iaa aiiuhan nabiíu wa rahmatullahi wa ba-\r\nrakátuhu, assalamu'aleina wa 'ala 'aibádika aSSaalihin.\r\nAshhadu an laa ilaaha illa Allah, wa ashhadu anna Muhám-\r\nmadan 'abduhu wa rasuuluhu.\r\n\r\n52-  Las salutaciones, son para Allah, todos los actos de\r\nadoración y las buenas obras. La Paz, la Misericordia y las\r\nBendiciones de Allah sean para ti. iOh Profeta! Que la Paz\r\nsea sobre nosotros y sobre Tus siervos virtuosos. Atestiguo\r\nque no hay dios salvo Allah y atestiguo que Muhámmad es\r\nSu siervo y mensajero. ",
  "RepeatNumber": 1,
  "Tabweeb": "Los dos testimonios de Fe"
 },
 {
  "ZekarID": 53,
  "ZekarText": "Allahumma Salli 'ala Muhámmadin wa 'ala Aali Mu-\r\nhámmadin kama Salleita 'ala Ibrahimi wa 'ala Aali Ibrahimi\r\nínnaka jámidun mayiid, Allahumma barik 'ala Muhámmadin\r\nwa 'ala Aali Muhámmadin kama barakta 'ala Ibrahimi wa\r\n'ala Ibrahimi ínnaka jámidun mayiid.\r\n\r\n53-  Oh Allah, alaba a Muhámmad y a la familia de\r\nMuhámmad, como alabaste a Abraham y a la familia de\r\nAbraham. Ciertamente Tú eres Alabado y Majestuoso iOh\r\nAllah! Bendice a Muhámmad y la familia de Muhámmad,\r\ncomo bendijiste a la familia de Abraham y a la familia de\r\nAbraham. Por cierto Tú eres Alabado y Majestuoso. ",
  "RepeatNumber": 1,
  "Tabweeb": "Las alabanzas para el Profeta luego de los\r\ndos testimonios de Fe"
 },
 {
  "ZekarID": 54,
  "ZekarText": " Allahumma innii a'uudhu bika min 'adhaabil qabr, wa min\r\n'adhaabi yahannam, wa min fitnatil majiaa wal mamaat, wa\r\nmin sherri fitnatil Masiijil Dayaal. \r\n\r\n55-  iOh Allah! Me refugio en Ti del tormento de la tumba,\r\ndel castigo del fuego, de las pruebas y tribulaciones de la\r\nvida y de la muerte, y de la sedición maligna del Falso Mesí-\r\nas (Masiiji Dayal).",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego del último tashahud y antes\r\ndel saludo final"
 },
 {
  "ZekarID": 55,
  "ZekarText": "Allahumma innii a'udhu bika min 'adhaabil qabr, wa\r\na'uudhu bika min fítnatil masiijil dayaal, wa a'udhu bika min\r\nfítnatil majiaa wal mamaat. Allahumma innii a'udhu bika mi\r\nal ma.zam wal mágrami. \r\n\r\n56-  iOh Allah! me refugio en Ti del tormento de la tumba,\r\ny me refugio en Ti de la sedición maligna del Falso Mesías\r\n(Masijil Dayal), Me refugio en Ti de las pruebas y tribulacio-\r\nnes de la vida y de la muerte. iOh Dios! me refugio en Ti del\r\npecado y de las deudas. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego del último tashahud y antes\r\ndel saludo final"
 },
 {
  "ZekarID": 56,
  "ZekarText": "Allahumma innii Dhalamtu nafsii Dhulman kaziiran wa\r\nlaa iagfiru adhunuuba illaa Anta fagfir lii magfiratan min 'in-\r\ndik warjamnii, innka Antal Gafuurul Rajiim.\r\n\r\n57-  iOh Allah! Yo he oprimido mi alma excesivamente y no\r\nhay quien perdone los pecados excepto Tú, absuélveme\r\ncon tu Perdón. Ten misericordia de mi, pues ciertamente Tu\r\neres Perdonador y Misericordiosísimo. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego del último tashahud y antes\r\ndel saludo final"
 },
 {
  "ZekarID": 57,
  "ZekarText": "Allahumma agfir lii maa qaddamtu, wa maa aJartu, wa\r\nmaa asrartu, wa maa a'alantu, wa maa asraftu, wa maa An-\r\nta a'alamu bihi minnii Antal Muqaddimu, wa Antal MuaJJíru\r\nlaa ilaha illa Anta.\r\n\r\n58-  Oh Allah perdóname tanto los pecados que cometí\r\ncomo lo que dejé de hacer, y aquellos que haya cometido\r\nen secreto y públicamente, y lo que haya malgastado, como\r\ntambién de aquellas cosas que Tú bien sabes de mí. Tu eres\r\nel Muqaddim (el que adelanta lo que ya había predestína-\r\ndo) y el MuaJJir (el que retrasa lo que ya había predestina-\r\ndo) no hay dios salvo Tú. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego del último tashahud y antes\r\ndel saludo final"
 },
 {
  "ZekarID": 58,
  "ZekarText": "Allahumma a'inii 'alaa dhíkrika, wa shúkrika, wa jusni\r\n'ibadatik.\r\n\r\n59- Oh Señor ayúdame a recordarte, agradecerte y adorar-\r\nte de la mejor manera.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego del último tashahud y antes\r\ndel saludo final"
 },
 {
  "ZekarID": 59,
  "ZekarText": "Allahumma innii a'udhu bika minal buJli, wa a'udhu bika\r\nminal yubni, wa a'udhu bika min an uradda ilaa ardhalil\r\n'umur, wa a'udhu bika min fitnati dunia wa 'adhabil qabri.\r\n\r\n60- Oh Allah, me refugio en Ti de ser avaro y cobarde, y\r\nbusco refugio en Ti de llegar a la vejez (débil e incapacíta-\r\ndo), me refugio en Ti de las tribulaciones y vanidades de es-\r\nte mundo y de los tormentos de la tumba.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego del último tashahud y antes\r\ndel saludo final"
 },
 {
  "ZekarID": 60,
  "ZekarText": "Allahumma innii as.alukal yannata wa a'udhu bika mi-\r\nnan naar.\r\n\r\n61- Oh Dios mío, te imploro el Paraíso y en Ti me refugio\r\ndel fuego.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego del último tashahud y antes\r\ndel saludo final"
 },
 {
  "ZekarID": 61,
  "ZekarText": "Allahumma bi 'ilmika al gaibi wa qudratika 'alaal Jalqi\r\najiinii maa 'alimta aljaiaata Jairan lii wa tauáffanii idhaa\r\n'alimta al uafaata Jairan lii, Allahumma innii as.aluka Jashia-\r\ntaka fiiI gaibi wa shahaada, wa as.aluka kalimatal jaqqi fii\r\nriDaa wal gaDabi, wa as.aluka alqasda fiil guinaa wal faqri,\r\nwa as.aluka na'iman laa ianfadu, wa as.aluka qurrata 'ainin\r\nlaa tanqaTi'u wa as.aluka arriDaa ba'dal qaDaá.i, wa\r\nas.aluka barda l 'aishi ba'dal maouti, wa as.aluka ladhdhatal\r\nnaDhar ilaa uáyhika wash shauqa ilaa liqaa-ika fii gairí Dar-\r\nraa.a muDirratiin wa laa fitnattin muDillatin Allahumma\r\n\r\nzhaiiannaa bizhiinatil iimaáni wa iy'alnaa hudaatan muhta-\r\ndiina.\r\n\r\n62- Oh Allah, por Tu conocimiento de lo oculto y Tu poder\r\nsobre la creación, mantenme con vida mientras sepas que\r\nella es beneficiosa para mí, y toma mi alma cuando sepas\r\nque la muerte es mejor para mí. Oh Señor te pido ser teme-\r\nroso de Ti, tanto en lo secreto como en lo público. Hazme\r\nsincero, tanto complacido como cuando estoy enojado.\r\nHazme moderado tanto en tiempos de prosperidad como\r\nen los de pobreza. Te pido gracias que nunca cesen y Te pi-\r\ndo delicias (que den frescura a los ojos) que no terminen ni\r\ncesen. Te pido estar complacido con lo que Haz predestina-\r\ndo. Te suplico una placentera vida despues de la muerte. Te\r\npido la dulzura de contemplar Tu rostro y desear Tu en-\r\ncuentro, no sólo en momentos de dificultad ni tribulaciones\r\nque me desvien sino en todo momento. Oh Allah, enbellé-\r\ncenos con la Fe y haznos de aquellos que guían (a los de-\r\nmás) y son guiados.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego del último tashahud y antes\r\ndel saludo final"
 },
 {
  "ZekarID": 62,
  "ZekarText": "Allahumma innii as.aluka la Allah bi annakal Uaajidul\r\nAjadu aSSámadul ladhii lam ialid wa lam iúulad wa lam ia-\r\nkun lahu kufuáan ajadun an tágfira lii dhunuubii innaka an-\r\ntal gafuuru rajiimu.\r\n\r\n63- Oh Señor, Te imploro, Oh Allah porque Tu eres el uno,\r\nel único, el Eterno que no engendró ni fue engendrado, y\r\n\r\n\r\nnada es semejante a él, que perdones mis pecados, porque\r\nTu eres el Perdonador, el Misericordiosísimo.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego del último tashahud y antes\r\ndel saludo final"
 },
 {
  "ZekarID": 63,
  "ZekarText": "Allahumma innii as.aluka bi anna lakal jamdu laa ilaha\r\nillaa Anta uajdaka laa shariika laka al mannaán la badí' as\r\nsamauaati wal arDi iaa Dhaal yalaali wal ikraam la jaiiu ia\r\nQaiuum innii as.alukal yannata wa a'auudhu bika minan\r\nnaar.\r\n\r\n64-  Oh Señor, te ruego porque tuya es la alabanza y no\r\nexiste divinidad sino Tú, único sin asociados Tú eres el Be-\r\nnefactor y el Originador de los cielos y de la tierra. iOh Po-\r\nseedor de la majestad y la generosidad! Oh Viviente, oh\r\nSubsistente. Ciertamente te suplico el Paraíso y me refugio\r\nen Ti del fuego .",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego del último tashahud y antes\r\ndel saludo final"
 },
 {
  "ZekarID": 64,
  "ZekarText": "Allahumma innii as.aluka bianníi ashhadu ánnaka Anta\r\nAllah laa ilaha illaa ántal ájaduS Sámadul ladhií lam iálid wa\r\nlam iúulad wa lam iákun lahu kufuuán ajadun.\r\n\r\n65- Oh Señor te ruego atestiguando que tu eres Allah, no\r\nhay dios salvo Tú, eres el único, el eterno el que no engen-\r\ndra ni fue engendrado y no hay nadie que se Le asemeje.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego del último tashahud y antes\r\ndel saludo final"
 },
 {
  "ZekarID": 65,
  "ZekarText": "Astagfirullah (3 veces) Allahumma anta assalaam wa\r\nminka assalaam tabaarakta iaa Dhaal yalaali ual ikraami.\r\n\r\n66- Perdóname (3 veces)\r\n\r\nOh Allah Tú eres la Paz y de Ti viene la Paz. Bendito Tú eres\r\noh Poseedor de la majestad y la generosidad.",
  "RepeatNumber": 3,
  "Tabweeb": "Súplica luego de la salutación final"
 },
 {
  "ZekarID": 66,
  "ZekarText": "Laa ilaha illaa Allah uajdahu laa sheriika lahu, lahul mul-\r\nku, ua lahul jamdu ua hua 'alaa kulli shei.in qadiir. Laa jaula\r\nua laa qúwwata illaa bil-lah, laa ilaha illaa Allah, ua laa\r\nna'budu illaa iiaahu, lahul ni'matu ua lahul faDlu ua lahu\r\nzzanaa.ul jásanu, laa ilaha illaa Allahu muJliSiina lahud diina\r\nua louu kárihal kaafiruúna.\r\n\r\n68- No hay divinidad salvo Allah, único sin asociado, Suyo es\r\nel Reino, Suya es la alabanza, y es sobre toda cosa podero-\r\nso. No hay fuerza ni poder salvo en Allah, no hay divinidad\r\nsino Allah y no adoramos sino a Él. Todas las gracias provie-\r\nnen de Él. A Él le pertenece y el agradecimiento y la alaban-\r\nza. No hay divinidad salvo Allah, (somos) sinceros en la\r\nadoración aunque esto disguste a los incrédulos.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego de la salutación final"
 },
 {
  "ZekarID": 67,
  "ZekarText": "Laa ilaha illa Allah uajdahu laa shariika lahul mulk ua la-\r\nhul hamdu ua hua 'alaa kulli sheiin qadiir, Allahumma laa\r\nmaani' limaa 'aTeita, ua laa mu'Tii lima mana'ta, ua laa ian-\r\nfa'a Dhaal yaddi minkal yaddu.\r\n\r\n67- No hay divinidad salvo Allah, único sin asociado, Suyo es\r\nel Reino, Suya es la alabanza, y es Todopoderoso.\r\n\r\nOh Señor nadie puede negar lo que Tu provees, así como\r\nnadie puede dar si Tu lo impides y no hay bondad que pue-\r\nda beneficiar, porque tuya es la bondad.",
  "RepeatNumber": 3,
  "Tabweeb": "Súplica luego de la salutación final"
 },
 {
  "ZekarID": 68,
  "ZekarText": "Subjaana Allah ual jamdu lillah ua Allahu ákbar (treinta y\r\ntres veces) laa ilaha illaa Allah uajdahu laa sheriika lahu, la-\r\nhul mulku ua lahul jamdu ua hua 'alaa kulli shei.in qadir.\r\n\r\n69- Glorificado sea Allah, la alabanza es para Allah y Allah es\r\nel más grande (33 veces).\r\nNo hay divinidad salvo Allah, único, sin asociado Suyo es el\r\nreino y la alabanza y es sobre toda cosa poderoso.",
  "RepeatNumber": 33,
  "Tabweeb": "Súplica luego de la salutación final"
 },
 {
  "ZekarID": 69,
  "ZekarText": "{Qui hua Allahu Ajad} y {Qui .a'uudhu bi Rabbil falaq} y\r\n{Qul.a'uudhu bi Rabbin naasi} después de cada oración\r\nprescrita Salat.\r\n\r\n70-  Di: Allah es único  y  Di: me refugio en el Señor de la\r\nalba  y  Di: me refugio en el Señor de los hombres  des-\r\npués de cada oración prescrita Salat.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego de la salutación final"
 },
 {
  "ZekarID": 70,
  "ZekarText": "Y se recita la aleya del Trono  Aiat al cursi  después de\r\ncada oración prescrita.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego de la salutación final"
 },
 {
  "ZekarID": 71,
  "ZekarText": "Laa ilaha illaa Allah uajdahu laa sheriika lahu, lahul mul-\r\nku ua lahul jamdu iujii ua iumiit ua hua 'alaa kulli shei.in qa-\r\ndir.(Diez veces después del Salat al Magrib y el Salat al\r\nFayer.\r\n\r\n72- No hay divinidad salvo Allah, único, sin asociado, Suyo\r\nes el Reino y la Alabanza, da la vida y la muerte, y es sobre\r\ntoda cosa poderoso.",
  "RepeatNumber": 10,
  "Tabweeb": "Súplica luego de la salutación final"
 },
 {
  "ZekarID": 72,
  "ZekarText": "Allahumma innii as.aluka 'ilman naafi'an ua rizhqan\r\nTaiiban, ua 'amalan mutaqabbalan.\r\n\r\n73- Oh Señor te ruego un conocimiento beneficioso, un sus-\r\ntento agradable y la aceptación de las obras. (después de la\r\nsalutación final de la oración del Fayr)",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego de la salutación final"
 },
 {
  "ZekarID": 73,
  "ZekarText": "Allahumma innii astaJíiruka bi'ílmika, ua astaqdíruka bi-\r\nqudrátika, ua as.aluka min faDlikal 'adhíim fa ínnaka táqdíru\r\nua laa áqdiru, ua tá'lamu ua laa á'alam ua Anta 'allaámul\r\nguiuubi, Allahumma in kunta ta'lam an hadhaal amru _ y\r\npronuncia su necesidad, asunto o problema Jeirun lii fii di-\r\ninii ua ma'aashii ua 'áaqibati ambrii o dice: 'aayalihi wa aay-\r\nlihi faáqdárahu lii ua iásruhu lii zumma baarik lii fiihi, ua in\r\nkunta ta'lam an hadhaal amru sherru lii fii diinii ua ma'ashii\r\nua 'áaqibati amrii o dice: 'aayalihi ua aaylihi faasrifahu 'annii\r\nua asrifnii 'anhu ua áqdirru lii al jaira jaizu kaana zumma ar-\r\ndinii bihi. \r\n\r\n74- Dijo Yabir ibn 'Abdullah (Allah se complazca de él): Siempre\r\nel Profeta (la paz y las bendiciones de Allah sean con él) solía ense-\r\nñarnos la búsqueda del buen consejo en todos los asuntos,\r\no situaciones, como solía enseñarnos una Sura del Corán,\r\ndiciendo: ((Si alguno de vosotros le aqueja algún asunto en-\r\ntonces que realice dos raka'as como sunnah (oración su-\r\nperoratorias), no las oraciones obligatorias (sino luego de\r\nellas) después que diga: Oh Allah te pido el bien de lo que\r\nTú tienes conocimiento iOh Allahl, por cierto que te consul-\r\nto porque Tuyo es el conocimiento y el poder. Busco forta-\r\nleza y ruego de Tu inmenso favor, porque ciertamente Tú\r\npuedes y yo no puedo, Tu sabes y yo no sé, Tu eres el Co-\r\nnocedor de lo Oculto. iOh Allahl Si Tú conoces que este\r\nasunto...( y pronuncia su necesidad, asunto o problema) es\r\nbueno para mí, para mi Din, mi vida y mi muerte, entonces\r\ndecrétalo, facilítamelo y bendíceme con ello. (En cambio) Si\r\nTu conoces que este asunto será un mal para mí, para mi\r\nDin, para mi vida y mi muerte, entonces aléjalo de mí y de-\r\ncreta para mí lo que es bueno dondequiera que sea, y haz-\r\nme quedar satisfecho con ello. \r\n\r\nY para quien busca la Guía de Allah y consulta a los creyen-\r\ntes, luego permanece firme en su resolución, Allah Altísimo\r\ndice:  y consultadlos en los asuntos, entonces, cuando\r\nhayas tomado una decisión, pon tu confianza en Allah .\r\n[3:159]",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para pedir el bien (Salat Al-lstijara)"
 },
 {
  "ZekarID": 76,
  "ZekarText": "{Qul hua Allahu Ajad} y {Qul .a'uudhu bi Rabbil falaq} y\r\n{Qulauudhu bi Rabbin naasi}\r\n\r\n76- Abdullah ibn Jubaib (Allah se complazca de él) dijo: El mensa-\r\njero de Allah (la paz y las bendiciones de Allah sean con él) me dijo:\r\nRecita,\r\n\r\nLe contesté: iMensajero de Allah! ¿Qué debo recitar? El\r\nProfeta (la paz y las bendiciones de Allah sean con él) respondió: Re-\r\ncita:  Di Allah es único  (Sura 112),  Di me refugio en el Se-\r\nñor del alba  (Sura 113), y  Di me refugio en el Señor de los\r\nhombres  (Sura 114) tres veces a la noche y tres veces por\r\nla mañana esto te será suficiente en todo asunto.",
  "RepeatNumber": 3,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 78,
  "ZekarText": " Allahumma bika aSbajnaa wa bika amsainaa, wa bika\r\nnajiaa wa bika namuutu, wa ileikal nushuuru \r\n\r\n78-  Oh Allah, por Ti amanecemos y por Ti atardecemos,\r\ncon tu permiso vivimos y morimos, y a Ti será el retorno \r\n\r\nPor la tarde:  Allahumma bika amsainaa, wa bika aSbajnaa,\r\nwa bika najiaa wa bika namuutu, wa ileikal maSiiru \r\n\r\nPor la tarde:  iOh Allah! Por Ti atardecemos y con Tu per-\r\nmiso vivimos y morimos y a Ti será el retorno ",
  "RepeatNumber": 1,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 79,
  "ZekarText": " Allahumma Anta Rabbii laa ilaha illa Anta Jalaqtanii wa\r\nana 'abduka, wa ana 'alaa 'ahdika wa wá'dika maa istaTa'tu\r\na'udhu bika min sherri maa Sana'tu, ábuu.u laka bini'matika\r\n'aleiia, wa abuu.u bi dhanbii, faagfir lii fa innahu laa iagfira\r\naddhunuuba illaa Anta \r\n\r\n79-  Oh Allah Tu eres mi Señor, no hay Dios salvo Tú, me\r\nhas creado y yo soy tu siervo, Mantengo mi pacto y prome-\r\nsa contigo de la mejor manera que puedo, en Ti me refugio\r\ndel mal que haya cometido. Reconozco Tus gracias para\r\nconmigo y reconozco mis pecados, perdóname porque cier-\r\ntamente nadie perdona los pecados sino Tú. ",
  "RepeatNumber": 1,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 80,
  "ZekarText": " Allahumma innii aSbajtu ushhiduka, wa ushhidu Ja-\r\nmalata 'arshika, wa mala.ikataka, wa yamii'a Jalqika, annaka\r\nAnta Allah laa ilaha illa Anta, wajdahu laa shariika laka, wa\r\nanna Muhámmadan 'abduka wa rasuuluka \r\n\r\n80-  Oh Allah, ciertamente amanezco y atestiguo, así como\r\natestiguan los (ángeles) que sostienen Tu Trono, Tus ánge-\r\nles y toda Tu creación, de que Tu eres Allah y no hay divini-\r\ndad salvo Tú, único, sin asociado y que Muhammad es Tu\r\nsiervo y mensajero . (4 veces por la mañana y por la tar-\r\nde)?",
  "RepeatNumber": 4,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 81,
  "ZekarText": " Allahumma maa aSbaja bii min ni'mati, au bi ajadii min\r\nJalqika, fa minka wajdaka laa shariika laka, fa lakal jamdu\r\nwa laka ashshukru \r\n\r\n81-  iOh Allah! Toda la gracia que poseo o posea alguien de\r\nTu creación, proviene de Ti, único sin asociados, para Ti es\r\nla alabanza y el agradecimiento. \r\n\r\n Quienquiera que diga esto por la mañana, ciertamente ha\r\n\r\nagradecido lo que le es obligatorio por ese día, y quíenquíe-\r\nra lo diga por la tarde, por cierto que ha agradecido lo que\r\nle es obligatorio por esa noche. ",
  "RepeatNumber": 1,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 82,
  "ZekarText": " Allahumma 'aafinii fii badanii, Allahumma 'aafinii fii\r\nsam'iii, Allahumma 'aafinii fii baSarii, laa ilaha illa Anta. Al-\r\nlahumma innii a'udhu bika minal kufri wal faqri, wa a'udhu\r\nbika min 'adhaabil qabri, laa ilaha illa Anta \r\n\r\n82-  Oh Allah, concede salud a mi cuerpo, Oh Allah, otorga-\r\nle salud a mis oídos, Oh Allah, concede salud a mi vista, no\r\nhay dios sino Tú (3 veces). Oh Allah ciertamente me refugio\r\nen Ti de la incredulidad, de la pobreza, y en Ti me amparo\r\ndel tormento de la tumba, no hay dios sino Tú.  (3 veces)",
  "RepeatNumber": 3,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 83,
  "ZekarText": " Jasbii Allah laa ilaha illa húa 'aleihi tawakkaltu wa hua\r\nRabbul 'arshil ADhiimi \r\n\r\n83-  Allah me es suficiente, no hay divinidad excepto Él, en\r\nÉl confío que es el Señor del Trono Magnífico.  (7 veces por\r\nla mañana y 7 veces por la tarde)",
  "RepeatNumber": 7,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 84,
  "ZekarText": " Allahumma innii as.aluka al 'afua wal 'aafiiata fiid dunia\r\nwal áaJirati, Allahumma innii as.aluka al 'afua wal 'aafiiata fii\r\ndiinii, wa duniaaia wa ahlii, wa maalii, Allahumma ustur 'au-\r\nraatii, wa aamin rau'aatii, Allahumma ajfíDhnii min baini\r\niadaiia, wa min Jalfii, wa 'an shimaalii, wa min fauqii, a'udhu\r\nbi 'aDhamatika an ugtaala min tajtii \r\n\r\n84- Oh Allah ciertamente solicito Tu indulgencia y el bienes-\r\ntar en esta vida y en la otra, Oh Allah ciertamente ruego Tu\r\nperdón y el bienestar en mis asuntos religiosos, mundana-\r\nles, mi familia y mis bienes, Oh Allah cubre mi desnudes, y\r\nconfórtame ante el miedo, Oh Allah protégeme por todas\r\npartes, delante y por detrás, a mi derecha e izquierda, so-\r\nbre m; Me refugio en tu grandeza de ser engullido por la\r\ntierra.",
  "RepeatNumber": 1,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 85,
  "ZekarText": " Allahumma 'Aalimal gaibi wash shahaadati FaaTira as-\r\nsamauaati wal arDi rabba kulli shei.in wa maliikahu, ash-\r\nhadu an laa ilaha illa Anta a'udhu bika min sherri nafsii wa\r\nmin sherri SheiTaani wa shirkihi, wa an aqtarifa 'alaa nafsii\r\nsuu.an au ayurrahu ilaa muslimin \r\n\r\n85- Oh Allah, Conocedor de lo oculto y lo manifiesto, Crea-\r\ndor delos cielos y de la tierra, Señor de los ángeles y de to-\r\ndas las cosas, atestiguo que no hay divinidad sino Tu, me\r\nrefugio en Ti del mal de mi mismo, del mal del Sheitan y de\r\nsu idolatría, y de cometer mal en contra de mi mismo, o en\r\ncontra de un musulmán.",
  "RepeatNumber": 1,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 86,
  "ZekarText": " Bismi Allahi alladhíí laa iaDurru ma'a ismihi sheiiun fiil\r\narDi wa laa fis samaa.i wa húas Samii'ul 'Aliimu \r\n\r\n86- En el nombre de Allah el cual en su nombre nada perju-\r\ndica, asi en la tierra como en los cielos, El es quien todo lo\r\noye el Omnisapiente. (3 veces)",
  "RepeatNumber": 3,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 87,
  "ZekarText": " RaDiitu bi Allahi rabban, wa bil Islaami diinan, wa bi\r\nMuhámmadin (la paz y las bendiciones de Allah sean con él) Na-\r\nbiian \r\n\r\n87- Me complazco de Allah como Señor, del Islam como re-\r\nligión, y de Muhámmad (la paz y las bendiciones de Allah sean con\r\nél) como Profeta. (3 veces)",
  "RepeatNumber": 3,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 88,
  "ZekarText": " Iaa Jaiiu iaa Qaiiuumu bi Rajmátika astaguiízu aSlij lii\r\nsha.nii kullahu wa laa takllnll ilaa nafsii Tárfata 'ainin \r\n\r\n88- Oh Viviente, Oh Subsistente, en Tu misericordia busco\r\nasistencia, rectifica todos mis asuntos y no me dejes librado\r\na mi mismo, ni siquiera por un pestañeo (un instante).",
  "RepeatNumber": 1,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 89,
  "ZekarText": " ASbajnaa wa as bajal Mulku Lillahi Rabbil 'aalamiin, Al-\r\nlahumma innii as.aluka Jeira hadhaal iaumi, fatjahu, naS-\r\nrahu, wa nuurahu wa barakatahu, wa hudaahu,wa a'udhu\r\nbika min sherri maa fiihi wa sherri maa ba'dahu \r\n\r\n89- Amanecemos y amanece la Soberanía de Allah Señor de\r\nlos Mundos, Oh Allah por cierto Te pido lo bueno de este\r\ndía, en su principio, su fin, su luz, sus bendiciones y su guía,\r\nY me refugio en Ti del mal de este día y del mal de lo que\r\nvenga luego de él. Se dice lo mismo por la tarde, cambian-\r\ndo el principio  Amanezco...  por  Atardece... ",
  "RepeatNumber": 1,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 90,
  "ZekarText": " ASbajnaa 'alaa fíTratil Islaam, wa 'alaa kalimatil IJlaaSi\r\nwa 'alaa diini nabiinaa Muhámmadin (la paz y las bendiciones de\r\nAllah sean con él) wa 'alaa millati abiinaa Ibraahiima janiifan\r\nmusliman wa maa kaana minal mushshirikiina \r\n\r\n90-  Amanezco con la  Fitra  (la inclinación natural del ser\r\nhumano la religión) del Islam, con la palabra del monoteís-\r\nmo puro, en la religión de nuestro Profeta Muhámmad (la\r\npaz y las bendiciones de Allah sean con él) y de la religión de nues-\r\ntro padre Abraham (la paz sea con él), quien fue monoteista,\r\n\r\nmusulmán y no se contó entre los asociadores. ",
  "RepeatNumber": 1,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 91,
  "ZekarText": " Subjaana Allahi wa bi jamdihi \r\n\r\n91- Glorificado sea Allah y Alabado sea. (100 veces)",
  "RepeatNumber": 100,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 92,
  "ZekarText": " Laa ilaha illa Allahu, wajdahu laa shariika Lahu, Lahul\r\nmulku wa lahul jamdu wa húa 'alaa kulli sheiin Qadiir \r\n\r\n92- Dijo el Mensajero de Allah (la paz y las bendiciones de Allah\r\nsean con él) Quien diga al levantarse:  No hay divinidad salvo\r\nAllah, único, sin asociado, Suyo es el Reino, Suya es la ala-\r\nbanza y es sobre toda cosa Poderoso  Ha ganado la recom-\r\npensa de liberar a un esclavo de los Hijos de Ismael y diez\r\nde sus pecados han sido perdonados y es elevado diez gra-\r\ndos y ha encontrado refugio seguro contra Sheitan hasta\r\nque anochezca. De la misma manera, si lo dice por la noche,\r\nserá protegido hasta la mañana. ",
  "RepeatNumber": 10,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 93,
  "ZekarText": " Laa ilaha illa Allahu, wajdahu laa shariika Lahu, Lahul\r\nmulku wa lahul jamdu wa húa 'alaa kulli shei.in Qadiir \r\n\r\n93- No hay divinidad salvo Allah, único, sin asociado, Suyo\r\nes el Reino y Suya es la alabanza y es sobre toda cosa Pode-\r\nroso.  (100 veces)",
  "RepeatNumber": 100,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 94,
  "ZekarText": " Subjaana Allahi wa bi jamdihi 'adada Jalqihi wa riDaa\r\nnafsihi wa zhinata 'arshihi wa midaada kalimaatihi \r\n\r\n94- Glorificado sea Allah y alabado sea por el número de\r\ncuanto ha creado, por su Complacencia, por el peso de Su\r\nTrono y por la tinta de sus palabras. (3 veces)",
  "RepeatNumber": 3,
  "Tabweeb": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "ZekarID": 99,
  "ZekarText": "{Qui hua Allahu Ajadu} y {Qul .a'udhu bi Rabbil falaq} y {Qul.a'uudhu bi Rabbin naasi}\r\n\r\n99- Cuando a la noche el Profeta (la paz y las bendiciones de Allah sean con él) se recostaba en su lecho, juntaba sus palmas, so-\r\nplaba en ellas (escupía sólo con aire, sin saliva), recitaba las\r\ntres últimas suras del Corán y luego se frotaba todo el\r\ncuerpo tanto como le era posible, comenzando por su ca-\r\nbeza, luego su rostro y después sobre las demás partes del\r\ncuerpo. Realizaba esto tres veces.",
  "RepeatNumber": 3,
  "Tabweeb": "Súplicas antes de dormir"
 },
 {
  "ZekarID": 101,
  "ZekarText": " Aamana arRasuulu bimaa únzhila ileihi mi Rabbihi wal\r\nmu.minuuna... \r\n\r\n101-  Quien recite las últimas dos aleyas de Sura  La vaca \r\n(2:285-286) por la noche le serán suficientes.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas antes de dormir"
 },
 {
  "ZekarID": 102,
  "ZekarText": " Bismika Rabbii uaDa'tu yanbii wa bika arfa'uhu fa.in\r\namsakta nafsii faarjamha wa in arsaltaha faajfaDhhaa bimaa\r\ntajfaDhu bihi 'ibaadaka aSSaalijiin \r\n\r\n102- Si alguno de vosotros se levanta de su lecho y luego re-\r\ntorna a él, deberá sacudirlo desde el extremo de su vestí-\r\nmenta tres veces, porque desconoce lo que pudiera haber\r\nocurrido en su ausencia, debiendo recitar cuando se acues-\r\nte:  En Tu nombre, mi Señor, me recuesto sobre mi costado\r\ny en Tu nombre me levanto, entonces si tomas mi alma,\r\n\r\nTen misericordia de ella, y si la devuelves, protégela de la\r\nmanera en que lo haces con tus siervos rectos.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas antes de dormir"
 },
 {
  "ZekarID": 103,
  "ZekarText": " Allahumma innaka Jalaqta nafsii wa Anta tauafaahaa\r\nlaka mamaatuha wa majiaahaa in ajiaitahaa faajfaDhhaa wa\r\nin amattahaa faagfir lahaa Allahumma innii as.alukal\r\n'aafiata \r\n\r\n103- Oh Allah, ciertamente Tú me has creado, y Tú tomarás\r\nmi alma, a Ti te pertenece mi muerte y mi vida, si la man-\r\ntienes con vida, protégela y si le das muerte, entonces per-\r\ndónala. iOh Señor! Ciertamente te pido salud.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas antes de dormir"
 },
 {
  "ZekarID": 104,
  "ZekarText": " Allahumma qinii 'adhaabaka iauma tab'azu 'ibaadaka \r\n\r\n104- El Profeta (la paz y las bendiciones de Allah sean con él) ubica-\r\nba su mano derecha bajo su mejilla cuando se disponía a\r\ndormir y suplicaba así:  Oh Allah, protégeme de Tu castigo\r\nen el día que resucites a Tus siervos  (Lo decía 3 veces)",
  "RepeatNumber": 3,
  "Tabweeb": "Súplicas antes de dormir"
 },
 {
  "ZekarID": 105,
  "ZekarText": " Bismika Allahumma amuutu wa ajiaa .\r\n\r\n105- En Tu nombre, Oh Allah muero y (re)vivo (es decir:\r\nduermo y despierto, debido a la similitud que existe entre\r\nel sueño y la muerte, y entre revivir y despertar).",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas antes de dormir"
 },
 {
  "ZekarID": 106,
  "ZekarText": " Subjaana Allah-aljamdullilah-Allahuakbar \r\n\r\n105- El Profeta (la paz y las bendiciones de Allah sean con él) se diri-\r\ngió a 'Ali y Fatima cuando su hija le solicitó un sirviente, les\r\ndijo:\r\n¿Acaso no queréis algo mejor que un sirviente? Pues cuan-\r\ndo vayais al lecho decid: iGlorificado sea Allah! 33 veces,\r\niAlabado sea Allah! 33 veces, iAllah es el más grande! 34\r\nveces, es mejor para vosotros que un sirviente. ",
  "RepeatNumber": 33,
  "Tabweeb": "Súplicas antes de dormir"
 },
 {
  "ZekarID": 107,
  "ZekarText": " Allahumma rabbas samawaatis sab'i, wa rabbal arshil\r\naDhiimi, rabbanaa wa rabba kulla shei.in, faaliqal jabbi wan\r\nnáwaa wa munázhzhila atauraati wal inyiili, wal furcáan,\r\na'udhu bika min sherri kulli shei.in Anta áaJidhu binaaSia-\r\ntihi. Allahumma Antal áaualu faleisa qablaka shei.iun, wa\r\nAntal áaJiru faleisa ba'daka shei.un, wa Anta ADhDhaahiru\r\nfaleisa fauqaka shei.un, Antal baaTinu faleisa dúnaka\r\nshei.un. íqDí 'annaa addaina wa agninaa minal faqri.\r\n\r\n107-  Oh Allah, Señor de los siete cielos y del Trono magní-\r\nfico, nuestro Señor y soberano de todas las cosas, quien\r\nhace germínar la semilla y el carozo del dátil, quien ha reve-\r\nlado la Torah, el Evangelio y el Furqanl me refugio en Ti de\r\ntodo mal sobre lo que Tú tienes total dominio, Oh Allah, Tú\r\neres el Primero, el que nada lo precedió, el último, el que\r\nnada lo sucederá, el Evidente, y no hay por encima de Ti, el\r\nOculto, quien no hay nadie más allá de Ti. Salda nuestras\r\ndeudas, y protégenos de la pobreza. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas antes de dormir"
 },
 {
  "ZekarID": 108,
  "ZekarText": "Aljamdulillah alladhíí aT'amanaa wa saqáanaa, wa\r\nkafáanaa wa áawaanaa fakám miman laa káafia lahu wa laa\r\nmú.wiia.\r\n\r\n108-  Alabado sea Allah quien nos alimentó, nos dio de be-\r\nber, nos es suficiente y nos ha dado refugio, pero en cam-\r\nbio cuántos hay que no tienen quien sea suficiente y les de\r\nrefugio. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas antes de dormir"
 },
 {
  "ZekarID": 109,
  "ZekarText": "Allahumma 'aalimal gaibi wash shahaadati faaTira as-\r\nsamawaatu wal arDi rabba kulli shei.in wa malíikahu, ash-\r\nhadu an laa ilaaha illa Anta a'udhu bika min sherri nafSíi wa\r\nmin sherri ashsheiTaani wa shírkihi, wa an aqtarifa 'aalaa\r\nnafSii súuuan au ayurrahu ilaa Muslim.\r\n\r\n109-  Oh Allah, Conocedor de lo oculto y lo manifiesto,\r\nCreador de los cielos y de la tierra, Señor de los ángeles y\r\nde todas las cosas, atestiguo que no hay divinidad sino Tú,\r\nme refugio en Ti del mal de mi mismo, del mal del Sheitan y\r\nde su idolatría, y de cometer el mal a mi mismo, o en co-\r\nntra de un musulmán. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas antes de dormir"
 },
 {
  "ZekarID": 111,
  "ZekarText": "Allahumma aslamtu nafSii ileika wa fawaDtu amiri ilei-\r\nka, wa wayahtu wayhii ileika, wa alya.tu Dhahrii ileika, rág-\r\nbatan wa ráhbatan ileika laa malyaá. Wa laa manyáa minka\r\nilla ileika, aamántu bikitáabika alladhíí anzhalta wa bi-\r\nnabiíika alladhíí arsalta.\r\n111-  Si vas a acostarte haz la ablución, la misma que reali-\r\nzas para la oración, luego recuestate sobre tu lado derecho\r\ny di: Oh Señor me he sometido a Ti, he confiado a Ti mis\r\nasuntos, he vuelto mi rostro hacia ti, y he depositado mi\r\ncompleta confianza en Ti, con esperanza y temor, no hay\r\nrefugio ni salvación de Ti, salvo en Ti, he creido en el libro\r\nque Has revelado, y en el Profeta que has enviado. (Quien\r\ndiga esto) entonces si mueres, lo harás en la fitrah (que es\r\nla inclinación natural del ser humano). ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas antes de dormir"
 },
 {
  "ZekarID": 112,
  "ZekarText": "Laa ilaaha illa Allah alwaajidul qahhaaru, rabbus sa-\r\nmawaati wal arDi wa maa beináhumal azhiizhul gaffaaru.\r\n\r\n112- Relató 'Aisha (Allah se complazca de ella) que el Mensajero\r\nde Allah (la paz y las bendiciones de Allah sean con él) Si se desvela-\r\nba decía:  No hay divinidad salvo Allah, el Uno, el Vencedor,\r\nSeñor de los cielos y de la tierra, y de lo que existe entre\r\nellos, el Poderoso, el lndulgente. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para quien sufre insomnio"
 },
 {
  "ZekarID": 113,
  "ZekarText": "A'udhu bikalimáatil-lahit taammaati min gáDabihi wa\r\n'iqaabihi, wa sherri 'ibaaadihi wa min hamazháati sh sheiaa-\r\nTiini wa an iajDuruuni.\r\n\r\n113-  Me refugio en las palabras perfectas de Allah, de Su\r\nenojo y Su castigo, la maldad de Sus siervos, las sugestiones\r\nde los demonios, y de su presencia. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica ante el temor, las preocupaciones\r\no las pesadillas"
 },
 {
  "ZekarID": 115,
  "ZekarText": " El sueño placentero proviene de Allah, y la pesadilla\r\nde Sheitan, entonces si veis algo que le complace que se lo\r\ncuente a quien ame (que confíe en él).  Y quien tenga una\r\npesadilla:\r\n\r\n1.  Que sople sobre su izquierda tres veces. \r\n\r\n2.  Que se refugie en Allah del Sheitan y de lo malo que\r\nhaya visto, tres veces. \r\n\r\n3.  No contarselo a nadie. \r\n4.  Cambiar el lado sobre el que dormía. ",
  "RepeatNumber": 3,
  "Tabweeb": "Los sueños placenteros y pesadillas"
 },
 {
  "ZekarID": 117,
  "ZekarText": "Allahumma ihdinii fiimán hadeita wa 'aafinii fiimán\r\n'aafeita wa tawállani fiimán tawallaita, wa baarik lii fiimaa\r\na'Teita, waqinii sherra maa qaDéita, faínnaka táqdii wa laa\r\niúqDaa 'aleika, ínnahu laa íadhillu man waaleita, [wa laaa\r\nia'izhzhu man 'aadeita], tabaarakta rabbanaa wa ta'aaleita.\r\n\r\n116-  Oh Señor guíame con aquellos que has guiado, ab-\r\nsuélveme junto con los que Has perdonado, y bendice lo\r\nque me has concedido, protégeme del mal que has decre-\r\ntado, porque ciertamente Tú decretas y nadie decreta para\r\nTi, por cierto nunca será humillado a quien le muestres fi-\r\ndelidadl",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica Al-Qunút'"
 },
 {
  "ZekarID": 118,
  "ZekarText": "Allahumma innii a'udhu bi rriDaaka min saJáTik, wa\r\nbimu'aafáatika min 'uquubátika, wa a'udhu bika minka, laa\r\nujSii zanaa.an 'aleika, Anta kamaa azneita 'alaa nafsika.\r\n\r\n117.  Oh Señor, me refugio en tu complacencia de tu enojo,\r\ny en tu perdón de tu castigo y me refugio en Ti de Ti, no\r\npuedo enumerar tus alabanzas, Tú eres tal como te Has\r\nalabado a ti mismo.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica Al-Qunút'"
 },
 {
  "ZekarID": 119,
  "ZekarText": "Allahumma íáaaka na'budu, wa laka nuSallii wa násyu-\r\ndu, wa ileika nas'aaa wa nájfidu, naryuu rájmataka, wa na-\r\nJshaa 'adhaabaka, inna 'adhaabaka bilkaafiriina múljaqun.\r\nAllahumma innaa nasta'íinuka, wa nastagfíruka, wa nuznii\r\n'aleika alJeira, wa laa nakfúruka, wa núminu bika, wa na-\r\nJDa'u laka wa naJla'u man iakfúruka.\r\n\r\n118-  Oh Señor a Ti te adoramos, y para ti son nuestras\r\noraciones, y prosternaciones. Hacia a Ti nos apresuramos, y\r\na Ti servimos, esperamos tu misericordia y tememos tu cas-\r\ntigo, que ciertamente caerá sobre los incrédulos. Oh Señor\r\nbuscamos Tu auxilio y Tu perdón, agradecemos tus gracias\r\ny no descreemos de Ti, creemos en Ti y a Ti nos somete-\r\n\r\nmos, y rechazamos a quien Te niegue. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica Al-Qunút'"
 },
 {
  "ZekarID": 120,
  "ZekarText": "Subbjaanal málikil qudduusi (3 veces)\r\n\r\n\r\nRabil maláaíkati wa Ruuji.\r\n119-  Solía el mensajero de Allah (la paz y las bendiciones de Allah\r\nsean con él) recitar en la oracion del witr  Glorifica el nombre\r\nde Tu Señor, el Altísimo  Sura Altísimo 87, y  Di: Oh\r\nInfieles  Sura Los infieles 109, y  Di: El es Allah único  Sura\r\nLa fe pura 112, Y al terminar su oración y dice: Glorificado\r\nsea el Rey, el Santísimo (tres veces), diciendo la tercera en\r\nvoz alga y agregando: Señor de los ángeles y el ángel Ga-\r\nbriel. ",
  "RepeatNumber": 3,
  "Tabweeb": "Súplica luego de la salutación de la ora-\r\nción impar (witr)"
 },
 {
  "ZekarID": 121,
  "ZekarText": "Allahumma innii 'ábduka ibn 'ábduka ibn amátika naa-\r\nSiatii biiádika, máaDin fíia júkmuka, 'adlun fia qaDaá.uka\r\nasáluka bikulli ísmin húa laka sammáita bihi náfsaka au\r\nanzháltahu fii kitáabika, au 'allámtahu ájadan min Jálqika au\r\nista.ázarta bihi fii 'ilmil gaibi 'índaka an tay'alal quraana ra-\r\nbii'a qalbii, wa nuura Sadrii wa yalaá.a juzhnii wa dhahaaba\r\nhammii.\r\n\r\n120-  Oh Señor soy Tu siervo, hijo de Tu siervo y Tu sierva,\r\nmi completo dominio está en tus manos, tus órdenes he\r\ntratado de llevarlas a cabo, tu decreto sobre mi es justo, te\r\nsuplico por todos tus nombres con los cuales te has llamado\r\na Ti mismo, o lo hayas revelado en tu libro, o lo hayas ense-\r\nñado a alguien de tu creación, o lo hayas preservado en tu\r\nconocimiento oculto, que conviertas al Corán en lo que re-\r\nvive mi corazón, la luz de mi pecho, que da final a mi triste-\r\nza y alivia mis preocupaciones. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas ante la tristeza y la preocupación"
 },
 {
  "ZekarID": 122,
  "ZekarText": "Allahumma innii a'udhu bika minal hammi wal juzhni,\r\nwal 'ayzhi wal kásali wal buJlí wal yubni, wa Dal'i addaini wa\r\ngálabati ariyaali.\r\n\r\n121-  Oh Señor me refugio en Ti de las preocupaciones y las\r\ntristezas, de la debilidad y la vagancia, de la avaricia y la co-\r\nbardía, del peso de las deudas y de ser dominado por los\r\nhombres. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas ante la tristeza y la preocupación"
 },
 {
  "ZekarID": 123,
  "ZekarText": "Laa ilaaha illa Allahul 'aDhiimul jalíímu, laa ilaaha illa\r\nAllahu rabbul 'arshil 'aDhiimi, laa ilaaha illa Allah rabbus\r\nsamawaati wal arDi wa rabbul 'arshil karíími.\r\n\r\n122-  No hay divinidad salvo Allah, el Grandioso, el Toleran-\r\nte, no hay dios salvo Allah Señor del trono magnífico, No\r\nhay dios salvo Allah Señor de los cielos y de la tierra y Señor\r\ndel trono, el Generoso. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas para los momentos de aflicción"
 },
 {
  "ZekarID": 124,
  "ZekarText": "Allahumma rájmataka aryuu falaá takilnii ilaa nafsii\r\nTárfata 'áinin wa aSlij lii sha.anii kállahu, laa ilaaha illaa An-\r\nta.\r\n\r\n123-  Oh Señor, anhelo tu misericordia, no me abandones\r\nni por un instante, y facilita mis asuntos, no hay dios sino\r\nTú. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas para los momentos de aflicción"
 },
 {
  "ZekarID": 125,
  "ZekarText": "Laa ilaaha illa Anta subjáanaka innii kuntu minal Dhaa-\r\nlimíína.\r\n\r\n124-  No hay divinidad sino Tú, glorificado Seas, por cierto\r\nme encontraba entre los injustos. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas para los momentos de aflicción"
 },
 {
  "ZekarID": 126,
  "ZekarText": "Allahu Allahu rabbi laa úshriku bihi shei.an.\r\n\r\n125-  Allah, Allah mi Señor no le asocio nada. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplicas para los momentos de aflicción"
 },
 {
  "ZekarID": 127,
  "ZekarText": "Allahumma innaa nay'áluka fii nujúrihim wa na'uudhu\r\nbika min shurúurihim.\r\n\r\n126-  Oh Señor, Te enfrentamos a ellos y nos refugiamos\r\nen Ti de su maldad. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica ante la agresión del enemigo o de\r\naquellos que poseen autoridad"
 },
 {
  "ZekarID": 128,
  "ZekarText": "Allahumma Anta 'áDudii, wa Anta naSiirii bika áyuulu\r\nwa bika aSuulu wa bika uqáatilu.\r\n\r\n127-  Oh Allah Tu eres mi apoyo y mi socorro, por Ti inicio\r\nmi camino, por Ti he de luchar y esforzarme. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica ante la agresión del enemigo o de\r\naquellos que poseen autoridad"
 },
 {
  "ZekarID": 129,
  "ZekarText": "Jasbunaa Allahu wa ni'mal wakiil\r\n\r\n128-  Allah nos es suficiente y que Excelente Custodio. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica ante la agresión del enemigo o de\r\naquellos que poseen autoridad"
 },
 {
  "ZekarID": 132,
  "ZekarText": "Allahumma múnzhilal kitaabi sarii'ul jisaabi íhzhimal\r\najzhaaba Allahumma ihzhímhum wa zhalzhilhum.\r\n\r\n131-  Oh Allah, quien ha descendido el libro (El Corán),\r\nquien es rápido en ajustar las cuentas, vence a los enemi-\r\ngos, oh Señor derrótalos y estremécelos. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica contra los enemigos"
 },
 {
  "ZekarID": 135,
  "ZekarText": "Allahumma akfiniihim bimaa shi-ta.\r\n\r\n132-  Oh Allah protégeme de ellos con lo que Tú quieras. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica cuando se teme a alguien"
 },
 {
  "ZekarID": 137,
  "ZekarText": "A) Que busque refugio en Allah.\r\n\r\nB) Que renuncie a lo le causa duda.",
  "RepeatNumber": 1,
  "Tabweeb": "La súplica de quien es afligido con dudas\r\nen la fe"
 },
 {
  "ZekarID": 139,
  "ZekarText": "Aamantu billahi wa rasúulihi.\r\n134- Que diga:  Creo en Allah y en su mensajero. ",
  "RepeatNumber": 1,
  "Tabweeb": "La súplica de quien es afligido con dudas\r\nen la fe"
 },
 {
  "ZekarID": 140,
  "ZekarText": " Húaal awuualu, wal áaJiru, wa Dhaahiru wal baaTinu\r\nwa húa bikulli shei.in 'alíímu \r\n135- Que recíte:  Él es el Primero, el último, el Manifiesto y\r\nel Oculto, y todo lo sabe . [57:3].",
  "RepeatNumber": 1,
  "Tabweeb": "La súplica de quien es afligido con dudas\r\nen la fe"
 },
 {
  "ZekarID": 141,
  "ZekarText": "Allahumma akfínii bijaláalika 'an jaráamika wa agninii\r\nbifaDlika 'amman siwaaka.\r\n\r\n136-  Oh Señor has que me sea suficiente lo que concediste\r\nlícito aleja para que no necesite lo que has prohibido, y en-\r\nriquéceme con tu favor para que no tenga necesidad de\r\notros. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para saldar las deudas"
 },
 {
  "ZekarID": 142,
  "ZekarText": "Allahumma innii a'udhu bika minal hammi wal juzhni,\r\nwal 'ayzhi, wal kásali wal buJli wal yubni, wa Dal'i addaini\r\nwa gálabati aríyaali.\r\n\r\n137-  Oh Señor me refugio en Ti de las preocupaciones y\r\ntristezas, de la debilidad y la vagancia, de la avaricia y la co-\r\nbardía, del peso de las deudas y de ser dominado por los\r\nhombres. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para saldar las deudas"
 },
 {
  "ZekarID": 144,
  "ZekarText": "Allahumma laa sahla illa maa ya'altahu sahlaan wa An-\r\nta taya'alul jazhna idhaa shí.ta salan.\r\n\r\n131-  Oh Señor no hay facilidad sino lo que has hecho fácil,\r\ny tu facilitas lo difícil si así lo deseas. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica ante las dificultades"
 },
 {
  "ZekarID": 149,
  "ZekarText": "Qaddara Allahu maa sha-a fa'ala.\r\n\r\n144-  El creyente fuerte es mejor y más amado por Allah\r\nque el creyente débil, aunque en los dos hay bien.  Esfor-\r\nzáos en lo que os beneficiará, buscad ayuda de Allah y no\r\ndesesperéis, si les sucediera una desgracia entonces no di-\r\ngais si hubiera hecho tal y tal cosa,...habría ocurrido sino\r\nmás bien decid: Qaddara Allahu maa sha-a fa'ala  Así lo de-\r\ncretó Allah y Él hace lo que desea. , porque ciertamente las\r\npalabras  si hubiera hecho esto o aquello... le abre las puer-\r\ntas a Sheitan. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica ante una desgracia"
 },
 {
  "ZekarID": 151,
  "ZekarText": " A'uudhukuma bi kalimaati Allahi taammati min kulli\r\nsheitaani wa haammati wa min kulli 'ainin laammatin. \r\n\r\n146- De Ibn Abbas (Allah se complazca de él) dijo: Solía el Men-\r\nsajero de Allah (la paz y las bendiciones de Allah sean con él) enco-\r\nmendar la protección de Allah (a sus nietos) Al-Hasan (Allah\r\nse complazca de él) y Al-Hussein (Allah se complazca de él) diciendo:\r\n Los encomiendo bajo la protección de las perfectas pala-\r\nbras de Allah de todo demonio, o creatura, y de la envidia\r\n(o mal de ojo). ",
  "RepeatNumber": 1,
  "Tabweeb": "Cómo encomendar a los niños a la protec-\r\nción de Allah\r\n؟؟؟؟؟"
 },
 {
  "ZekarID": 152,
  "ZekarText": " La ba.as Tahuur in sha Allah \r\n\r\n147- Solía el Mensajero de Allah (la paz y las bendiciones de Allah\r\nsean con él) al visitar a un enfermo decir:  No es nada, será\r\nuna expiación y purificación si Allah quiere. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al visitar un enfermo"
 },
 {
  "ZekarID": 153,
  "ZekarText": " As.alu Allaha al'aDhima Rabbal arshil 'aDhiimi an iash-\r\nfiika \r\n\r\n148- Si un siervo musulmán visita a un enfermo, cuyo final\r\nno ha sido decretado todavía, y recitace siete veces:  Le\r\nruego a Allah el Grandíoso, Señor del trono grandioso que\r\nte devuelva la salud. ",
  "RepeatNumber": 7,
  "Tabweeb": "Súplica al visitar un enfermo"
 },
 {
  "ZekarID": 155,
  "ZekarText": " Allahumma agfirlii war ar jamnii wal jiqnii bi rafiqil\r\na'alaa. \r\n\r\n150-  Señor perdóname, ten misericordia de mí y reúneme\r\ncon los compañeros más elevados. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica del enfermo"
 },
 {
  "ZekarID": 156,
  "ZekarText": " Laa ilaha illa Allahu inna lilmauti lasakaraat \r\n\r\n151- Relató ’Aisha (Allah se complazca de ella) que el Profeta (la\r\npaz y las bendiciones de Allah sean con él) (durante su última en-\r\nfermedad) solia sumergir sus manos en el agua, y pasándo-\r\nlas sobre su rostro diciendo:  No hay dios sino Allah, por\r\ncierto que la muerte es un sufrimiento (agonía). ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica del enfermo"
 },
 {
  "ZekarID": 157,
  "ZekarText": " Laa ilaha illa Allahu wa Allahu akbaru, laa ilaha illa Al-\r\n\r\nLahu wajdahu, laa ilaha illa Allahu wajdahu laa sheriika lahu,\r\nlaa ilaha illa Allahu lahul mulku wa lahul jamdu laa ilaha illa\r\nAllahu wa laa jaula wa laa qúwwata illaa bilAllah \r\n152-  No hay divinidad salvo Allah y Allah es el más grande,\r\nno existe dios sino Allah único, no hay divinidad excepto\r\nAllah único sin asociados, no existe dios sino Allah, Suyo es\r\nel reino y suya es la alabanza, no existe dios sino Allah y no\r\nhay fuerza ni poder salvo en Allah. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica del enfermo"
 },
 {
  "ZekarID": 158,
  "ZekarText": "Laa ilaaha illa Allah.\r\n153-  No hay dios salvo Allah. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al asustarse\r\n؟؟؟؟؟"
 },
 {
  "ZekarID": 159,
  "ZekarText": " Inna lilAllahi wa innaa ilaihi raayi'uuna  Allahummaa-\r\nyurnii fii muSiibatii waJluf lii Jairan minhaa \r\n\r\n154-  Ciertamente a Allah pertenecemos, y a El será el re-\r\ntorno. \r\n\r\n Oh Señor recompénsame en esta aflicción, y reemplázala\r\npor algo mejor que ella. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para quien sufre una desgracia o la\r\nperdida de un ser querido\r\n؟؟؟؟؟؟"
 },
 {
  "ZekarID": 160,
  "ZekarText": " Allahumma agfir li (fulano) warfa’ darayatahu fiil\r\nmahdiiina waJlufhu fii 'aqibihi fiil gaabíriina wagfir lanaa wa\r\nLahu iaa Rabbal 'aalamiina wafsaj lahu fii qabrihi wa nawwir\r\nLahu fiihi \r\n\r\n155-  Oh Allah perdona a fulano (el nombre del difunto) y\r\neleva su rango entre los bien guiados, y has que alguien\r\nasuma la responsabilidad de quien ha dejado detrás (e.d. su\r\nfamilia), perdónale y a nosotros Señor de los mundos, y Has\r\nsu tumba amplia y luminosa. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al cerrar los ojos de un difunto"
 },
 {
  "ZekarID": 161,
  "ZekarText": " Allahumma agfir lahu war jamahu, wa 'aafihi, wa'afu\r\n'anhu wakrim nuzhulahu wa wassi’ mudJalahu, wagsilhu bil\r\nmaa.i waz zalyi wal baradi, naqqihi minal JaTFaaiaa kamaa\r\nnaqqaita zauba al ábiaD mina addnasi, abdílhu dáaran Jei-\r\nran min dáarihi wa ahlan Jeiran min ahlihi wa zhauyan Jei-\r\nran min zhauyihi, wa adJilhul yannata, wa a'idhhu min 'ad-\r\nhaabil qabri wa 'adhaabin naar.\r\n\r\n156- Señor nuestro, perdónale y tenle misericordia, exime-\r\nlo, absuélvelo, y otórgale un lugar honorable, amplía su en-\r\ntrada (al Paraíso) y lávale con agua, nieve e granizo,\r\npurificándolo de sus pecados, como se purifica la vestimen-\r\nta blanca de las impurezas, cámbiale su morada por una\r\nmorada mejor, y su família por una familia mejor, y su es-\r\nposa por una esposa mejor, introdúcelo en el Paraíso y pro-\r\ntégelo de las tribulaciones de la tumba y del tormento del\r\nfuego.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por el difunto durante la oración\r\nfúnebre"
 },
 {
  "ZekarID": 162,
  "ZekarText": "Allahumma agfir lijeiinaa wa meitiinaa wa sháahidinaa,\r\nwa gaa.íbinaa, wa Saguírinaa wa kabíirinaa, wa dhákarina\r\nwa unzáanaa. Allahumma man aj-iáitahu minnaa fa.aj-íihi\r\n'alaal Islaami wa man tawaffáitahu minnaa fatawwáfahu\r\n'alaal Iiimaani, Allahumma laa tajrímnaa áyrahu wa laa tu-\r\nDillanaa bá'dahu.\r\n\r\n157- Oh Dios mío perdona a nuestros vivos y a nuestros\r\nmuertos, a los que están presentes y ausentes, a nuestros\r\nniños y ancianos, a los hombres y a las mujeres. Oh Dios\r\nmío, a quien des vida que viva en el Islam, y a quien des la\r\nmuerte que muera en la Fe, Señor no nos prives de la re-\r\ncompensa de la Fe y no nos desvíes luego de habernos\r\nguiados.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por el difunto durante la oración\r\nfúnebre"
 },
 {
  "ZekarID": 163,
  "ZekarText": "Allahumma inna fulaana ibnu fulaani fii dhimmática,\r\nwa jabli yawáarika, fáqihi min fitnatil qabri wa 'adhaabin\r\nnaari, wa Anta ahlul uafaa.i wal jaqqi fagfir lahu war jamhu\r\ninnaka Antl gafuurur rajiimu.\r\n\r\n158- Oh Dios mío ciertamente fulano hijo de fulano esta’ ba-\r\njo tu cuidado y protección, protégelo de las tribulaciones de\r\nla tumba y del tormento del fuego del infierno, Tú eres leal\r\n(a tu promesa) y verdadero. Así que perdónale y ten miseri-\r\ncordia de él. Ciertamente eres el Perdonador, Misericordio-\r\nso.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por el difunto durante la oración\r\nfúnebre"
 },
 {
  "ZekarID": 164,
  "ZekarText": "Allahumma a'bduka wa ibnu amátika ajtaaya ilaa ra-\r\njmátíka, wa Anta ganííun 'an adhaabíhí, in kaana mújsinan\r\nfa zhiid fii jasanátihi, wa in kaana musíi.an fatayaawazh\r\n'anhu.\r\n\r\n159- Oh Señor mío era tu siervo hijo de tu sierva, está ne-\r\ncesitado de tu misericordia, y Tú no necesitas castigarlo, si\r\nera recto entonces aumenta su recompensa (Hasanat) y si\r\ncometía pecados absuélvelo.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por el difunto durante la oración\r\nfúnebre"
 },
 {
  "ZekarID": 165,
  "ZekarText": "Allahumma iya'alhu faraTan wa dhuJran liwaalideihi,\r\nwa shafii'an muyaaban. Allahumma záqqil bihi mawazhíii-\r\nnahumaa wa a'Dhim bihi uyúurahumaa, wa áljíqhú biSaalijil\r\nmu.miníína way 'alhu fii kafaalati Ibraahííma wáqihi birra-\r\njmáatika 'adhaabal yajíími.\r\n\r\n160- Luego de pedir perdón por el fallecido se dice: Oh\r\nAllah hazle un adelanto y un tesoro para sus padres y un in-\r\ntercesor aceptado. Oh Allah, por su causa has valiosa la ba-\r\nlanza (de sus padres) y magnifica su recompensa. Reúnelo\r\njunto a tus siervos virtuosos, piadosos. Sitúale bajo la pro-\r\ntección de Ibrahim (la paz sea con él), y protégelo con tu mise-\r\nricordia del fuego del infierno.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para que se apresure la recom-\r\npensa al difunto\r\n؟؟؟؟"
 },
 {
  "ZekarID": 166,
  "ZekarText": "Allahumma iy'alhu lanaa faraTan, wa sálafa wa ayran.\r\n\r\n161- Solía al-Hasan leerle al niño (fallecido) sura al-Fatiha y\r\nluego decir:  Oh Allah hazle un adelanto y un tesoro antici-\r\npado y una recompensa para nosotros .",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para que se apresure la recom-\r\npensa al difunto\r\n؟؟؟؟"
 },
 {
  "ZekarID": 167,
  "ZekarText": "Inna lillahi maa áJadháa, wa lahu maa a'Taa wa kullu\r\nshei.in 'índahú biáyalín musammaa... faltáSbir wal tajtásib.\r\n\r\ná'Dhama Allahu áyraka wa ajsana 'azhaa.áka wa gáfara\r\nlimeiitáka.\r\n\r\n\r\n162- Ciertamente a Allah le pertenece lo que ha tomado y\r\nha concedido. A todo le ha dado un tiempo determinado.\r\nAsí que sé paciente y espera la recompensa de Allah.\r\n\r\nY si dice: Que Allah magnifique tu recompensa, y haga lle-\r\nvadero tu dolor, y perdone a vuestro difunto.",
  "RepeatNumber": 1,
  "Tabweeb": "Las condolencias"
 },
 {
  "ZekarID": 168,
  "ZekarText": "Bismillah wa 'alaa sunnati rassuulillah.\r\n\r\n163- En el nombre de Allah y acorde con la Sunnah del\r\nMensajero de Allah.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al depositar al muerto en la tumba\r\n؟؟؟؟؟"
 },
 {
  "ZekarID": 169,
  "ZekarText": "Solía el Profeta (la paz y las bendiciones de Allah sean con él) al\r\nfinalizar el entierro decir ante la tumba: Pedid perdón por\r\nvuestro hermano y rogad que permanezca firme, porque\r\nahora está siendo preguntado.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego del entierro"
 },
 {
  "ZekarID": 170,
  "ZekarText": "Assalamu 'aleikum ahla addiiaara min al mu.miníína\r\nwal muslimíína wa innaa in shaa.a Allah bikum laajiquuna\r\nnas.álu Allaha lanaa wa lakumul 'áafiiata.\r\n\r\n165-  Que la paz sea con vosotros oh habitantes de las\r\ntumbas, creyentes y musulmanes, si Allah quiere hemos de\r\nreunirnos con vosotros, pedimos a Allah el bienestar para\r\nnosotros y vosotros. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al visitar una tumbas"
 },
 {
  "ZekarID": 171,
  "ZekarText": "Allahumma innii as.áluka Jéiraha wa a'udhu bika min\r\nshérriha.\r\n\r\n166-  Oh Señor ciertamente Te suplico el bien que hay en\r\nella, y me refugio en Ti de su mal. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica ante una tormenta de viento"
 },
 {
  "ZekarID": 172,
  "ZekarText": "Allahumma innii as.áluka Jéiraha wa Jéira maa fiiha, wa\r\nJeira maa úrsilat bihi wa a'udhu bika min shérriha, wa sherri\r\nmaa fiiha wa sherri maa úrsilat bihi.\r\n\r\n167-  Oh Señor ciertamente Te suplico su bien, el bien que\r\nhay en ella y el bien con que ella ha sido enviada, y me re-\r\nfugio en Ti de su mal, del mal que hay en ella, y del mal que\r\nlleva consigo. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica ante una tormenta de viento"
 },
 {
  "ZekarID": 173,
  "ZekarText": "Subjáana\talladhíí iusábbiju\tarra'du\tbijámdihi wal\r\nmaláa.íkatu min Jíífatihi.\r\n\r\n168- Solía Abdullah Ibn Az-zubair (Allah se complazca de él) al\r\nescuchar un trueno abandonar lo que estaba diciendo y de-\r\ncir:  Glorificado sea a quien glorifíca y alaba el trueno, así\r\ncomo lo hacen los ángeles atemorizados. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al escuchar un trueno"
 },
 {
  "ZekarID": 174,
  "ZekarText": "Allahumma\tasqínaa\tgueizan\tmuguizan\tmaríí.an\r\nmuríí'an, nááfi'an gueira Dáárrin, 'ááyilan gueira ááyilin.\r\n\r\n169-  Oh Señor envianos una lluvia beneficiosa, saludable,\r\nbuena, que no nos perjudique, ahora ni después. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para pedir lluvia"
 },
 {
  "ZekarID": 175,
  "ZekarText": "Allahumma aguíznaa, Allahumma aguiznaa, Alla-\r\nhumma aguíznaa.\r\n\r\n170-  Oh Allah alívianos con ésta lluvia, oh Allah alívianos\r\ncon ésta lluvia, oh Allah alívianos con ésta lluvia. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para pedir lluvia"
 },
 {
  "ZekarID": 176,
  "ZekarText": "Allahumma asqi 'ibáadaka wa baháa.íimaka, wa ánshur\r\nramátaka wa ajiii báladakal meeita.\r\n\r\n163-  Oh Allah has llover sobre Tus siervos, Tus ganados,\r\nextiende Tu misericordia y revive la tierra cuando se se-\r\nqueT .",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para pedir lluvia"
 },
 {
  "ZekarID": 177,
  "ZekarText": "Allahumma Saiííban nááfi'an.\r\n\r\n172-  Oh Señor que sea una nube con lluvia que traiga be-\r\nneficio. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al comenzar la lluvia"
 },
 {
  "ZekarID": 178,
  "ZekarText": "MuTirnaa bifaDli Allahi wa rajmátihi.\r\n\r\n173-  Ha llovido por la gracia y misericordia de Allah. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego de la lluvia"
 },
 {
  "ZekarID": 179,
  "ZekarText": "Allahumma jawaaleina wa laa 'aleinaa Allahumma\r\n'alaal áákaami wa DhDhiraabi, wa buTuunil audíiati, wa\r\nmanáabíti ashsháyari.\r\n\r\n174- Oh Allah has que (la lluvia) caiga alrrededor benefi-\r\nciándonos y no perjudicándonos, Oh Señor que llueva sobre\r\nlas pasturas, colinas, valles y las raíces de los árboles. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para que se detenga la lluvia"
 },
 {
  "ZekarID": 180,
  "ZekarText": "Allahu ákbar, Allahumma ahíllahu 'aleinaa bil amní, wal\r\nimááni, was salami wal islaami, wat taufiiqi limaa tujibbu\r\nwa tarDaa rábbunaa wa rábbuka Allah.\r\n\r\n175-  Allah es el mas grande, Oh Señor has que esta luna\r\naparezca y estemos seguros, con fe, paz e Islam Concéde-\r\nnos realizarlo que amas y te complace, nuestro Señor. Por\r\ncierto que tu Señor (dirigiéndose a la luna) es Allah. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al observar la luna creciente"
 },
 {
  "ZekarID": 181,
  "ZekarText": "Dháhaba aDhamaa.u, wa abtállatil 'uruuqu, wa zábatal\r\nayru in sha.a Allahu.\r\n\r\n176-  La sed ha desaparecido y las venas han quedado sa-\r\nciadas, y será aceptada la recompensa si Allah quiere. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al cortar el ayuno"
 },
 {
  "ZekarID": 182,
  "ZekarText": "Allahumma ínnii as.áluka birajmátika allatíí wási'at\r\nkulla shei.in an tágfira lii.\r\n\r\n177- 'Abdullah ibn 'Amru ibn Al-'Aas (Allah se complazca de él)\r\ndijo: Dijo el Mensajero de Allah (la paz y las bendiciones de Allah\r\nsean con él):  Ciertamente el ayunante tiene al momento de\r\nromper el ayuno una súplica que no es rechazada. Dijo Ibn\r\nAbi Mulaikah: Escuche decir a 'Abdallah Ibn 'Omar (Allah se\r\ncomplazca de él), cuando rompía su ayuno:  Oh Señor, te su-\r\nplico Tu misericordia que todo lo envuelve, que me perdo-\r\nnes. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al cortar el ayuno"
 },
 {
  "ZekarID": 183,
  "ZekarText": "Bismillahi. Bismillahi fii awwuálihi wa aaJírihi.\r\n\r\n178-  Decid antes de comer:  En el nombre de Allah  Pero\r\nsi olvidáis decirlo, decid (al recordarlo)  En el nombre de\r\nAllah en su comienzo y final. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica antes de comer"
 },
 {
  "ZekarID": 184,
  "ZekarText": "Allahumma baarik lanaa fiihi wa aT-'imnaa Jeiran min-\r\nhu.\r\n\r\nAllahumma baarik lanaa fiihi wa zhidnaa minhu.\r\n\r\n179-  Quien sea alimentado por Allah que diga: Oh Señor\r\nbendice (ésta comida) para nosotros y aliméntanos con al-\r\ngo mejor (en un futuro), y a quien Allah le de beber leche\r\nque diga, Oh Señor bendice esto para nosotros y provéenos\r\nmás de ella. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica antes de comer"
 },
 {
  "ZekarID": 185,
  "ZekarText": "Aljámdulillahi alladhíí aT'amaníí haadhaa wa\traz-\r\nhaqaniihi min gueira jaulin minníí wa laa qúwatin.\r\n\r\n180-  La alabanza es para Allah, que me ha alimentado y\r\nme ha sustentado con ello sin ninguna fuerza ni poder de\r\nmi parte. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al terminar de comer"
 },
 {
  "ZekarID": 186,
  "ZekarText": "Aljámdulillahi jamdan kaziiran Taiiban mubárikan fiihi\r\ngueira mákfii wa laa muwadda'in wa laa mustagnaa 'anhu\r\nrabbunaa.\r\n\r\n181-  La alabanza es para Allah muchas alabanzas buenas y\r\nbendita, que no cesa, ni tiene final y que es indispensable\r\n(para nosotros) Nuestro Señor. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al terminar de comer"
 },
 {
  "ZekarID": 187,
  "ZekarText": "Allahumma baarik lahum fiimaa razhaqtahum, wagfir\r\nlahum war jamhum.\r\n\r\n182-  Oh Señor, bendice lo que les ha concedido, perdóna-\r\nlos y ten misericordia de ellos. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por quien invita a comer"
 },
 {
  "ZekarID": 188,
  "ZekarText": "Allahumma aT-'im man aT-'amanii wa asqi man saqaa-\r\nnii.\r\n\r\n183-  Oh Allah, alimenta a quien me dio de comer y de be-\r\nber a quien me dio de beber. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por quien da de beber"
 },
 {
  "ZekarID": 189,
  "ZekarText": "AfTara 'índakum aSSaa.ímuuna wa ákala T'aámakumul\r\nabrááru,wa Sallat 'aleikumul mala.íkatu.\r\n\r\n184-  Han desayunado con vosotros los ayunantes y han\r\ncomido vuestro alimento los piadosos y han orado por vo-\r\nsotros los ángeles. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica de aquel que es invitado para des-\r\nayunar"
 },
 {
  "ZekarID": 190,
  "ZekarText": " Si alguno de vosotros ha sido invitado que responda\r\n(a la invitación) pero si está ayunando que ruegue (por el\r\nanfitrión) y si no estuviera ayunando, entonces que coma. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica del ayunante cuando se presentan\r\nlos alimentos y aún no ha desayunado"
 },
 {
  "ZekarID": 191,
  "ZekarText": "In-nii Saa.imun, in-nii Saa.imun.\r\n\r\n186-  Por cierto estoy ayunando, por cierto estoy ayunan-\r\nDo ",
  "RepeatNumber": 1,
  "Tabweeb": "Qué responde el ayunante si es insultado"
 },
 {
  "ZekarID": 192,
  "ZekarText": "Allahumma baarik lanaa fii zámarinaa wa baarik lanaa\r\nfii medinátinaa wa baarik lanaa fii Sáá'inaa wa baarik lanaa\r\nfii múddinaa.\r\n\r\n187-  Oh Señor bendice nuestros frutos, nuestra ciudad,\r\nbendice nuestro producción. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al ver madurar los frutos"
 },
 {
  "ZekarID": 193,
  "ZekarText": "Aljámdulillahi.\r\nIarjámuka Allahu.\r\n Iahdííkumu Allahu wa iuSliju báálakum.\r\n\r\n188-  Si estornudáis decid: La Alabanza es para Allah, y de-\r\nbe responderle su hermano o compañero: Que Allah tenga\r\nmisericordia de ti, y si así dice que diga: (quien ha estornu-\r\ndado) que Allah te guíe y te rectifique. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al estornudar"
 },
 {
  "ZekarID": 194,
  "ZekarText": "Iahdííkumu Allahu wa iúSliju báálakum.\r\n189-  Que Allah te guíe y te rectifique. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por un no musulmán que estor-\r\nnuda"
 },
 {
  "ZekarID": 195,
  "ZekarText": "Bááraka Allahu laka, wa bááraka Allahu 'aleika, wa ya-\r\nma'a beinákumaa fii Jeirin.\r\n\r\n190-  Que la bendición de Allah sea contigo (ed: al novio o\r\na la novia) que Allah te bendiga y los una en el bien. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por los recién casados"
 },
 {
  "ZekarID": 196,
  "ZekarText": "Allahumma innii as.áluka Jéirahaa wa Jeira maa yabál-\r\ntaha 'aleihi wa a'udhu bika min shérrihaa wa sherri maa\r\nyabáltahaa 'aleihi.\r\n\r\n191-  Quienquiera se despose que diga: Oh Allah cierta-\r\nmente Te solicito el bien que hay en ella, y el bien de sus\r\ninclinaciones naturales, y me refugio en Ti del mal que hay\r\nen ella y el mal de sus inclinaciones. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al contraer matrimonio"
 },
 {
  "ZekarID": 197,
  "ZekarText": "Bismillahi Allahumma yannibnaa a sheiTáána yánnibi a\r\nsheiTáána maa razháqtanaa.\r\n\r\n182-  En el nombre de Allah. Oh Señor protéjenos de Shei-\r\ntan, y aléjalo de cuanto nos provees (e.d. los hijos). ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica antes de iniciar la relacion sexual"
 },
 {
  "ZekarID": 198,
  "ZekarText": "A'udhu billahi min a sheiTááni arrayiimi.\r\n\r\n193-  Me refugio en Allah del maldito demonio. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica ante la ira"
 },
 {
  "ZekarID": 199,
  "ZekarText": "Aljámdulillahi alladhíí 'aafaanii minmaa abtálaka bihi\r\nwa faDDálanii 'alaa kaziirin minman Jalaqa tafDiilan.\r\n194-  Alabado sea Allah quien me ha preservado de aquello\r\ncon que te ha probado, y me ha favorecido sobre muchos\r\nde su creación. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al ver un discapacitado o una per-\r\nsona con problemas de salud\r\n؟؟؟؟؟"
 },
 {
  "ZekarID": 200,
  "ZekarText": "Rabbii agfir líí wátub 'aleiia ínnaka Anta ttawaabul ga-\r\nfuuru.\r\n\r\n195- Relató Ibn Omar: Contábamos que el Mensajero de\r\nAllah decía en cada reunion antes de levantarse:  Señor\r\nperdóname, y acepta mi arrepentimiento, ciertamente Tú\r\neres el Absolvedor, el Perdonador. ",
  "RepeatNumber": 100,
  "Tabweeb": "Súplica durante una reunión"
 },
 {
  "ZekarID": 201,
  "ZekarText": "Subjánaka Allahumma wa bijámdika ásh-hadu an laa\r\nilaaha illa Anta astágfiruka wa atub ileika.\r\n\r\n196-  Glorificado y alabado seas oh Allah. Atestiguo que no\r\nhay divinidad sino Tú, Te pido perdón y a Ti vuelvo arrepen-\r\ntído. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al finalizar una reunión"
 },
 {
  "ZekarID": 202,
  "ZekarText": "Gáfara Allahu laka.\r\n\r\nWa laka.\r\n\r\n197- Relató 'Abdullah Ibn Saryis (Allah se complazca de \r\nél): Fui\r\ndonde el Profeta (la paz y las bendiciones de Allah sean con él) y\r\ncomí con él, luego dije: Que Allah te perdone oh mensajero\r\nde Allah. Me respondió: Y a ti tambien. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por quien dice: \"Que Allah te per-\r\ndone\""
 },
 {
  "ZekarID": 203,
  "ZekarText": "Yazhaaka Allahu Jeiran.\r\n\r\n198-  Quien reciba un favor y diga:  O,ue Allah te recom-\r\npense con el bien, ha sido realmente agradecido. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por quien nos hace un favor"
 },
 {
  "ZekarID": 204,
  "ZekarText": " Quien memoríce las diez primeras aleyas de la sura La\r\nCaverna (al-Kahf) será protegido del mesías impostor o fal-\r\nso Mesías.  Así también se recomienda refugiarse en Allah\r\nde su sedíción luego de la segunda atestiguación.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para protegerse del Falso Mesías"
 },
 {
  "ZekarID": 205,
  "ZekarText": "Ajábbaaka alladhíí ajbábtanii lahu.\r\n200-  Que te ame aquel por quien me has amado. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por quien dice: \"Te amo por Allah\""
 },
 {
  "ZekarID": 206,
  "ZekarText": "Bááraka Allahu laka fii áhlika wa málica.\r\n\r\n201-  Que Allah bendiga tu familia y tus bienes. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por quien ofrece ayuda económica"
 },
 {
  "ZekarID": 207,
  "ZekarText": "Bááraka Allahu laka fii áhlika wa málica, ínnamaa yaz-\r\nhaa.us sálafi aljamdu wal adaa.u.\r\n\r\n202-  Que Allah bendiga tu familia y tus bienes, ciertamen-\r\nte la alabanza (a Allah) y el pago (de la deuda) son la re-\r\ncompensa por éste préstamo. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por el acreedor al momento de\r\nsaldar la deuda"
 },
 {
  "ZekarID": 208,
  "ZekarText": "Allahumma innii a'udhu bika an úshrika bika wa anaa\r\na'lamu wa astágfiruka limaa laa a'lamu.\r\n\r\n203-  Oh Allah ciertamente me refugio en Ti de asocíarte\r\nalgo (cometer politeismo) sabiendo, y te pido perdón por\r\naquello que no sé. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por temor a caer en la idolatría"
 },
 {
  "ZekarID": 209,
  "ZekarText": "Bááraka Allahu fiikum. Wa fiika bááraka Allah.\r\n\r\n204- 'Aisha (Allah se complazca de ella) dijo: le habían regalado\r\nal Mensajero de Allah (la paz y las bendiciones de Allah sean con él)\r\nun cordero. Y me dijo: anda repártelo. Entonces 'Aisha (Allah\r\nse complazca de ella) cada vez que volvía el sirviente (el encar-\r\ngado de repartir la carne) le preguntaba: ¿Qué dijeron? Di-\r\njeron:  Que Allah te bendiga. \r\n\r\nY ’Aisha (Allah se complazca de ella) respondía: Que Allah los\r\nbendiga.\r\n\r\nRespondemos de la misma manera (o mejor) de lo que nos\r\nhan dicho y de esta manera nos queda la recompense. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica por quien hace un regalo o da una\r\ncaridad"
 },
 {
  "ZekarID": 210,
  "ZekarText": "Allahumma laa Taira illa Táíruka wa laa Jeira illa Jéiruka\r\nwa laa ilaaha guéiruka.\r\n\r\n205-  Oh Allah no existen los augurios sino tu destino, y no\r\nhay bien salvo el que has predestinado. No hay divinidad\r\nsalvo Tú. ",
  "RepeatNumber": 1,
  "Tabweeb": "La prohibición de creer en la superstición"
 },
 {
  "ZekarID": 211,
  "ZekarText": "Bismillahi wal jámdulillahi, Subbjaana alladhíí sáJJara\r\nlanaa haadhaa wa maa kunnaa lahu muqriníína wa innaa\r\nilaa rábbinaa lamúnqalibuuna, al jámdulillahi, al jámduli-\r\nllahi, al jámdulillahi, Allahu ákbaru, Allahu ákbaru, Allahu\r\nákbaru Subjáanaka Allahumma innii Dhalamtu nafsíí fáágfir\r\nlíí faínnahu laa iágfiru adhdhuunuba illaa Anta.\r\n\r\n206- En el nombre de Allah, las alabanzas son para Allah,\r\nGlorificado Sea que nos facilitó esto que antes no poseía-\r\nmos. A nuestro Señor regresaremos, las alabanzas son para\r\nAllah, las alabanzas son para Allah, las alabanzas son para\r\nAllah. Allah es grande, Allah es grande, Allah es grande. Glo-\r\nríficado Seas Señor, ciertamente he sido injusto conmigo\r\nmismo, por eso perdóname, pues nadie perdona los peca-\r\ndos sino Tú.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al subir a un medio de transporte"
 },
 {
  "ZekarID": 212,
  "ZekarText": "Allahu ákbaru, Allahu ákbaru, Allahu ákbaru Subbjaana\r\nalladhíí sáJJara lanaa haadhaa wa maa kunnaa lahu mu-\r\nqriníína wa innaa ilaa rábbinaa lamúnqalibuuna, Allahumma\r\ninnaa nas.áluka fii sáfarinaa haadha al birra wa ttaquaa, wa\r\nminal 'amali maa tarDaa, Allahumma háwwin 'aleinaa sáfa-\r\nranaa haadhaa wa áTui 'annaa bu'dahu, Allahumma Anta\r\naSSáájibu fiis sáfari, wal Jalíífatu fiil ahli, Allahumma innii\r\n'audhu bika min wa'zaa.i assáfari, wa káábatil mánDharí, wa\r\nsuu.il munqálabi fiil maal wal ahli.\r\n\r\n207- Allah es grande, Allah es grande, Allah es grande. Ben-\r\ndito sea Allah que nos facilitó esto que antes no poseíamos,\r\ny a nuestro Señor regresaremos, Oh Allah, te rogamos que\r\nen este viaje realicemos lo que te complace. Dios mio, faci-\r\nlítanos el viaje y acorta sus distancias. Oh Allah, Tú eres mi\r\ncompañero en este viaje, y bajo tu protección dejé mi fami-\r\nlia. Dios mio, me refugio en Ti de todo lo malo que pueda\r\nencontrar en este viaje, y todo lo que pueda suceder con\r\nmis bienes y mi familia.\r\n\r\nAl regresar se repite lo mismo agregando:\r\n\r\nAaiibuuna taa.ibuuna 'aabiduuna li rabbinaa jaamiduuna.\r\n\r\nRegresamos adorándote, arrepentidos y agradeciendo a\r\nnuestro Señor.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al emprender un viaje"
 },
 {
  "ZekarID": 213,
  "ZekarText": "Allahumma rabbas samawaatis sab'i wa maa aDhlalna,\r\nwa rabal araaDeinas sab'i wa maa aqlalna, wa rabba\r\nashaiaaTiina wa maa aDhlalna wa rabba arriaaji wa maa\r\ndhareina. As.áluka Jeira háádhihil qáriati wa Jeira áhlihaa\r\nwa Jeira maa fiihaa, wa a'udhu bika min shérriha wa sherri\r\náhlihaa, wa sherri maa fiihaa.\r\n\r\n208- Oh Allah Señor de los cielos y cuanto cubren, y Señor\r\nde las siete tierras y cuanto contienen, Señor de los demo-\r\nnios y cuanto han desviado, Señor de los vientos y cuanto\r\ndispersan. Te pido el bien de este pueblo, de su gente y de\r\ntodo cuanto hay en él. Me refugio en Ti contra su maldad y\r\nla maldad de su gente y de todo cuanto hay en él.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al ingresar a una ciudad"
 },
 {
  "ZekarID": 214,
  "ZekarText": "Laa ilaaha illa Allahu wájdahu laa sheriika lahu, lahul\r\nmulku wa lahul jamdu iujii wa iumiitu wa hua jaiun laa ia-\r\nmuutu biiádihil Jeíru wa hua 'alaa kulli shei.in qadiirun.\r\n\r\n209-  No hay divinidad salvo Allah, único sin asociado, Suyo\r\nes el reino y Suya es la alabanza, Él da la vida y la muerte, Él\r\nes el Viviente que no muere, en sus manos está el bien y es\r\nsobre toda cosa Poderoso. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al ingresar al mercado"
 },
 {
  "ZekarID": 215,
  "ZekarText": "Bismillah\r\n\r\n210-  En el nombre de Allah. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al descomponerse el medio de transporte"
 },
 {
  "ZekarID": 216,
  "ZekarText": "Astaudi'akumu Allaha alladíí laa taDii'u wadaa.i'uhu.\r\n\r\n211-  Te encomiendo en Allah, quien no descuida lo que se\r\nle ha encomendado. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica del viajero por el residente"
 },
 {
  "ZekarID": 217,
  "ZekarText": "Astaudi'u Allaha díínaka wa amaanátaika wa Jawaatii-\r\nma 'amálika.\r\n\r\n212-  Que Allah resguarde tu religion (din), tus responsabi-\r\nlidades, y la conclusión de tus acciones (e.d. ruego que ten-\r\ngan un buen final). ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica del residente por el viajero"
 },
 {
  "ZekarID": 218,
  "ZekarText": "Zhawáádaka Allahut taquaa, wa gáfara dhánbaka wa\r\niássara lakal Jeira jéizumaa kunta.\r\n\r\n213-  Que Allah te conceda la piedad (taqwa), perdone tus\r\npecados, y te facilite el bien sea donde estés, donde quiera\r\nque te encuentres. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica del residente por el viajero"
 },
 {
  "ZekarID": 219,
  "ZekarText": "Relató Yabir (Allah se complazca de él) cuando subíamos\r\nsolíamos engrandecer a Allah (repitiendo: Allahu ákbar), y si\r\ndescendíamos glorifícabamos a Allah (diciendo Subjáana\r\nAllah). ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al ascender o descender por los\r\ncaminos"
 },
 {
  "ZekarID": 220,
  "ZekarText": "Sami'a saami'un bijamdillahi wa jusni baláá.ihi 'aleinaa.\r\nRábbana Saajíbnaa wa áfDil 'aleinaa 'aa.idháá billahi minan\r\nnaari.\r\n\r\n215-  Que alguien sea testigo de mi alabanza a Allah por\r\ncuanto nos ha favorecido, Señor nuestro protégenos, danos\r\nde tus favores, Me refugio en Allah del fuego infernal. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica del viajero al amanecer"
 },
 {
  "ZekarID": 221,
  "ZekarText": "A'udhu bikalimaatil-lahi attammaati min sherri maa\r\nJálaqa.\r\n\r\n216-  Me refugio en las palabras perfectas de Allah del mal\r\nque ha creado. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al entrar a una casa ajena"
 },
 {
  "ZekarID": 222,
  "ZekarText": "Laa ilaaha illa Allah uájdahu laa sheriika lahu, lahul\r\nmulku, ua lahul jamdu ua hua 'alaa kulli shei.in qadiir.\r\nAaiibuuna taa.ibuuna 'aabiduuna li rabbínaa jaamiduuna.\r\nSádaqa Allahu ua'dahu wa náSara 'abdahu wa házhama al-\r\najzhaaba uájdahu.\r\n\r\n217- Relató Ibn 'Omar (Allah se complazca de él) que el Mensa-\r\njero de Allah (la paz y las bendiciones de Allah sean con él) solía al\r\nretornar de una batalla o al regresar de peregrinar a la\r\nKa’abah si pasaba por un lugar elevado repetía: iAllah es el\r\nmas grande! (Allahuakbar) tres veces, y luego decía: No hay\r\ndios sino Allah, único, sin asociados, Suya es la soberanía y\r\nSuya es la alabanza, y es sobre toda cosa poderoso. Retor-\r\nnamos arrepentidos, adorando y alabando a nuestro Señor,\r\nha cumplido con su promesa, y le ha dado la victoria a su\r\nsiervo, y sólo ha derrotado a los  grupos aliados . ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al iniciar el regreso de un viaje"
 },
 {
  "ZekarID": 223,
  "ZekarText": "Aljamdulil-lahi alladhíí bini'mátihí tatimmuS Saalijaatu.\r\n\r\n218- El Mensajero de Allah (la paz y las bendiciones de Allah sean\r\ncon él) al recibir buenas noticias solía decir: Alabado sea\r\nAllah que por Su gracia se han hecho realidad esta maravi-\r\nlla. Y al recibir noticias desagradables solía decir:\r\n\r\nAljamdulillahi 'alaa kulli jaalin.\r\nAlabado sea Allah en toda circunstancial. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al recibir buenas noticias"
 },
 {
  "ZekarID": 224,
  "ZekarText": "DijO (la paz y las bendiciones de Allah sean con él):  Quien pida\r\nla paz sobre mí una vez, Allah ha de darle el saludo de paz\r\ndiez veces. ",
  "RepeatNumber": 10,
  "Tabweeb": "Las virtudes de pedir paz por el Profeta"
 },
 {
  "ZekarID": 225,
  "ZekarText": "Y dijo tambien (la paz y las bendiciones de Allah sean con él):\r\n No hagáis de mi tumba un lugar de ceremonia, sino que\r\npedid la paz sobre mí, porque por cierto que vuestro pedi-\r\ndo de paz (salam) me llega donde sea que estéis. ",
  "RepeatNumber": 1,
  "Tabweeb": "Las virtudes de pedir paz por el Profeta"
 },
 {
  "ZekarID": 226,
  "ZekarText": "Y dijo (la paz y las bendiciones de Allah sean con él):  El avaro\r\nes quien al ser mencionado mi nombre en su presencia no\r\npide la paz por mi. ",
  "RepeatNumber": 1,
  "Tabweeb": "Las virtudes de pedir paz por el Profeta"
 },
 {
  "ZekarID": 229,
  "ZekarText": "Dijo el Mensajero de Allah (la paz y las bendiciones de Allah\r\nsean con él):  No habéis de entrar al Paraíso hasta que creáis,\r\ny no creeréís hasta que os améis unos a otros, acaso no he\r\nde guiaros a algo que si lo haceis habréis de amaros unos a\r\notros, saludaos entre vosotros. ",
  "RepeatNumber": 1,
  "Tabweeb": "Las virtudes de saludar con la paz"
 },
 {
  "ZekarID": 230,
  "ZekarText": "Relató ’Ammar Ibn Yasir (Allah se complazca de él):  Quien\r\nposea estas tres (cualidades) habrá completado su fe: Ser\r\njusto, saludar a toda la gente y gastar (en caridad) aunque\r\nposea poco. ",
  "RepeatNumber": 1,
  "Tabweeb": "Las virtudes de saludar con la paz"
 },
 {
  "ZekarID": 231,
  "ZekarText": "Relató 'Abdullah Ibn 'Omar (Allah se complazca de él) que\r\nalguien preguntó al Profeta (la paz y las bendiciones de Allah sean\r\ncon él): ¿Cuál es el mejor acto en el Islam? Dijo: dar de co-\r\nmer y saludar a quien conoces y a quien no conoces. ",
  "RepeatNumber": 1,
  "Tabweeb": "Las virtudes de saludar con la paz"
 },
 {
  "ZekarID": 232,
  "ZekarText": "Wa 'aleikum.\r\n\r\n227-  Si os saludan las gentes del Libro decidles: y con vo-\r\nsotros ",
  "RepeatNumber": 1,
  "Tabweeb": "Cómo se devuelve el saludo a un no mu-\r\nsulmán"
 },
 {
  "ZekarID": 235,
  "ZekarText": "Allahumma fa.aíumaa mú.minin sabábtuhu faay'al\r\ndhálika lahu qúrbatann ileika iaumal qiiaamati.\r\n\r\n230- Relató Abu Huraira (Allah se complazca de él) que escuchó\r\nal Profeta (la paz y las bendiciones de Allah sean con él) decir:  Oh\r\nAllah haz que a todo creyente al que haya insultado sea pa-\r\nra él una causa de aproximamiento a Ti el Día del Juicio. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica luego de insultar"
 },
 {
  "ZekarID": 236,
  "ZekarText": " Dijo (la paz y las bendiciones de Allah sean con él): Si alguno\r\n\r\nde vosotros tiene que elogiar a su hermano que diga: creo\r\nque fulano es... y Allah es testigo. Y no elogio a nadie por\r\nencima del halago de Allah, por lo tanto lo considero así... (si realmente sabes esto de él y eres sincero). ",
  "RepeatNumber": 1,
  "Tabweeb": "Qué dice el musulmán al elogiar a otro\r\nmusulmán"
 },
 {
  "ZekarID": 238,
  "ZekarText": "Labbeik Allahumma labbeika, labbeika laa sheriika laka\r\nlabbeika, innal jamda wal ni'mata, laka wal mulku, laa she-\r\nriika laka.\r\n\r\n233-  Oh Allah heme aquí (en respuesta a tu llamada), aquí\r\nestoy, aquí estoy, no tienes asociados, aquí estoy, por cier-\r\nto que toda alabanza, gracia y soberanía te pertenecen, no\r\ntienes asociados (en tu divinidad). ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al comenzar el Hayy o la 'Umrah"
 },
 {
  "ZekarID": 239,
  "ZekarText": "Circunvaló la Casa Sagrada (La Ka'ba), el Mensajero de\r\nAllah (la paz y las bendiciones de Allah sean con él) montado sobre\r\nsu camella, cada vez que llegaba al rincón (donde se en-\r\ncuentra la piedra negra), la señalaba con su bastón dicien-\r\ndo:\r\n\r\n\r\nAllahu ákbar.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al llegar a la piedra negra"
 },
 {
  "ZekarID": 240,
  "ZekarText": "Rabbanaa atina fiid duniaa jásanatan wa fiil ááJira já-\r\nsanatan wa qiinaa 'adhaaban naari.\r\n\r\n235- Solía el Mensajero de Allah (la paz y las bendiciones de Allah\r\nsean con él) decir: (al circunvalar la Ka’aba) entre la piedra\r\nnegra y la esquina yemeni: Qioh Señor nuestro! Danos el\r\nbien en esta vida y en la otra y protégenos del castigo del\r\nfuego? (La Vaca 2:201)",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica entre la esquina Yemení y la\r\npiedra negra"
 },
 {
  "ZekarID": 241,
  "ZekarText": "{Inna Safa wal márwata min sha'aa.iri Allahi}\r\n\r\nAbda.u bimaa bada.á Allahu bihi.\r\n\r\n236- Dijo Yabir (Allah se complazca de él) describiendo la pere-\r\n\r\ngrinación (Hayy) del Profeta (la paz y las bendiciones de Allah sean\r\ncon él) cuando descendió del monte de Safa recitó:  Cierta-\r\nmente Safa y Marwa figuran entre los ritos prescriptos por\r\nAllah. Por eso quien realice la peregrinación (el Hayy) a la\r\nCasa Sagrada, o realice la peregrinación menor (Umra), no\r\nhace mal en dar las vueltas alrededor de ambas. Y quien\r\nhaga el bien espontáneamente Allah es Agradecido, Omni-\r\nciente.  Comienzo por lo que ha comenzado Allah por ello\r\nempezó por Safa.  Así comenzó por Safa subiendo al monte\r\nhasta ver la Casa (al Kaaba), luego se orientó a la Qibla y\r\nproclamó la unicidad de Allah, diciendo No hay dios sino\r\nAllah y Allah es más grande (tres veces) Allahu ákbar Allahu\r\nákbar Allahu ákbar. Luego dijo:  No hay dios sino Allah, úni-\r\nco, sin asociados, Suya es el Reino y Suya es la alabanza, y\r\nes sobre toda cosa poderoso, ha cumplido con su promesa,\r\ny le ha dado la victoria a su siervo, y sólo Él ha derrotado a\r\n\r\nLaa ilaaha illa Allah uájdahu laa sheriika lahu, lahul mulku,\r\nua lahul jamdu ua hua 'alaa kulli shei.in qadiir.\r\n\r\nLaa ilaaha illa Allah uájdahu. ányazha ua'dahu wa náSara\r\n'abdahu wa házhama al-ajzhaaba uájdahu.\r\n\r\nLuego el Profeta (la paz y las bendiciones de Allah sean con él) oró\r\nentre los dos montes, diciendo esto tres veces, y realizó lo\r\nmismo al llegar a Marwa tal como había hecho en Safa.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al llegar a los montes de As-Safa\r\ny Al-Marwa"
 },
 {
  "ZekarID": 242,
  "ZekarText": "Laa ilaaha illa Allah uájdahu laa sheriika lahu, lahul\r\nmulku, ua lahul jamdu ua hua 'alaa kulli shei.in qadiir.\r\n\r\n237-  La mejor de las súplicas es la súplica del día de Arafat,\r\ny lo mejor que he dicho yo y han dicho los profetas anterio-\r\nres a mí es:  No hay dios sino Allah, único, sin asociados,\r\nSuyo es el Reino y Suya es la alabanza, y es sobre toda cosa\r\npoderoso. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica del día de 'Arafat"
 },
 {
  "ZekarID": 243,
  "ZekarText": "Relató Yabir (Allah se complazca de él) que el Profeta (la paz\r\ny las bendiciones de Allah sean con él) montó a Qaswa (la camella\r\ndel Mensajero de Allah) hasta que llegó a Al-mash'ar al\r\nHaram (Muzdálifah), entonces se orientó hacia la Qibla y\r\nsuplicó a Allah, destacó su grandeza y unicidad, y lo alabó.\r\nNo dejó de estar parado hasta que comenzó el amanecer, y\r\npartió (rumbo a Mina) antes que salga el solz",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica en Al-lmash'ar Al-haram (en\r\nMuzdhalifa)"
 },
 {
  "ZekarID": 244,
  "ZekarText": "Allahu ákbar. Allahu ákbar. Allahu ákbar.\r\n\r\n224- Cada vez que el Mensajero de Allah (la paz y las bendicio-\r\nnes de Allah sean con él) arrojaba un guijarro al Yamarat (que\r\nson los tres monolitos simbólicos del mal) y decía: Allahu\r\nákbar (Allah es grande) tres veces, luego se adelantaba, y\r\noríentándose a la Qibla, levantando sus manos suplicaba,\r\nluego de la primera y la segunda Yamarat (llamadas al-ásgar\r\ny al-wusta, la más pequeña y la mediana), pero ante la ma-\r\nyor de ellas (al ákbar) arrojaba las siete piedrecillas sola-\r\nmente diciendo: Allahu ákbar, retirándose luego, sin parar-\r\nse a suplicanl",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al arrojar los guijarros al Yamarat"
 },
 {
  "ZekarID": 245,
  "ZekarText": "Subjaana Allah.\r\n\r\n240-  iGlorificado sea Allah! ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica ante una alegría o una sorpresa"
 },
 {
  "ZekarID": 246,
  "ZekarText": "Allahu ákbar.\r\n241-  Allah es grande. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica ante una alegría o una sorpresa"
 },
 {
  "ZekarID": 247,
  "ZekarText": "El Profeta (la paz y las bendiciones de Allah sean con él) solía\r\n\r\nprosternarse en agradecimiento a Allah al recibir buenas\r\nnoticias que lo alegraran o que le causaran mucha alegría.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al recibir buenas noticias"
 },
 {
  "ZekarID": 248,
  "ZekarText": "Bismillah. Bismillah. Bismillah.\r\n\r\nA'udhu billahi wa qudrátihi min sherri maa áyidu wa ujaad-\r\nhir. (7 veces)\r\n\r\n243-  Pon tu mano donde te duele y di: iEn el nombre de\r\nAllah! (tres veces) y di: me refugio en Allah en su omnipo-\r\ntencia, del mal que siento y me preocupa. (7 veces)",
  "RepeatNumber": 3,
  "Tabweeb": "Súplica al sentir algún dolor en el cuerpo"
 },
 {
  "ZekarID": 250,
  "ZekarText": "Laa ilaaha illa Allah.\r\n245-  No hay dios salvo Allah. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al asustarse"
 },
 {
  "ZekarID": 251,
  "ZekarText": "Bismillahi, wa Allahu ákbaru Allahumma minka wa laka\r\nAllahumma taqábbal minnii.\r\n\r\n239-  En el nombre de Allah, Allah es más grande, Señor es-\r\nto proviene de Ti y para Ti, Señor acéptalo de mí. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al degollar un animal"
 },
 {
  "ZekarID": 252,
  "ZekarText": "A'udhu bikalimaati Allahi attammati allatíí laa iuyaa-\r\nwizhuhunna barrun wa laa fááyirun min sherri maa Jálaqa,\r\nwa bara.á wa dhára.a, wa min sherri maa iánzhilu min as-\r\nsamaa.i wa min maa iá'ruyu fiihaa wa min sherri maa dhá-\r\nra.a fiil arDi wa min sherri maa iáJruyu minhaa, wa min\r\nsherri fítanil leili wan nahaari, wa min sherri kulli Tááriqin\r\nilla Tááriqan iáTruqu biJeirin iaa Rajmaanu.\r\n\r\n247-  Me refugio en las palabras perfectas de Allah, aque-\r\nllas que no pueden ser transgredidas por la persona recta ni\r\npor la corrupta, de todo mal que ha creado (Allah), del mal\r\nque desciende de los cielos y del mal que se eleva. Del mal\r\nque es esparcido sobre la tierra y del mal que proviene de\r\nella, Me refugio del mal de las tribulaciones de la noche y\r\ndel día, y de todo mal que llega por las noches, y salvo\r\naquella sorpresa que es una albricia que es del Misericor-\r\ndiosísimo ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para evitar el engaño del demo-\r\nnio"
 },
 {
  "ZekarID": 253,
  "ZekarText": "El Mensajero de Allah (la paz y las bendiciones de Allah sean\r\ncon él) dijo:  Por Allah, que pido el perdón y me arrepenti-\r\nmiento a Allah más de setenta veces. ",
  "RepeatNumber": 70,
  "Tabweeb": "Súplica para solicitar el perdón y el arre-\r\npentimiento"
 },
 {
  "ZekarID": 254,
  "ZekarText": "Y dijo (la paz y las bendiciones de Allah sean con él):  iOh gen-\r\nte! Arrepentíos a Allah porque ciertamente me arrepiento a\r\nAllah, durante el día cien veces. ",
  "RepeatNumber": 100,
  "Tabweeb": "Súplica para solicitar el perdón y el arre-\r\npentimiento"
 },
 {
  "ZekarID": 255,
  "ZekarText": "Astágfiru Allaha alladhíí laa ilaaha il-laa hua al jeiul qai-\r\nuumu wa atuubu ileihi.",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para solicitar el perdón y el arre-\r\npentimiento"
 },
 {
  "ZekarID": 256,
  "ZekarText": "Y dijo (la paz y las bendiciones de Allah sean con él):  Cuando\r\nmás cerca está el Señor de su siervo es en la mitad de la\r\nnoche, entonces si podéis sed de aquellos que recuerdan a\r\nAllah en esa hora. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para solicitar el perdón y el arre-\r\npentimiento"
 },
 {
  "ZekarID": 257,
  "ZekarText": "Y dijo (la paz y las bendiciones de Allah sean con él):  Cuanto\r\nmás cerca está el siervo de su Señor es cuando el siervo es-\r\ntá prosternado, entonces pues rogad mucho aumentando\r\nlas súplicas. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para solicitar el perdón y el arre-\r\npentimiento"
 },
 {
  "ZekarID": 258,
  "ZekarText": "Al-Agar Al-Muzhni relató: Por cierto que el Mensajero\r\nde Allah (la paz y las bendiciones de Allah sean con él) dijo:  Cierta-\r\nmente mi corazón se vuelve absorto y pido perdón a Allah\r\ncien veces por día. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica para solicitar el perdón y el arre-\r\npentimiento"
 },
 {
  "ZekarID": 261,
  "ZekarText": "Subjaana Allahi wa bi jámdihi, subjaana Allahil aDhiimi.\r\n\r\n256- Abu Huraíra (Allah se complazca de él) relató que el Mensaje-\r\nro de Allah (la paz y las bendiciones de Allah sean con él) dijo:  Exis\r\nten dos palabras muy fáciles de decir, que pesan en la\r\nbalanza, y son amadas por el Misericordioso:  Glorificado\r\nsea Allah y alabado sea, glorificado sea Allah el Grandioso. ",
  "RepeatNumber": 1,
  "Tabweeb": "Virtudes del recuerdo y la glorificación\r\nde Allah"
 },
 {
  "ZekarID": 265,
  "ZekarText": "Laa Jaula wa laa Quuwata illaa billahi.\r\n\r\n\r\n9- DijO Abdullah Ibn Qais (Allah se complazca de él) que el Men-\r\nsajero de Allah (la paz y las bendiciones de Allah sean con él) dijo:\r\n ’Abdullah Ibn Qais ¿acaso no deseas que te guíe hacia un\r\ntesoro de los tesoros del Paraíso?  Contesté: por supuesto\r\nque sí Mensajero de Allah. Dijo: Di:  No hay fuerza ni poder\r\nsalvo en Allah. ",
  "RepeatNumber": 1,
  "Tabweeb": "Virtudes del recuerdo y la glorificación\r\nde Allah"
 },
 {
  "ZekarID": 267,
  "ZekarText": "Laa ilaaha illa Allah uájdahu laa sheriika lahu, Allahu ák-\r\nbaru kabiira wal jamdu lillahi kaziira subjaana Allahi rabil\r\n'aalamiina, wa laa jaula wa laa qúwata illa billahil 'azhiizhil\r\njakiimi.\r\n\r\nAllahumma agfirlii war jamnii wah dinii wa 'aafiinii war\r\nzhuknii.\r\n\r\n262- Relató Sa'ad Ibn Abi Waqas (Allah se complazca de él): Llegó\r\n\r\n\r\nun beduíno ante el Mensajero de Allah (la paz y las bendiciones\r\nde Allah sean con él) diciendo: Enseñame algo que pueda decir.\r\nLe dijo (la paz y las bendiciones de Allah sean con él) :  Di: NO hay\r\ndivinidad salvo Allah, único sin asociado, Allah es el más\r\ngrande, el Grandioso. iQue Allah sea alabado mucho! Glori-\r\nficado sea Allah, Señor del universo, no hay fuerza ni poder\r\nsalvo en Allah el Poderoso Sapientísimo.  Respondió el be-\r\nduíno: Esas palabras son para mi Señor. ¿Y qué hay para\r\nmí? Dijo (la paz y las bendiciones de Allah sean con él):  Di: Oh Allah\r\nperdóname, ten misericordia de mí, guíame y sustenta-\r\nme. ",
  "RepeatNumber": 1,
  "Tabweeb": "Virtudes del recuerdo y la glorificación\r\nde Allah"
 },
 {
  "ZekarID": 273,
  "ZekarText": "Allahumma Salli 'ala Muhámmadin wa 'ala azhuaayihi\r\nwa dhurrííatihi kama Salleita 'ala Aali Ibrahim. Wa barik 'ala\r\nMuhámmadin wa 'ala azhuaayihi wa dhurrííiatihi kama ba-\r\nrakta 'ala Aali Ibrahimi, ínnaka jámidun mayiid.\r\n\r\n54-  Oh Allah alaba a Muhámmad, a sus esposas y su des-\r\ncendencia como alabaste a la familia de Abraham. Y bendi-\r\nce a Muhámmad, a sus esposas y descendencia, como\r\nbendijiste a la familia de Abraham. Por cierto Tu eres Ala-\r\nbado y Majestuoso. ",
  "RepeatNumber": 1,
  "Tabweeb": "Las alabanzas para el Profeta luego de los\r\ndos testimonios de Fe"
 },
 {
  "ZekarID": 274,
  "ZekarText": "A'udhu billahil 'aDhiim wa bi uáyhihil karim wa\r\nsulTáánihil qadiim mina ashsheiTaán irrayiim, Bismillahi, wa\r\naSSalaatu wa asalaamu 'alaa rasuulíl-lah, Allahumma aftaj lii\r\nabbuaaba rajmátika.\r\n\r\n20-  Me refugio en Allah, el Magnífico, en Su rostro genero-\r\nso y en Su eterno dominio del maldito demonio.   En el\r\n\r\nnombre de Allah.   La paz y las bendiciones de Allah sean\r\ncon su Mensajero.   iOh Allah! Ábreme las puertas de Tu\r\nmisericordia. ",
  "RepeatNumber": 1,
  "Tabweeb": "Súplica al entrar a la Mezquita"
 }
],
"categories":[
 {
  "CategoryID": 1,
  "Category": "Súplica al despertar"
 },
 {
  "CategoryID": 2,
  "Category": "Súplica al vestir"
 },
 {
  "CategoryID": 3,
  "Category": "Súplica al estrenar una ropa"
 },
 {
  "CategoryID": 4,
  "Category": "Súplica para quien estrena una ropa"
 },
 {
  "CategoryID": 5,
  "Category": "Súplica al desvestirse"
 },
 {
  "CategoryID": 6,
  "Category": "Súplica antes de entrar al baño"
 },
 {
  "CategoryID": 7,
  "Category": "Súplica al salir del baño"
 },
 {
  "CategoryID": 8,
  "Category": "Súplica al iniciar la ablución"
 },
 {
  "CategoryID": 9,
  "Category": "Súplica al terminar la ablución"
 },
 {
  "CategoryID": 10,
  "Category": "Súplica al salir de la casa"
 },
 {
  "CategoryID": 11,
  "Category": "Súplica al regresar a casa"
 },
 {
  "CategoryID": 12,
  "Category": "Súplica al dirigirse a la Mezquita"
 },
 {
  "CategoryID": 13,
  "Category": "Súplica al entrar a la Mezquita"
 },
 {
  "CategoryID": 14,
  "Category": "Súplica al salir de la Mezquita"
 },
 {
  "CategoryID": 15,
  "Category": "Súplica durante el llamado a la oración"
 },
 {
  "CategoryID": 16,
  "Category": "Súplica al comenzar la oración"
 },
 {
  "CategoryID": 17,
  "Category": "Súplica durante la inclinación (Ruku')"
 },
 {
  "CategoryID": 18,
  "Category": "Súplica al levantarse del Ruku'"
 },
 {
  "CategoryID": 19,
  "Category": "Súplica durante la postración (Suyúd)"
 },
 {
  "CategoryID": 20,
  "Category": "Súplicas al sentarse entre las dos proster-\r\nnaciones"
 },
 {
  "CategoryID": 21,
  "Category": "Súplica en la prosternación durante la re-\r\ncitación del Corán"
 },
 {
  "CategoryID": 22,
  "Category": "Los dos testimonios de Fe"
 },
 {
  "CategoryID": 23,
  "Category": "Las alabanzas para el Profeta luego de los\r\ndos testimonios de Fe"
 },
 {
  "CategoryID": 24,
  "Category": "Súplica luego del último tashahud y antes\r\ndel saludo final"
 },
 {
  "CategoryID": 25,
  "Category": "Súplica luego de la salutación final"
 },
 {
  "CategoryID": 26,
  "Category": "Súplica para pedir el bien (Salat Al-lstijara)"
 },
 {
  "CategoryID": 27,
  "Category": "Recuerdos \"dhikr\" para realizar durante\r\nel día y la noche"
 },
 {
  "CategoryID": 28,
  "Category": "Súplicas antes de dormir"
 },
 {
  "CategoryID": 29,
  "Category": "Súplica para quien sufre insomnio"
 },
 {
  "CategoryID": 30,
  "Category": "Súplica ante el temor, las preocupaciones\r\no las pesadillas"
 },
 {
  "CategoryID": 31,
  "Category": "Los sueños placenteros y pesadillas"
 },
 {
  "CategoryID": 32,
  "Category": "Súplica Al-Qunút'"
 },
 {
  "CategoryID": 33,
  "Category": "Súplica luego de la salutación de la ora-\r\nción impar (witr)"
 },
 {
  "CategoryID": 34,
  "Category": "Súplicas ante la tristeza y la preocupación"
 },
 {
  "CategoryID": 35,
  "Category": "Súplicas para los momentos de aflicción"
 },
 {
  "CategoryID": 36,
  "Category": "Súplica ante la agresión del enemigo o de\r\naquellos que poseen autoridad"
 },
 {
  "CategoryID": 37
 },
 {
  "CategoryID": 38,
  "Category": "Súplica contra los enemigos"
 },
 {
  "CategoryID": 39,
  "Category": "Súplica cuando se teme a alguien"
 },
 {
  "CategoryID": 40,
  "Category": "La súplica de quien es afligido con dudas\r\nen la fe"
 },
 {
  "CategoryID": 41,
  "Category": "Súplica para saldar las deudas"
 },
 {
  "CategoryID": 43,
  "Category": "Súplica ante las dificultades"
 },
 {
  "CategoryID": 46,
  "Category": "Súplica ante una desgracia"
 },
 {
  "CategoryID": 49,
  "Category": "Cómo encomendar a los niños a la protec-\r\nción de Allah\r\n؟؟؟؟؟"
 },
 {
  "CategoryID": 50,
  "Category": "Súplica al visitar un enfermo"
 },
 {
  "CategoryID": 52,
  "Category": "Súplica del enfermo"
 },
 {
  "CategoryID": 53,
  "Category": "Súplica al asustarse\r\n؟؟؟؟؟"
 },
 {
  "CategoryID": 54,
  "Category": "Súplica para quien sufre una desgracia o la\r\nperdida de un ser querido\r\n؟؟؟؟؟؟"
 },
 {
  "CategoryID": 55,
  "Category": "Súplica al cerrar los ojos de un difunto"
 },
 {
  "CategoryID": 56,
  "Category": "Súplica por el difunto durante la oración\r\nfúnebre"
 },
 {
  "CategoryID": 57,
  "Category": "Súplica para que se apresure la recom-\r\npensa al difunto\r\n؟؟؟؟"
 },
 {
  "CategoryID": 58,
  "Category": "Las condolencias"
 },
 {
  "CategoryID": 59,
  "Category": "Súplica al depositar al muerto en la tumba\r\n؟؟؟؟؟"
 },
 {
  "CategoryID": 60,
  "Category": "Súplica luego del entierro"
 },
 {
  "CategoryID": 61,
  "Category": "Súplica al visitar una tumbas"
 },
 {
  "CategoryID": 62,
  "Category": "Súplica ante una tormenta de viento"
 },
 {
  "CategoryID": 63,
  "Category": "Súplica al escuchar un trueno"
 },
 {
  "CategoryID": 64,
  "Category": "Súplica para pedir lluvia"
 },
 {
  "CategoryID": 65,
  "Category": "Súplica al comenzar la lluvia"
 },
 {
  "CategoryID": 66,
  "Category": "Súplica luego de la lluvia"
 },
 {
  "CategoryID": 67,
  "Category": "Súplica para que se detenga la lluvia"
 },
 {
  "CategoryID": 68,
  "Category": "Súplica al observar la luna creciente"
 },
 {
  "CategoryID": 69,
  "Category": "Súplica al cortar el ayuno"
 },
 {
  "CategoryID": 70,
  "Category": "Súplica antes de comer"
 },
 {
  "CategoryID": 71,
  "Category": "Súplica al terminar de comer"
 },
 {
  "CategoryID": 72,
  "Category": "Súplica por quien invita a comer"
 },
 {
  "CategoryID": 73,
  "Category": "Súplica por quien da de beber"
 },
 {
  "CategoryID": 74,
  "Category": "Súplica de aquel que es invitado para des-\r\nayunar"
 },
 {
  "CategoryID": 75,
  "Category": "Súplica del ayunante cuando se presentan\r\nlos alimentos y aún no ha desayunado"
 },
 {
  "CategoryID": 76,
  "Category": "Qué responde el ayunante si es insultado"
 },
 {
  "CategoryID": 77,
  "Category": "Súplica al ver madurar los frutos"
 },
 {
  "CategoryID": 78,
  "Category": "Súplica al estornudar"
 },
 {
  "CategoryID": 79,
  "Category": "Súplica por un no musulmán que estor-\r\nnuda"
 },
 {
  "CategoryID": 80,
  "Category": "Súplica por los recién casados"
 },
 {
  "CategoryID": 81,
  "Category": "Súplica al contraer matrimonio"
 },
 {
  "CategoryID": 82,
  "Category": "Súplica antes de iniciar la relacion sexual"
 },
 {
  "CategoryID": 83,
  "Category": "Súplica ante la ira"
 },
 {
  "CategoryID": 84,
  "Category": "Súplica al ver un discapacitado o una per-\r\nsona con problemas de salud\r\n؟؟؟؟؟"
 },
 {
  "CategoryID": 85,
  "Category": "Súplica durante una reunión"
 },
 {
  "CategoryID": 86,
  "Category": "Súplica al finalizar una reunión"
 },
 {
  "CategoryID": 87,
  "Category": "Súplica por quien dice: \"Que Allah te per-\r\ndone\""
 },
 {
  "CategoryID": 88,
  "Category": "Súplica por quien nos hace un favor"
 },
 {
  "CategoryID": 89,
  "Category": "Súplica para protegerse del Falso Mesías"
 },
 {
  "CategoryID": 90,
  "Category": "Súplica por quien dice: \"Te amo por Allah\""
 },
 {
  "CategoryID": 91,
  "Category": "Súplica por quien ofrece ayuda económica"
 },
 {
  "CategoryID": 92,
  "Category": "Súplica por el acreedor al momento de\r\nsaldar la deuda"
 },
 {
  "CategoryID": 93,
  "Category": "Súplica por temor a caer en la idolatría"
 },
 {
  "CategoryID": 94,
  "Category": "Súplica por quien hace un regalo o da una\r\ncaridad"
 },
 {
  "CategoryID": 95,
  "Category": "La prohibición de creer en la superstición"
 },
 {
  "CategoryID": 96,
  "Category": "Súplica al subir a un medio de transporte"
 },
 {
  "CategoryID": 97,
  "Category": "Súplica al emprender un viaje"
 },
 {
  "CategoryID": 98,
  "Category": "Súplica al ingresar a una ciudad"
 },
 {
  "CategoryID": 99,
  "Category": "Súplica al ingresar al mercado"
 },
 {
  "CategoryID": 100,
  "Category": "Súplica al descomponerse el medio de transporte"
 },
 {
  "CategoryID": 101,
  "Category": "Súplica del viajero por el residente"
 },
 {
  "CategoryID": 102,
  "Category": "Súplica del residente por el viajero"
 },
 {
  "CategoryID": 103,
  "Category": "Súplica al ascender o descender por los\r\ncaminos"
 },
 {
  "CategoryID": 104,
  "Category": "Súplica del viajero al amanecer"
 },
 {
  "CategoryID": 105,
  "Category": "Súplica al entrar a una casa ajena"
 },
 {
  "CategoryID": 106,
  "Category": "Súplica al iniciar el regreso de un viaje"
 },
 {
  "CategoryID": 107,
  "Category": "Súplica al recibir buenas noticias"
 },
 {
  "CategoryID": 108,
  "Category": "Las virtudes de pedir paz por el Profeta"
 },
 {
  "CategoryID": 109,
  "Category": "Las virtudes de saludar con la paz"
 },
 {
  "CategoryID": 110,
  "Category": "Cómo se devuelve el saludo a un no mu-\r\nsulmán"
 },
 {
  "CategoryID": 113,
  "Category": "Súplica luego de insultar"
 },
 {
  "CategoryID": 114,
  "Category": "Qué dice el musulmán al elogiar a otro\r\nmusulmán"
 },
 {
  "CategoryID": 116,
  "Category": "Súplica al comenzar el Hayy o la 'Umrah"
 },
 {
  "CategoryID": 117,
  "Category": "Súplica al llegar a la piedra negra"
 },
 {
  "CategoryID": 118,
  "Category": "Súplica entre la esquina Yemení y la\r\npiedra negra"
 },
 {
  "CategoryID": 119,
  "Category": "Súplica al llegar a los montes de As-Safa\r\ny Al-Marwa"
 },
 {
  "CategoryID": 120,
  "Category": "Súplica del día de 'Arafat"
 },
 {
  "CategoryID": 121,
  "Category": "Súplica en Al-lmash'ar Al-haram (en\r\nMuzdhalifa)"
 },
 {
  "CategoryID": 122,
  "Category": "Súplica al arrojar los guijarros al Yamarat"
 },
 {
  "CategoryID": 123,
  "Category": "Súplica ante una alegría o una sorpresa"
 },
 {
  "CategoryID": 124,
  "Category": "Súplica al recibir buenas noticias"
 },
 {
  "CategoryID": 125,
  "Category": "Súplica al sentir algún dolor en el cuerpo"
 },
 {
  "CategoryID": 127,
  "Category": "Súplica al asustarse"
 },
 {
  "CategoryID": 128,
  "Category": "Súplica al degollar un animal"
 },
 {
  "CategoryID": 130,
  "Category": "Súplica para evitar el engaño del demo-\r\nnio"
 },
 {
  "CategoryID": 131,
  "Category": "Súplica para solicitar el perdón y el arre-\r\npentimiento"
 },
 {
  "CategoryID": 132,
  "Category": "Virtudes del recuerdo y la glorificación\r\nde Allah"
 }
]
}