{
"azkar":[
 {
  "ZekarID": 1,
  "ZekarText": "Louange à Allah qui nous a rendus à la vie après nous avoir fait mourir, et tout retourne à Lui  \r\nAl-hamdu li-l-lâhi l-ladhî ahyânâ bacda mâ amâtanâ wa ilayhi n-nushûr.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsqu'on se réveille"
 },
 {
  "ZekarID": 2,
  "ZekarText": "Louange à Allah qui m’a rendu la vie, m’a préservé dans ma santé et m’a permis de Le mentionner. \r\n\r\nAl hamdu li-l-lâhi l-ladhî câfânî fî jasadî wa radda calayya rûhî, wa adhina lî bi-dhikrihi.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsqu'on se réveille"
 },
 {
  "ZekarID": 3,
  "ZekarText": "Il n’y a d’autre divinité qu’Allâh l’Unique sans associé, à Lui la royauté et à Lui la louange et Il est capable de toute chose. Gloire et pureté à Allâh, la louange est à Allâh et il n’y a de puissance ni de force qu’en Allâh le Très-Haut, le Plus Grand. Ô Seigneur pardonne-moi. \r\n\r\nLâ ilâha illâ l-lâhu wahdahu lâ sharîka lahu, lahu-l-mulku wa lahu lhamdu, wa huwa calâ kulli shay’in qadîr. Subhâna l-lâhi, wa-l-hamdu li-l-lâhi, wa lâ ilâha illa l-lâhu, wa l-lâhu akbaru, wa lâ hawla wa lâ quwwata illa bi-l-lâhi-l-caliyyi-l-cazîm. Rabbi ghfir lî.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsqu'on se réveille"
 },
 {
  "ZekarID": 4,
  "ZekarText": "En vérité, dans la création des cieux et de la terre, et dans l'alternance de la nuit et du jour, il y a certes des signes pour les doués d'intelligence, qui, debout, assis, couchés sur leurs côtés, invoquent Allah et méditent sur la création des cieux et de la terre (disant): ‹Notre Seigneur! Tu n'as pas créé cela en vain. Gloire à Toi! Garde-nous du châtiment du Feu. Seigneur! Quiconque Tu fais entrer dans le Feu, Tu le couvres vraiment d'ignominie. Et pour les injustes, il n'y a pas de secoureurs! Seigneur! Nous avons entendu l'appel de celui qui a appelé ainsi à la foi: ‹Croyez en votre Seigneur› et dès lors nous avons cru. Seigneur, pardonne-nous nos péchés, efface de nous nos méfaits, et place nous, à notre mort, avec les gens de bien. Seigneur! Donne-nous ce que Tu nous as promis par Tes messagers. Et ne nous couvre pas d'ignominie au Jour de la Résurrection. Car Toi, Tu ne manques pas à Ta promesse›. Leur Seigneur les a alors exaucés (disant): ‹En vérité, Je ne laisse pas perdre le bien que quiconque parmi vous a fait, homme ou femme, car vous êtes les uns des autres. Ceux donc qui ont émigré, qui ont été expulsés de leurs demeures, qui ont été persécutés dans Mon chemin, qui ont combattu, qui ont été tués, Je tiendrai certes pour expiées leurs mauvaises actions, et les ferai entrer dans les Jardins sous lesquels coulent les ruisseaux, comme récompense de la part d'Allah.› Quant à Allah, c'est auprès de Lui qu'est la plus belle récompense. Que ne t'abuse point la versatilité [pour la prospérité] dans le pays, de ceux qui sont infidèles. Piètre jouissance! Puis leur refuge sera l'Enfer. Et quelle détestable couche! Mais quant à ceux qui craignent leur Seigneur, ils auront des Jardins sous lesquels coulent les ruisseaux, pour y demeurer éternellement, un lieu d'accueil de la part d'Allah. Et ce qu'il y a auprès d'Allah est meilleur, pour les pieux. Il y a certes, parmi les gens du Livre ceux qui croient en Allah et en ce qu'on a fait descendre vers vous et en ceux qu'on a fait descendre vers eux. Ils sont humbles envers Allah, et ne vendent point les versets d'Allah à vil prix. Voilà ceux dont la récompense est auprès de leur Seigneur. en vérité, Allah est prompt à faire les comptes. O les croyants! Soyez endurants. Incitez-vous à l'endurance. Luttez constamment (contre l'ennemi) et craignez Allah, afin que vous réussissiez! \r\n\r\nInna fî khalqi s-samâwâti wa-l-ardi wa khtilâfi l-layli wa n-nahâri la-âyâtin li-ûli-l-albâb. Al-ladhîna yadhkurûna l-lâha qiyâman wa qucûdan wa calâ junûbihim, wa yatafakkarûna fî khalqi s-samâwâti wa-l-ardi, rabbanâ ! mâ khalaqta hâdhâ bâtilan subhânaka fa-qinâ cadhâba n-nâr.\r\nRabbanâ ! Innaka man tudkhili n-nâra fa-qad akhzaytahu wa mâ li-zâlimîna min ansâr.\r\nRabbanâ ! Innanâ samicnâ munâdiyan yunâdî li-l-îmâni an âminû bi-rabbikum fa-âmannâ.\r\nRabbanâ ! Fa-ghfir lanâ dhunûbanâ wa kaffir cannâ sayyi'âtinâ wa tawaffanâ maca-l-abrâr.\r\nRabbanâ ! Wa âtinâ mâ wacadtanâ calâ rusulika wa lâ tukhzinâ yawma-l-qiyâmati, innaka lâ tukhlifu-l-mîcâd.\r\nFa-stajâba lahum rabbuhum annî lâ udîcu camala câmilin minkum m-min dhakarin aw unthâ, bacdukum min bacdin, fa-l-ladhîna hâjarû wa ukhrijû min diyârihim wa ûdhû fî sabîlî wa qâtalû wa qutilû, la-ukaffiranna canhum sayyi'âtihim wa la-udkhilannahum jannâtin tajrî min tahtihâ-l-anhâru, thawâban min cindi l-lâhi, wa l-lâhu cindahu husnu-ththawâb.\r\nLâ yaghurrannaka taqallubu l-ladhîna kafarû fî-l-bilâd, matâc qalîlun, thumma ma'wâhum jahannamu wa bi'sa-l-mihâd.\r\nLâkini l-ladhîna t-taqaw rabbahum lahum jannâtun tajrî min tahâ-l-anhâru khâlidîna fîhâ, nuzulan m-min cindi l-lâhi wa mâ cinda l-lâhi khayrun li-l-abrâr.\r\nWa inna min ahli-l-kitâbi la-man yu'minu bi-l-lâhi wa mâ unzila ilaykum wa mâ unzila ilayhim, khâshicîna li-l-lâhi, lâ yashtarûna bi-âyâti l-lâhi thamanan qalîlan. Uwlâ-ika lahum ajruhum cinda rabbihim, inna l-l^haa sarîc-l-hisâb.\r\nYâ ayyuhâ l-ladhîna âmanû-sbirû wa sâbirû wa râbitû wa t-taqû l-lâha lacallakum tuflihûn.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsqu'on se réveille"
 },
 {
  "ZekarID": 5,
  "ZekarText": "Louange à Allah qui m’en a vêtu et me l’a accordé, sans que ma propre force ni ma puissance n'y soient pour quelque chose. \r\n\r\n\r\nAl hamdu li-l-lâhi l-ladhî kasânî hadhâ th-thawbawa razaqanîhi min ghayri hawlin minnî wa lâ quwwatin.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsqu'on s'habille"
 },
 {
  "ZekarID": 6,
  "ZekarText": "Ô Seigneur ! Louange à Toi qui m’en as revêtu, je Te demande ses bienfaits et le bien pour lequel il a été conçu et je me réfugie auprès de Toi contre ses méfaits et le mal pour lequel il a été conçu. \r\n\r\n\r\nAllâhumma laka-l-hamdu. Anta kasawtanîhi. As’aluka min khayrihi wa khayri mâ sunica lahu, wa acudhu bika min sharrihi wa sharri mâ sunica lahu.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque l'on met un vêtement neuf"
 },
 {
  "ZekarID": 7,
  "ZekarText": "Porte du neuf, vis honoré et meurs en martyr ! \r\n\r\nIlbas jadîdan, wa cîsh hamîdan, wa mut shahîdan.",
  "RepeatNumber": 1,
  "Tabweeb": "Ce que l'on dit à celui qui met un vêtement neuf"
 },
 {
  "ZekarID": 8,
  "ZekarText": "Use-le et qu’Allah exalté t’en donne davantage. \r\n\r\nTublî wa yukhlifu l-lâhu tacâlâ.",
  "RepeatNumber": 1,
  "Tabweeb": "Ce que l'on dit à celui qui met un vêtement neuf"
 },
 {
  "ZekarID": 9,
  "ZekarText": "Au nom d’Allah. \r\n\r\nBismi l-lâhi.",
  "RepeatNumber": 1,
  "Tabweeb": "Avant de se déshabiller"
 },
 {
  "ZekarID": 10,
  "ZekarText": "[Au nom d’Allah] Ô Seigneur ! Je prends refuge auprès de Toi contre les démons mâles et femelles. \r\n\r\n\r\n(Bismi l-lâhi). Allâhumma innî acûdhu bika mina-l-khubthi wa-l-khabâ’ith.",
  "RepeatNumber": 1,
  "Tabweeb": "En entrant aux toilettes"
 },
 {
  "ZekarID": 11,
  "ZekarText": "Ton pardon, Ô Seigneur ! \r\n\r\nGhufrânak.",
  "RepeatNumber": 1,
  "Tabweeb": "En sortant des toilettes"
 },
 {
  "ZekarID": 12,
  "ZekarText": "Au nom d’Allah. \r\n\r\nBismi l-lâhi.",
  "RepeatNumber": 1,
  "Tabweeb": "Ce que l'on dit avant les ablutions"
 },
 {
  "ZekarID": 13,
  "ZekarText": "J’atteste qu’il n’y a point de divinité qu’Allah l’Unique qui n’a point d’associé et j’atteste que Muhammad est Son serviteur et Son Messager. \r\n\r\nAsh-hadu an lâ ilâha illa l-lâhu, wahdahu lâ sharîka lahu, wa ash-hadu anna Muhammadan cabdûhu wa rasûluhu.",
  "RepeatNumber": 1,
  "Tabweeb": "Ce que l'on dit après les ablutions"
 },
 {
  "ZekarID": 14,
  "ZekarText": "Ô Seigneur ! Mets-moi au nombre de ceux qui se repentent et de ceux qui se purifient. \r\n\r\nAllâhumma jcalnî mina t-tawwâbîna wa jcalnî mina-l-mutatahhirîn.",
  "RepeatNumber": 1,
  "Tabweeb": "Ce que l'on dit après les ablutions"
 },
 {
  "ZekarID": 15,
  "ZekarText": "Gloire à Toi Seigneur, et par Ta louange, j’atteste qu’il n’est de divinité que Toi, je Te demande pardon et je me repens auprès de Toi. \r\n\r\n\r\nSubhânaka l-lâhumma wa bi-hamdika. Ash-hadu an lâ ilâha illâ anta, astaghfiruka wa atûbu ilayka.",
  "RepeatNumber": 1,
  "Tabweeb": "Ce que l'on dit après les ablutions"
 },
 {
  "ZekarID": 16,
  "ZekarText": "Ô Seigneur, je cherche protection auprès de Toi pour que je n’égare personne ou que je ne sois égaré, pour que je ne commette aucune faute ou qu’on ne m’incite à la faire, pour que je n’oppresse personne ou que je ne subisse une oppression, pour que je ne sois injuste ou que je ne subisse une injustice ! \r\n\r\n\r\nAllâhumma innî acûdhu bika an adilla aw udalla, aw azilla aw uzalla, aw azlima, aw uzlama, aw ajhala, aw yujhala calayya.",
  "RepeatNumber": 1,
  "Tabweeb": "En entrant\/sortant de la maison"
 },
 {
  "ZekarID": 17,
  "ZekarText": "En sortant de la maison.\r\nAu nom d’Allah, je m’en remets à Allah, il n’y a de force et de puissance que par Allah. \r\n\r\nBismi l-lâhi, tawakkaltu calâ l-lâhi, wa lâ hawla wa lâ quwwata illâ bi-l-lâhi.",
  "RepeatNumber": 1,
  "Tabweeb": "En entrant\/sortant de la maison"
 },
 {
  "ZekarID": 18,
  "ZekarText": "{En entrant à la maison :] Au nom d'Allah nous entrons et au nom d'Allah nous sortons et en Allah nous plaçons notre confiance (Puis qu'il salue sa famille). \r\n\r\nBismi l-lâhi walajnâ, wa bismi l-lâhi kharajnâ, wa calâ l-lâhi tawakkalnâ.",
  "RepeatNumber": 1,
  "Tabweeb": "En entrant\/sortant de la maison"
 },
 {
  "ZekarID": 19,
  "ZekarText": "Ô Seigneur ! Mets dans mon cœur de la lumière, dans ma langue de la lumière, dans mon ouïe de la lumière, dans ma vue de la lumière, au-dessus de moi de la lumière, au-dessous de moi de la lumière, à ma droite de la lumière, à ma gauche de la lumière, devant moi de la lumière, derrière moi de la lumière et mets dans mon âme de la lumière, intensifie-moi cette lumière, agrandis-moi cette lumière, procure-moi de la lumière, fais de moi une lumière. Ô Seigneur ! Donne-moi de la lumière, mets dans mes nerfs de la lumière, dans ma chair de la lumière, dans mon sang de la lumière, dans mes cheveux de la lumière et dans ma peau de la lumière. \r\n\r\nAllâhumma jcal fî qalbî nûran, wa fî lisânî nûran, wa fî samcî nûran, wa fî basarî nûran, wa min fawqî nûran, wa min tahtî nûran, wa can yamînî nûran, wa can shimâlî nûran, wa min amâmî nûran, wa min khalfî nûran. Wa jcal fî nafsî nûran, wa aczim lî nûran, wa cazzim lî nûran. Wa jcal lî nûran, wa jcalnî nûran. Allâhumma actinî nûran, wa jcal fî casabî nûran, wa fî lahmî nûran, wa fî damî nûran, wa fî shacrî nûran, wa fî basharî nûran.\r\n\r\n[Allâhumma jcal lî nûran fî qabrî, wa nûran fî cizâmî.]\r\n\r\n[Wa zidnî nûran, wa zidnî nûran, wa zidnî nûran.]\r\n\r\n[Wa hab lî nûran calâ nûr.]",
  "RepeatNumber": 1,
  "Tabweeb": "En allant à la mosquée"
 },
 {
  "ZekarID": 21,
  "ZekarText": "Au nom d'Allah, que la prière et le salut soient sur le Messager d'Allah. Ô Seigneur ! Je te demande de Ton immense générosité. Ô Seigneur ! Préserve-moi de Satan le maudit. \r\n\r\nBismi l-lâhi, wa s-salâtu wa s-salâmu calâ rasûli l-lâhi. Allâhumma innî as'aluka min fadlika. Allâhumma csimnî mina sh-shaytani r-rajîm.",
  "RepeatNumber": 1,
  "Tabweeb": "En sortant de la mosquée"
 },
 {
  "ZekarID": 22,
  "ZekarText": "[Répéter après le muezzin sauf après « Venez à la prière, accourrez au succès ! », alors on dit :] Il n'y a de puissance ni de force qu'en Allah. \r\n\r\n\r\n\r\nLâ hawla wa lâ quwwata illâ bi-l-lâhi.",
  "RepeatNumber": 1,
  "Tabweeb": "De l'appel à la prière"
 },
 {
  "ZekarID": 23,
  "ZekarText": "[Après que le muezzin ait dit : « J'atteste qu'il n'y a de divinité qu'Allah… », répéter, puis dire :] Moi aussi j'atteste qu'il n'y a de divinité qu'Allah Seul sans associé et que Mohammed est son esclave et Son messager : j'agrée Allah comme mon Seigneur, Mohammed comme messager et l'islam comme religion. \r\n\r\nWa anâ ash-hadu an lâ ilâha illâ l-lâhu, wahdahu lâ sharîka lâhu, wa anna Muhammadan cabduhu wa rasûluhu. Radîtu bi-l-lâhi rabban, wa bi-muhammadin rasûlan, wa bi-l-islâmi dînan.",
  "RepeatNumber": 1,
  "Tabweeb": "De l'appel à la prière"
 },
 {
  "ZekarID": 24,
  "ZekarText": "[Prier sur le Prophète (saws) à la fin de l'appel à la prière.] \r\n\r\nAllâhumma salli calâ sayyidinâ Muhammadin wa calâ âlihi wa sahbihi wa sallim.",
  "RepeatNumber": 1,
  "Tabweeb": "De l'appel à la prière"
 },
 {
  "ZekarID": 25,
  "ZekarText": "Et dire : « Ô Seigneur, Maître de cet appel parfait et de la prière que l'on va accomplir, donne à Mohammed le pouvoir d'intercéder (le Jour du Jugement) et la place d'honneur [au Paradis], et ressuscite-le dans la position louable que Tu lui as promise. (Car Tu ne manques jamais à Ta promesse).  \r\n\r\nAllâhumma rabba hâdhihi d-dacwati t-âmmati, wa s-salâti-l-qâ'imati.Âti Muhammadan al wasîlata wa-l-fadîlata, wa bcath-hu maqâman mahmûdan al-ladhî wacadtahu. [Innaka lâ tukhlifu-l-mîcâd.]",
  "RepeatNumber": 1,
  "Tabweeb": "De l'appel à la prière"
 },
 {
  "ZekarID": 26,
  "ZekarText": "[Invoquer Allah pour soi entre le premier appel et le second car l'invocation à ce moment-là n'est jamais rejetée.] ",
  "RepeatNumber": 1,
  "Tabweeb": "De l'appel à la prière"
 },
 {
  "ZekarID": 27,
  "ZekarText": "Ô Seigneur ! Eloigne de moi mes péchés comme Tu as éloigné l'orient de l'occident. Ô Seigneur ! Purifie-moi de mes pêchés comme on nettoie le vêtement blanc de sa saleté. Ô Seigneur ! Purifie-moi de mes péchés avec la neige, l'eau et la grêle. \r\n\r\nAllâhumma bacid baynî wa bayna khatâyâya kamâ bâcadta bayna-l-mashriqi wa-l-maghribi. Allâhumma naqqinî min khatâyâya kamâ yunaqqa th-thawbu-l-abyadu mina d-danasi. Allâhumma ghsilnî min khatâyâya bi th-thalji wa-l-mâ'i wa-l-barad.",
  "RepeatNumber": 1,
  "Tabweeb": "De l'ouverture de la prière"
 },
 {
  "ZekarID": 28,
  "ZekarText": "Gloire et pureté à Toi, ô Seigneur et à Toi la louange. Que Ton nom soit béni, que Ta majesté soit élevée et il n'y a d'autre divinité en dehors de Toi. \r\n\r\nSubbhânaka l-lâhumma wa bi-hamdika, wa tabâraka smuka wa tacâla jadduka, wa lâ ilâha ghayruka.",
  "RepeatNumber": 1,
  "Tabweeb": "De l'ouverture de la prière"
 },
 {
  "ZekarID": 29,
  "ZekarText": "Je tourne mon visage vers Celui qui a créé les cieux et la terre en pur monothéisme et je ne suis point du nombre des associateurs. En vérité, ma prière, mes actes de dévotion (ou sacrifice, immolation), ma vie et ma mort appartiennent à Allah, Seigneur de l'univers. Nul associé avec Lui, voilà ce qui m'a été ordonné et je fais partie de ceux qui se soumettent. Ô Seigneur, c'est Toi le Roi, il n'y a point de divinité en dehors de Toi. Tu es mon Seigneur et je suis Ton adorateur, je me suis fait du tort à moi-même et je reconnais mon péché, pardonne-moi tous mes péchés car il n'y a personne qui pardonne les péchés sauf Toi.\r\nGuide-moi, Seigneur, vers le meilleur comportement car il n'y a personne qui m'y conduise sauf Toi. Et épargne-moi le mauvais comportement car il n'y a personne qui m'en épargne sauf Toi. Me voilà, ô Allah, tout le bien est entre Tes Mains et le mal ne peut provenir de Toi, je (n'existe) que par Toi et je (retourne) vers Toi, soit béni et élevé, je Te demande pardon et je me repentis à Toi. \r\n\r\nWajjahtu wajhiya li-l-ladhî fatara s-samâwâti wa-l-arda, hanîfan wa mâ anâ mina-l-mushrikîna. Inna salâti wa nusukî, wa mahyâya wa mamâtî li-l-lâhi rabbi-l-câlamîna, lâ sharîka lahu. Wa bi-dhâlika umirtu wa anâ mina-l-muslimîna. Allâhumma anta-l-maliku lâ ilâha illâ anta. Anta rabbî wa anâ cabduka, zalamtu nafsî wa ctaraftu bi-dhanbî. Fa-ghfir lî dhunûbî jamîcan, innahu lâ yaghfiru dh-dhunûba illâ anta. Wa hdinî li-ahsani-l-akhlâqi, lâ yahdî li-ahsanihâ illâ anta. Wa srif cannî sayyi'ahâ, lâ yasrifu cannî sayy'ahâ illâ anta. Labbayka wa sacdayka, wa-l-khayru kulluhu bi-yadayka, wa sh-sharru laysa ilayka, anâ bika wa ilayka, tabârakta wa tacâlayta, astaghfiruka wa atûbu ilayka.",
  "RepeatNumber": 1,
  "Tabweeb": "De l'ouverture de la prière"
 },
 {
  "ZekarID": 30,
  "ZekarText": "Ô Seigneur Maître de Jibrîl (Gabriel), de Mikâ'îl (Michaël) et d'Isrâfil, Créateur des cieux et de la terre, Celui qui connaît parfaitement le monde invisible et le monde visible, c'est Toi qui jugeras entre Tes serviteurs ce sur quoi ils divergeaient. Guide-moi dans ce sur quoi on a divergé en matière de vérité avec Ta permission car Tu guides certainement qui Tu veux vers le droit chemin. \r\n\r\nAllâhumma, rabba Jibrâ'îla, wa Mîkâ'îla, wa Isrâfîla ! Fâtira s-samâwâti wa-l-ardi, câlima l-ghaybi wa sh-shahâdati, anta tahkumu bayna cibâdika fîmâ kânû fîhi yakhtalifûna. Ihdinî li-mâ khtulifa fîhi mina-l-haqqi bi-idhnika. Innaka tahdî man tashâ'u ilâ sirâtîn mustaqîm.",
  "RepeatNumber": 1,
  "Tabweeb": "De l'ouverture de la prière"
 },
 {
  "ZekarID": 31,
  "ZekarText": "Allah est le Plus grand, Allah est le Plus grand, Allah est le Plus grand et louange à Allah en abondance et louange à Allah en abondance et louange à Allah en abondance. Gloire à Allah matin et soir. (trois fois de suite)\r\nJe cherche protection auprès d'Allah contre le diable : contre ses insufflations, son inspiration (maléfique) et sa tentation. \r\n\r\nAllâhu akbaru kabîran. Allâhu akbaru kabîran. Allâhu akbaru kabîran. Wa-l-hamdu li-l-âhi kathîran. Wa-l-hamdu li-l-âhi kathîran. Wa-l-hamdu li-l-âhi kathîran. Wa subhâna l-lâhi bukratan wa asîlan. (3 fois),\r\npuis : Acûdhu bi-l-lâhi mina sh-shaytâni min nafkhihi, wa naftihi, wa hamzihi.",
  "RepeatNumber": 1,
  "Tabweeb": "De l'ouverture de la prière"
 },
 {
  "ZekarID": 32,
  "ZekarText": "Ô Seigneur ! A Toi la louange, Tu es la lumière des cieux et de la terre et tous ceux qui s'y trouvent. A Toi la louange, Tu es celui qui administre les cieux et la terre et tous ceux qui s'y trouvent. (A Toi la louange, Tu es le Seigneur des cieux et de la terre et tous ceux qui s'y trouvent.) (A Toi la louange, à Toi la royauté des cieux et de la terre et tous ceux qui s'y trouvent). (A Toi la louange, Tu es le Maître des cieux et de la terre.) (A Toi la louange,) (Tu es la vérité, Ta promesse est vérité, Ta parole est vérité, Ta rencontre (le Jour du Jugement) est vérité, le Paradis est vérité, l'Enfer est vérité, les prophètes sont vérité et Mohammed saws est vérité et l'Heure (du Jugement) est vérité) (Ô Seigneur, c'est à Toi que je me suis soumis, en Toi que je place ma confiance, je crois en Toi et vers Toi je reviens en toute chose. Par Toi je combats (Tes ennemis) et par Ta loi j'ai jugé. Pardonne-moi donc mes péchés passés et futurs, ceux commis en secret et ceux commis en public.) (C'est toi qui fais avancer et qui fais reculer, nulle divinité autre que Toi.) (Tu es mon objet d'adoration, nulle divinité autre que Toi.)  \r\n\r\nAllâhumma laka-l-hamdu anta nûru s-samâwâti wa-l-ardi wa man fîhinn. Wa laka-l-hamdu. Anta qayyimu s-samâwâti wa-l-ardi wa man fîhinn, [Wa laka-l-hamdu. Anta rabbu s-samâwâti wa-l-ardi wa man fîhinna.] [Wa laka-l-hamdu. Laka mulku s-samâwâti wa-l-ardi wa man fîhinn.] [Wa laka-l-hamdu. Anta maliku s-samâwâti wa-l-ardi.] [Wa laka-l-hamdu.] [Anta-l-haqqu, wa wacduka-l-haqqu, wa qawluka-l-haqqu, wa liqâ'uka-l-haqqu, wa-l-jannatu haqqun, wa n-nâru haqqun, wa n-nabiyyûna haqqun, wa Muhammadun haqqun, wa s-sâcatu haqqun.] [Allâhumma laka aslamtu, wa calayka tawwakaltu, wa bika âmantu, wa ilayka anabtu, wa bika khâsamtu, wa ilayka hâkamtu.\r\nFa-ghfir lî mâ qaddamatu, wa mâ akhkhartu, wa mâ asrartu, wa mâ aclantu.]\r\n[Anta-l-muqaddimu wa anta-l-mu'akhkhiru. Lâ ilâha illâ anta.] [Anta ilâhî lâ ilâha illâ anta.]",
  "RepeatNumber": 1,
  "Tabweeb": "De l'ouverture de la prière"
 },
 {
  "ZekarID": 33,
  "ZekarText": "Gloire et pureté à mon Seigneur le Très grand. (trois fois de suite au moins) \r\n\r\nSubhâna rabbiya-l-cazîm",
  "RepeatNumber": 3,
  "Tabweeb": "De l'inclinaison"
 },
 {
  "ZekarID": 34,
  "ZekarText": "Gloire et pureté à Toi, notre Seigneur et à Toi la louange. Ô Seigneur ! Pardonne-moi. \r\n\r\nSubhânaka l-lâhumma rabbanâ wa bi-hamdika. Allâhumma ghfir lî.",
  "RepeatNumber": 1,
  "Tabweeb": "De l'inclinaison"
 },
 {
  "ZekarID": 35,
  "ZekarText": "Très digne de glorification et très digne de sanctification, Seigneur des Anges et du Saint-Esprit (Gabriel).  \r\n\r\nSubbûhun, quddûsun, rabbu-l-malâ'ikati wa r-rûh.",
  "RepeatNumber": 3,
  "Tabweeb": "De l'inclinaison"
 },
 {
  "ZekarID": 36,
  "ZekarText": "Ô Seigneur ! C'est pour Toi que je m'incline, c'est en Toi que j'ai cru et à Toi que je me suis entièrement soumis. Mon ouïe, ma vue, mon cerveau, mes os et mes nerfs et tout ce sur quoi mes pieds reposent, sont humbles devant Toi. \r\n\r\nAllâhumma laka rakactu, wa bika âmantu, wa laka 'aslamtu. Khashaca laka samcî, wa basarî, wa mukhkhî, wa cazmî, wa cassabî wa mâ staqalla bihi qadamî.",
  "RepeatNumber": 1,
  "Tabweeb": "De l'inclinaison"
 },
 {
  "ZekarID": 37,
  "ZekarText": "Gloire à Celui qui est digne de détenir le pouvoir absolu, de détenir la souveraineté absolue, digne d'être orgueilleux et de détenir la grandeur absolue. \r\n\r\nSubhâna dhî-l-jabarûti, wa-l-malakûti, wa-l-kibriyâ'i, wa-l-cazamati.",
  "RepeatNumber": 1,
  "Tabweeb": "De l'inclinaison"
 },
 {
  "ZekarID": 38,
  "ZekarText": "Allah a entendu celui qui L'a loué. \r\n\r\nSamica l-lâhu liman hamidah.",
  "RepeatNumber": 1,
  "Tabweeb": "En se redressant de l'inclinaison"
 },
 {
  "ZekarID": 39,
  "ZekarText": "Ô Seigneur ! A Toi la louange, une louange abondante, pure et bénie. \r\n\r\nRabbanâ wa laka-l-hamdu, hamdan kathîran, tayyiban, mubârakan fîhi.",
  "RepeatNumber": 1,
  "Tabweeb": "En se redressant de l'inclinaison"
 },
 {
  "ZekarID": 40,
  "ZekarText": "Plein les cieux et plein la terre et ce qu'il y a entre les deux. Et plein de tout ce que Tu voudras au-delà de cela. Tu es digne d'éloges et de grandeur, c'est la parole la plus véridique que le serviteur puisse dire et nous sommes tous Tes serviteurs. Nul ne peut retenir ce qu Tu as donné et nul ne peut donner ce que Tu as retenu. Le fortuné ne trouvera dans sa fortune aucune protection efficace contre Toi. \r\n\r\nMil'a s-samâwâti wa mil'a-l-ardi wa mâ baynahumâ, wa mil'a mâ shi'ta min shay'in bacdu. Ahlu th-thanâ'i wa-l-majdi. Ahaqqu mâ qâla-l-cabdu, wa kullunâ laka cabdun. Allâhumma lâ mânica li-mâ actyta, wa lâ muctiya limâ manacta, wa lâ yanfacu dhâ-l-jaddi minka-m-jaddu.",
  "RepeatNumber": 1,
  "Tabweeb": "En se redressant de l'inclinaison"
 },
 {
  "ZekarID": 41,
  "ZekarText": "Gloire et pureté à mon Seigneur le Très-Haut. [trois fois de suite au moins] \r\n\r\nSubhâna rabbiya-l-aclâ.",
  "RepeatNumber": 3,
  "Tabweeb": "De la prosternation"
 },
 {
  "ZekarID": 42,
  "ZekarText": "Gloire et pureté à Toi, notre Seigneur et à Toi la louange. Ô Seigneur ! Pardonne-moi. \r\n\r\nSubhânaka l-lâhumma rabbanâ wa bi-hamdika. Allâhumma ghfir lî.",
  "RepeatNumber": 1,
  "Tabweeb": "De la prosternation"
 },
 {
  "ZekarID": 43,
  "ZekarText": "Très digne de glorification et très digne de sanctification, Seigneur des Anges et du Saint-Esprit. \r\n\r\nSubbûhun, quddûsun, rabbu-l-malâ'ikati wa r-rûh.",
  "RepeatNumber": 1,
  "Tabweeb": "De la prosternation"
 },
 {
  "ZekarID": 44,
  "ZekarText": "Ô Seigneur ! C'est devant Toi que je me prosterne, c'est en Toi que j'ai cru et à Toi que je me suis entièrement soumis. Mon visage s'est prosterné devant Celui qui l'a créé, lui a donné sa forme, son ouïe et sa vue. Béni soit Allah, le Meilleur des créateurs. \r\n\r\nAllâhumma laka sajadtu, wa bika âmantu, wa laka 'aslamtu. Sajada wajhî li-l-ladhî khalaqahu wa sawwarahu wa shaqqa samcahu wa basarahu. Tabâraka l-lâhu ahsanu-l-khâliqîn.",
  "RepeatNumber": 1,
  "Tabweeb": "De la prosternation"
 },
 {
  "ZekarID": 45,
  "ZekarText": "Gloire à Celui qui est digne de détenir le pouvoir absolu, de détenir la souveraineté absolue, digne d'être Orgueilleux et d'avoir la grandeur absolue. \r\n\r\nSubhâna dhî-l-jabarûti, wa-l-malakûti, wa-l-kibriyâ'i, wa-l-cazamati.",
  "RepeatNumber": 1,
  "Tabweeb": "De la prosternation"
 },
 {
  "ZekarID": 46,
  "ZekarText": "Ô Seigneur ! Pardonne-moi tous mes péchés, les plus bénins comme les plus graves, les premiers comme les derniers, ceux commis en public cet ceux commis en secret. \r\n\r\nAllâhumma ghfir lî dhanbî kullahu, diqqahu wa jillahu, wa awwalahu wa âkhirahu, wa calâniyyatahu wa sirrahu.",
  "RepeatNumber": 1,
  "Tabweeb": "De la prosternation"
 },
 {
  "ZekarID": 47,
  "ZekarText": "Ô Seigneur ! Je cherche protection auprès de Ta satisfaction contre Ta colère, auprès de Ton pardon contre Ton châtiment et auprès de Toi contre Toi-même. Je ne pourrais Te louer autant que Tu T'es loué Toi-même. \r\n\r\nAllâhumma innî acûdhu bi-ridâka min sakhatika, wa bi-mucâfâtika min cuqûbatika. Wa acûdhu bika minka. Lâ uhsî thanâ'an calayka, anta kamâ athnayta calâ nafsika.",
  "RepeatNumber": 1,
  "Tabweeb": "De la prosternation"
 },
 {
  "ZekarID": 48,
  "ZekarText": "Ô Seigneur ! Pardonne-moi. Ô Seigneur ! Pardonne-moi. \r\n\r\nRabbi ghfir lî ! Rabbi ghfir lî !",
  "RepeatNumber": 1,
  "Tabweeb": "Entre les deux prosternations"
 },
 {
  "ZekarID": 49,
  "ZekarText": "Ô Seigneur ! Pardonne-moi, accorde-moi Ta miséricorde, guide-moi, panse mes blessures, assure-moi le salut, procure-moi ma subsistance et élève-moi. \r\n\r\nAllâhumma ghfir lî, wa rhamnî, wa hdinî, wa jburnî, wa câfinî, wa rzuqnî, wa rfacnî.",
  "RepeatNumber": 1,
  "Tabweeb": "Entre les deux prosternations"
 },
 {
  "ZekarID": 50,
  "ZekarText": "Mon visage s'est prosterné devant Celui qui l'a créé, lui a procuré son ouïe et sa vue par Sa force et Sa puissance. (Gloire donc à Allah le Meilleur des créateurs.) \r\n\r\nSajada wajhî li-l-ladhî khalaqahu wa sawwarahu wa shaqqa samcahu wa basarahu bi-hawlihi wa quwwatihi, fa tabâraka l-lâhu ahsanu-l-khâliqîn.",
  "RepeatNumber": 1,
  "Tabweeb": "De la prosternation de la récitation du Coran"
 },
 {
  "ZekarID": 51,
  "ZekarText": "Ô Seigneur ! Inscris-moi grâce à elle (cette prosternation) une rétribution auprès de Toi, décharge-moi grâce à elle d'un fardeau, réserve-la-moi auprès de Toi comme une provision et accepte-la de ma part comme Tu l'as accepté de Ton serviteur Dâwûd (David). \r\n\r\nAllâhumma ktub lî bihâ cindaka ajran, wa dac cannî bihâ wizran, wa jcalhâ lî cindaka dhukhran, wa taqabbalhâ minnî kamâ taqabbaltahâ min cabdika Dâwûd.",
  "RepeatNumber": 1,
  "Tabweeb": "De la prosternation de la récitation du Coran"
 },
 {
  "ZekarID": 52,
  "ZekarText": "Les salutations sont pour Allah ainsi que les prières et les bonnes œuvres. Que le salut soit sur toi, ô Prophète ainsi que la miséricorde d'Allah et Ses bénédictions. Que le salut soit sur nous et sur les serviteurs d'Allah vertueux. J'atteste qu'il n'y a d'autre divinité à part Allah et j'atteste que Mohammed est Son esclave et Son messager. \r\n\r\nAt-tahiyyâtu li-l-lâhi, wa s-salawâtu wa t-tayyibâtu. As-salâmu calayka ayyuhâ n-nabiyyu wa rahmatu l-lâhi wa barakâtuhu. As-salâmu calaynâ wa calâ cibâdi l-lâhi s-sâlihîna. Ash-hadu an lâ ilâha illâ l-lâhu, wa ash-hadu anna Muhammadan cabduhu wa rasûluhu.",
  "RepeatNumber": 1,
  "Tabweeb": "L'attestation de foi"
 },
 {
  "ZekarID": 53,
  "ZekarText": "Ô Seigneur ! Prie sur Mohammed et sur la famille de Mohammed comme Tu as prié sur Ibrâhîm (Abraham) et sur la famille de Ibrâhîm, Tu es certes digne de louange et de glorification. Ô Seigneur ! Bénis Mohammed et la famille de Mohammed comme Tu as béni Ibrâhîm et la famille d'Ibrâhîm, Tu es certes digne de louange et de glorification. \r\n\r\nAllâhumma salli calâ Muhammadin wa calâ âli Muhammadin kamâ sallayta calâ Ibrâhîma wa calâ âli Ibrâhîma. Innaka hamîdun, majîd. Allâhumma bârik calâ Muhammadin wa calâ âli Muhammadin kamâ bârakta calâ Ibrâhîma wa calâ âli Ibrâhîma. Innaka hamîdun, majîd.",
  "RepeatNumber": 1,
  "Tabweeb": "La prière sur le Prophète (saws) après l'attestation de foi"
 },
 {
  "ZekarID": 54,
  "ZekarText": "Ô Seigneur ! Je cherche protection auprès de Toi contre les tourments de la tombe, contre le supplice de l'Enfer, contre la tentation de la vie et de la mort et contre le mal de la tentation de l'Antéchrist. \r\n\r\nAllâhumma innî acûdhu bika min cadhâbi-l-qabri, wa min cadhâbi jahannama, wa min fitnati-l-mahyâ wa-l-mamâti, wa min sharri fitnati-l-masîhi d-dajjâl.",
  "RepeatNumber": 1,
  "Tabweeb": "Après le dernier Tachahhud juste avant les salutations"
 },
 {
  "ZekarID": 55,
  "ZekarText": "Ô Seigneur ! Je cherche protection auprès de Toi contre les tourments de la tombe, je cherche protection auprès de Toi contre la tentation de l'Antéchrist, et je cherche protection auprès de Toi contre la tentation de la vie et de la mort. Ô Seigneur ! Je cherche protection auprès de Toi contre les causes qui mènent au péché et contre la dette difficile à acquitter. \r\n\r\nAllâhumma innî acûdhu bika min cadhâbi-l-qabri, wa acûdhu bika min fitnati-l-masîhi d-dajjâl, wa acûdhu bika min fitnati-l-mahyâ wa-l-mamâti. Allâhumma innî acûdhu bika mina-l-ma'thami wa-l-maghrami.",
  "RepeatNumber": 1,
  "Tabweeb": "Après le dernier Tachahhud juste avant les salutations"
 },
 {
  "ZekarID": 56,
  "ZekarText": "Ô Seigneur ! Je me suis fait beaucoup de tort à moi-même et il n'y a personne qui puisse pardonner les péchés sauf Toi. Pardonne-moi donc d'un pardon de Ta part et accorde-moi Ta miséricorde. Certes, c'est Toi le Pardonneur, le Très Miséricordieux. \r\n\r\nAllâhumma innî zalamtu nafsî zulman kathîran, wa lâ yaghfiru dh-dhunûba illâ anta. Fa-ghfir lî maghfiratan min cindika, wa rhamnî, innaka anta-l-ghafûru r-rahîm.",
  "RepeatNumber": 1,
  "Tabweeb": "Après le dernier Tachahhud juste avant les salutations"
 },
 {
  "ZekarID": 57,
  "ZekarText": "Ô Seigneur ! Pardonne-moi mes péchés passés et futurs, cachés et dévoilés, que j'ai commis en excès et que Tu connais mieux que moi. C'est Toi qui fais avancer et c'est Toi qui fais reculer. Il n'y a point de divinité sauf Toi. \r\n\r\nAllâhumma ghfir lî mâ qaddamatu, wa mâ akhkhartu, wa mâ asrartu, wa mâ aclantu, wa mâ asraftu, wa mâ anta aclamu bihi minnî. Anta-l-muqaddimu wa anta-l-mu'akhkhiru. Lâ ilâha illâ anta.",
  "RepeatNumber": 1,
  "Tabweeb": "Après le dernier Tachahhud juste avant les salutations"
 },
 {
  "ZekarID": 58,
  "ZekarText": "Ô Seigneur ! Aide-moi à T’invoquer, à Te remercier et à T’adorer de la meilleure manière. \r\n\r\nAllâhumma acinnî calâ dhikrika, wa shukrika, wu husni cibâdatik.",
  "RepeatNumber": 1,
  "Tabweeb": "Après le dernier Tachahhud juste avant les salutations"
 },
 {
  "ZekarID": 59,
  "ZekarText": "Ô Seigneur ! Je cherche protection auprès de Toi contre l’avarice. Je cherche protection auprès de Toi contre la lâcheté. Je cherche protection auprès de Toi de retomber à l’âge le plus vil. Je cherche protection auprès de Toi contre la tentation de ce bas monde et contre celle de la tombe. \r\n\r\nAllâhumma innî acûdhu bika min al bukhli, wa acûdhu bika min al jubni, wa acûdhu bika min an uradda ilâ ardhali-l-cumur. Wa acûdhu bika min fitnati d-dunyâ wa cadhâbi-l-qabri.",
  "RepeatNumber": 1,
  "Tabweeb": "Après le dernier Tachahhud juste avant les salutations"
 },
 {
  "ZekarID": 60,
  "ZekarText": "Ô Seigneur ! Je te demande le Paradis et je me mets sous Ta protection contre l’Enfer. \r\n\r\nAllâhumma innî as'aluka-l-jannata wa acûdhu bika mina n-nar.",
  "RepeatNumber": 1,
  "Tabweeb": "Après le dernier Tachahhud juste avant les salutations"
 },
 {
  "ZekarID": 61,
  "ZekarText": "Ô Seigneur ! Avec Ta connaissance de l’invisible et Ton pouvoir sur les créatures, laisse-moi vivre tant que Tu sais que la vie est meilleure pour moi (que la mort) et fais-moi mourir si Tu sais que la mort est meilleure pour moi (que la vie). Ô Seigneur ! Je Te demande la crainte en secret et en public. Je Te demande la parole de vérité dans les moments de satisfaction et de colère. Je Te demande la modération dans les situations de richesse et de pauvreté. Je Te demande un bien-être qui ne s’épuise pas. Je Te demande une jouissance pour les yeux qui ne s’arrête pas. Je Te demande d’être agréé après que Tu aies prononcé Ton Jugement. Je Te demande une vie paisible après la mort. Je te demande la réjouissance de pouvoir voir Ton Visage et le désir ardent de Te rencontrer sans subir aucun dommage qui me nuise, ni de tentation qui m’égare. Ô Seigneur ! Embellis-nous avec la parure de la croyance et rends-nous des guides bien guidés. \r\n\r\nAllâhumma, bi-cilmika-l-ghayba wa qudratika calâ-l-khalqi, ahyinî mâ calimta-l-hayâta khayran lî, wa tawwafanî idhâ calimta-l-wafâta khayran lî. Allâhumma innî as'aluka khashyataka fî-l-ghaybi wa sh-shahâdati. Wa as'aluka kalimata-l-haqqi fî r-ridâ wa-l-ghadabi. Wa as'aluka-l-qasda fî-l-ghinâ wa-l-faqri. Wa as'aluka nacîman lâ yanfadu wa as'aluka qurrata caynin lâ tanqaticu. Wa as'aluka r-ridâ bacda-l-qadâ, wa as'aluka barda-l-cayshi bacda-l-mawti. Wa as'aluka ladhdhata n-nazari ilâ wajhika wa sh-shawqa ilâ liqâ'ika fî ghayri darrâ'a mudirratin wa lâ fitnatin mudillatin. Allâhumma zayyinnâ bi-zînati-l-îmâni, wa jcalnâ hudâtan muhtadîn.",
  "RepeatNumber": 1,
  "Tabweeb": "Après le dernier Tachahhud juste avant les salutations"
 },
 {
  "ZekarID": 62,
  "ZekarText": "Ô Seigneur ! Je Te demande, ô Allah, parce que certes Tu es l’Unique, le Seul, le Recours Suprême, Celui qui n’a jamais enfanté et n’a pas été enfanté, et nul ne Lui est semblable, de m’absoudre de mes péchés ; c’est Toi le Pardonneur, le Très Miséricordieux. \r\n\r\nAllâhumma innî as'aluka, yâ Allâhu, bi-annaka-l-wâhidu-l-ahadu s-samadu, al-ladhî lam yalid wa lam yûlad, wa lam yakun lahu kufuan ahadun, an taghfira lî dhunûbî. Innaka anta-l-ghafûru r-rahîm.",
  "RepeatNumber": 1,
  "Tabweeb": "Après le dernier Tachahhud juste avant les salutations"
 },
 {
  "ZekarID": 63,
  "ZekarText": "Ô Seigneur ! Je Te demande, et à Toi la louange, il n’est d’autre divinité que Toi, Seul, sans associé, le Bienfaiteur. Ô Créateur des cieux et de la terre. Ô Seigneur Plein de majesté et de munificence. Ô le Vivant, Celui qui veille éternellement à la bonne marche de toute chose, je Te demande le Paradis et je me mets sous Ta protection contre l’Enfer. \r\n\r\nAllâhumma innî as'aluka bi-anna laka-l-hamd, lâ ilâha illâ anta wahdaka lâ sharîka laka, al mannânu. Yâ badîcu s-samâwâti wa-l-ardi ! Yâ dhâ-l-jalâli wa-l-ikrâmi. Yâ hayyu, yâ qayyûmu ! Innî as'aluka-l-jannata wa acûdhu bika mina n-nâr.",
  "RepeatNumber": 1,
  "Tabweeb": "Après le dernier Tachahhud juste avant les salutations"
 },
 {
  "ZekarID": 64,
  "ZekarText": "Ô Seigneur ! Je Te demande de par le fait que j’atteste qu’il n’y a d’autre divinité que Toi, l’Unique, le Recours Suprême, Celui qui n’a jamais enfanté et n’a pas été enfanté, et nul ne Lui est semblable. \r\n\r\nAllâhumma innî as'aluka bi-annî ash-hadu annaka anta l-lâhu lâ ilâha ukkâ anta-l-ahadu s-samadu, al-ladhî lam yalid wa lam yûlad, wa lam yakun lahu kufuan ahad.",
  "RepeatNumber": 1,
  "Tabweeb": "Après le dernier Tachahhud juste avant les salutations"
 },
 {
  "ZekarID": 65,
  "ZekarText": "Je demande pardon à Allah [trois fois]. Ô Seigneur ! Tu es la Paix et la paix vient de Toi. Béni sois-Tu, ô Digne de glorification et de munificence. \r\n\r\nAstaghfiru l-lâha (3 fois). Allâhumma anta s-salâmu wa minka s-salâmu, tabârakta yâ dhâ-l-jalâli wa-l-ikrâm.",
  "RepeatNumber": 3,
  "Tabweeb": "Après la prière"
 },
 {
  "ZekarID": 66,
  "ZekarText": "Il n’y a d’autre divinité qu’Allah Unique, sans associé. A Lui la royauté, à Lui la louange et Il est capable de toute chose. Il n’y a de puissance ni de force qu’en Allah. Nulle divinité sauf Allah et nous n’adorons que Lui, la grâce et la générosité sont à Lui. C’est à Lui que vont les belles formules de louange. Nulle divinité sauf Allah. Nous Lui vouons un culte exclusif en dépit de la haine des incrédules. \r\n\r\nLâ ilâha illâ l-lâhu, wahdahu lâ sharîka lahu, lahu-l-mulku wa lahu-l-hamdu wa huwa calâ kulli shay'in qadîrun. Lâ hawla wa lâ quwwata illâ bi-l-lâhi.Lâ ilâha illâ l-lâhu, wa lâ nacbudu illâ iyyâhu, lahu n-nicmatu wa lahu-l-fadlu wa lahu th-thanâ'u-l-hasanu. Lâ ilâha illâ l-lâhu, mukhlisîna lahu d-dîna wa law kariha-l-kâfirûn.",
  "RepeatNumber": 1,
  "Tabweeb": "Après la prière"
 },
 {
  "ZekarID": 67,
  "ZekarText": "Il n’y a d’autre divinité qu’Allah, Unique, sans associé. A Lui la royauté, à Lui la louange et Il est capable de toute chose. Ô Seigneur ! Nul ne peut retenir ce que Tu as donné et nul ne peut donner ce que Tu as retenu. Le fortuné ne trouve dans sa fortune aucune protection efficace contre Toi. \r\n\r\nLâ ilâha illâ l-lâhu, wahdahu lâ sharîka lahu, lahu-l-mulku wa lahu-l-hamdu wa huwa calâ kulli shay'in qadîr. Allâhumma lâ mânica limâ actayta wa lâ muctiya limâ manacta wa lâ yanfacu dhâ-l-jaddi minka-l-jaddu.",
  "RepeatNumber": 3,
  "Tabweeb": "Après la prière"
 },
 {
  "ZekarID": 68,
  "ZekarText": "Gloire à Allah et la Louange est à Allah et Allah est le Plus Grand [trente-trois fois]. Il n’y a d’autre divinité qu’Allah l’Unique, sans associé. A Lui la royauté, à Lui la louange et Il est capable de toute chose. \r\n\r\nSubhâna l-lâhi, wa-l-hamdu li-l-lâhi, wa l-lâhu akbar (33 fois). Lâ ilâha illâ l-lâhu, wahdahu lâ sharîka lahu, lahu-l-mulku wa lahu-l-hamdu wa huwa calâ kulli shay'in qadîr.",
  "RepeatNumber": 33,
  "Tabweeb": "Après la prière"
 },
 {
  "ZekarID": 69,
  "ZekarText": "Au Nom d’Allah le Tout Miséricordieux le Très Miséricordieux : « Dis : C’est Lui Allah Seul et Unique ; Allah le Seul à être imploré pour ce que nous désirons ; Il n’a jamais engendré ni n’a été engendré ; et nul n’est égal à Lui. » [Sourate Al-Ikhlâs]\r\n\r\nAu Nom d’Allah le Tout Miséricordieux le Très Miséricordieux : « Dis : Je cherche protection auprès du Seigneur de l’aube naissante ; contre le mal des êtres qu’Il a créés ; contre le mal de l’obscurité quand elle s’approfondit ; contre le mal de celles qui soufflent sur les nœuds ; et contre le mal de l’envieux quand il envie. » [Sourate Al-Falaq]\r\n\r\nAu Nom d’Allah le Tout Miséricordieux le Très Miséricordieux : « Dis : Je cherche protection auprès du Seigneur des hommes ; le Souverain des hommes ; Dieu des hommes ; contre le mal du mauvais conseiller furtif ; qui souffle le mal dans les poitrines des hommes ; qu’il soit djinn ou être humain. [Sourate An-Nâss]\r\n\r\n[trois fois chaque sourate] [après chaque prière] \r\n\r\nBismi l-lâhi r-rahmâni r-rahîmi.\r\nQul huwa l-lâhu ahad. Allâhu s-samad, Lam yalid wa lam yûlad, wa lam yakun lahu kufuan ahad.\r\n\r\nBismi l-lâhi r-rahmâni r-rahîmi.\r\nQul acûdhu bi-rabbi-l-falaq, min sharri mâ khalaq, wa min sharri ghâsiqin idhâ waqab, wa min sharri n-naffâthâti fî-l-cuqad, wa min sharri hâsidin idhâ hasad.\r\n\r\nBismi l-lâhi r-rahmâni r-rahîmi.\r\nQul acûdhu bi-rabbi n-nâs, maliki n-nâs, ilâhi n-nâs, min sharri-l-waswâsi-l-khannâs, al-ladhî yuwaswisu fî sudûri n-nâs, mina-l-jinnati wa n-nâs.",
  "RepeatNumber": 1,
  "Tabweeb": "Après la prière"
 },
 {
  "ZekarID": 70,
  "ZekarText": "Allah ! Nulle divinité autre que Lui, le Vivant qui veille éternellement à la bonne marche de toute chose. NI somnolence ni sommeil ne Le saisissent. A Lui appartient tout ce qui est dans les cieux et sur la terre. Qui peut intercéder auprès de Lui sans Sa permission ? Il sait leur passé et leur futur. Et ils ne savent de sa science que ce qu’Il veut. Son trône (Kursî) déborde les cieux et la terre dont la garde ne Lui coûte aucune peine. Et Il est le Très Haut, le Très Grand. [après chaque prière] \r\n\r\nAllâhu lâ ilâha illâ huwa-l-hayyu-l-qayyûm. Lâ ta'khudhuhu sinatun wa lâ nawm, lahu mâ fî s-samâwâti wa mâ fî-l-ard. Man dhâ l-ladhî yashfacu cindahu illâ bi-idhnihi. Yaclamu mâ bayna aydîhim wa mâ khalfahum. Wa lâ yuhîtûna bi-shay'in min cilmihi illâ bi-mâ shâ'a. Wasica kursiyyuhu s-samâwâti wa-l-ard. Wa lâ ya'ûduhu hifzuhumâ, wa huwa-l-caliyyu-l-cazîm.",
  "RepeatNumber": 1,
  "Tabweeb": "Après la prière"
 },
 {
  "ZekarID": 71,
  "ZekarText": "‘il n’y a pas de divinité en dehors de Dieu, l’Unique, il\r\nn’a pas d’associé, à Lui la Souveraineté, à Lui la\r\nLouange, il donne la vie et il fait mourir. il est capable\r\nsur toute chose.’\r\n(dix fois après les prières du Maghrib et du Fadjr)",
  "RepeatNumber": 10,
  "Tabweeb": "Après la prière"
 },
 {
  "ZekarID": 72,
  "ZekarText": "Ô Seigneur ! Je Te demande un savoir utile, une bonne subsistance et des œuvres agréées. [après la prière du Fajr] \r\n\r\nAllâhumma innî as'aluka cilman nâfican, wa rizqan tayyiban, wa camalan mutaqabbalan.",
  "RepeatNumber": 1,
  "Tabweeb": "Après la prière"
 },
 {
  "ZekarID": 73,
  "ZekarText": "Jâber Ibn ‘Abdullah – qu’Allah les agrée tous les deux – a rapporté : « Le Messager d’Allah (sws) nous enseignait la consultation dans toutes les décisions à prendre comme il nous enseignait le Coran. » Il disait : « Lorsque l’un de vous décide de faire quelque chose, qu’il fasse deux rak’ât autres que les prières obligatoires, puis qu’il dise :\r\n\r\nÔ Seigneur ! Je Te consulte de par Ta connaissance et je T’implore de m’accorder le pouvoir de Ton pouvoir et je Te demande cde Ton immense générosité. Car Tu es certes capable et je suis incapable, Tu sais tout tandis que moi je ne sais pas, et c’est Toi le Grand Connaisseur de tout ce qui est inconnu. Ô Seigneur ! Si Tu sais que cette chose – et il nomme clairement la chose en question – est une source de bien pour moi dans ma religion, dan s ma vie présente et dans ma vie future (ou il dit : ici-bas et dans l’au-delà) destine-la-moi et facilite-la-moi puis bénis-la-moi. Et si Tu sais que cette chose est pour moi une source de mal dans ma religion, dans ma vie présente et dans ma vie future (ou il dit : ici-bas et dans l’au-delà) détourne-la de moi et détourne-moi d’elle et prédestine-moi le bien là où il se trouve puis rends-moi satisfait de cette décision.\r\n\r\nN’éprouvera jamais de remords celui qui consulte son Seigneur et prend conseil auprès des hommes croyants vertueux et agit avec détermination dans toutes ses affaires, Allah le Glorieux a dit : « Et consulte-les à propos des affaires, puis une fois que tu t’es décidé, confie-toi donc à Allah. » \r\n\r\nAllâhumma innî astakhîruka bi-cilmika wa astaqdiruka bi-qudratika, wa as-aluka min fadlika-l-cazîmi. Fa-innaka taqdiru wa lâ aqdiru, wa taclamu wa lâ aclamu, wa anta callâmu-l-ghuyûbi. Allâhumma in kunta taclamu anna hâdhâ-l-amra (que l'on explicite) khayrun lî fî dînî wa macâshî, wa câqibati amrî (ou : câjilihi wa âjilihi) fa-qdurhu lî, wa yassirhu lî, thumma bârik lî fîhi. Wa in kunta taclamu anna hâdhâ-l-amra (que l'on explicite) sharrun lî fî dînî wa macâshî, , wa câqibati amrî (ou : câjilihi wa âjilihi) fa-srifhu cannî, wa srifnî canhu, wa qdur lî-l-khayra haythu kâna thumma arddinî bihi.",
  "RepeatNumber": 1,
  "Tabweeb": "De la prière dite de consultation (al-Istikhâra)"
 },
 {
  "ZekarID": 75,
  "ZekarText": "La louange est à Allah Seul et la prière et le salut sur le dernier des prophètes.\r\n\r\nJe cherche protection auprès d’Allah contre Satan le maudit :\r\n  Allah ! Nulle divinité autre que Lui, le Vivant qui veille éternellement à la bonne marche de toute chose. Ni somnolence ni sommeil ne Le saisissent. A Lui appartient tout ce qui est dans les cieux et sur la terre. Qui peut intercéder auprès de Lui sans Sa permission ? Il sait tout leur passé et tout leur futur. Et ils ne savent de sa science que ce qu’Il veut. Son trône (Kursî) déborde les cieux et la terre dont la garde ne Lui coûte aucune peine. Et Il est le Très Haut, le Très Grand.   \r\n\r\nAllâhu lâ ilâha illâ huwa-l-hayyu-l-qayyûm. Lâ ta'khudhuhu sinatun wa lâ nawm, lahu mâ fî s-samâwâti wa mâ fî-l-ard. Man dhâ l-ladhî yashfacu cindahu illâ bi-idhnihi. Yaclamu mâ bayna aydîhim wa mâ khalfahum. Wa lâ yuhîtûna bi-shay'in min cilmihi illâ bi-mâ shâ'a. Wasica kursiyyuhu s-samâwâti wa-l-ard. Wa lâ ya'ûduhu hifzuhumâ, wa huwa-l-caliyyu-l-cazîm.",
  "RepeatNumber": 1,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 76,
  "ZekarText": "Au Nom d’Allah le Tout Miséricordieux le Très Miséricordieux : « Dis : C’est Lui Allah Seul et Unique ; Allah le Seul à être imploré pour ce que nous désirons ; Il n’a jamais engendré ni n’a été engendré ; et nul n’est égal à Lui. » [Sourate Al-Ikhlâs]\r\n\r\nAu Nom d’Allah le Tout Miséricordieux le Très Miséricordieux : « Dis : Je cherche protection auprès du Seigneur de l’aube naissante ; contre le mal des êtres qu’Il a créés ; contre le mal de l’obscurité quand elle s’approfondit ; contre le mal de celles qui soufflent sur les nœuds ; et contre le mal de l’envieux quand il envie. » [Sourate Al-Falaq]\r\n\r\nAu Nom d’Allah le Tout Miséricordieux le Très Miséricordieux : « Dis : Je cherche protection auprès du Seigneur des hommes ; le Souverain des hommes ; Dieu des hommes ; contre le mal du mauvais conseiller furtif ; qui souffle le mal dans les poitrines des hommes ; qu’il soit djinn ou être humain. [Sourate An-Nâss]\r\n\r\n[trois fois chaque sourate] \r\n\r\n\r\nBismi l-lâhi r-rahmâni r-rahîm.\r\nQul huwa l-lâhu ahad, Allâhu s-samad,\r\nLam yalid wa lam yûlad,\r\nWa lam yakun lahû kufuwan ahad.\r\n\r\nBismi l-lâhi r-rahmâni r-rahîm.\r\nQul acûdhu bi-rabbi-l falaq, min sharri mâ khalaq,\r\nwa min sharri ghâsiqin idha waqab,\r\nwa min sharri n-naffâthâti fi-l cuqad.\r\nwa min sharri hâsidin idhâ hasad.\r\n\r\nBismi l-lâhi r-rahmâni r-rahîm.\r\nQul acûdhu bi-rabbi n-nâs, maliki n-nâs,\r\nilâhi n-nâs. Min sharri-l-waswâsi-l-khannâs,\r\nal-ladhî yuwaswisu fî sudûri n-nâs,\r\nmin al jinnati wa n-nâs.",
  "RepeatNumber": 3,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 77,
  "ZekarText": "Nous voilà au matin [ou au soir] et le règne appartient à Allah. Louange à Allah, Il n'y a pas d'autre divinité sauf Allah Seul, sans associé. A Lui la royauté, à Lui la louange et Il est capable de toute chose. Seigneur ! Je Te demande le bien de ce jour [ou qui se trouve en cette nuit] et le bien qui vient après. Et je me mets sous Ta protection contre le mal de ce jour [ou qui se trouve en cette nui] et le mal qui vient après. Ô Seigneur ! Je me mets sous Ta protection contre la paresse et les maux de la vieillesse. Je demande Ta protection contre le châtiment de l'Enfer et contre les tourments de la tombe. \r\n\r\n\r\nAsbahnâ wa asbaha-l-mulku li-l-lâhi, wa-l-hamduli-l-lâhi.\r\nLâ ilâha illâ l-lâhu, wahdahu lâ sharîka lahu, lahu-l-mulku wa lahu-l-\r\nhamdu, wa huwa calâ kulli shay'in qadîr. Rabbi, as'aluka khayra\r\nmâ fî hâdhâ-l-yawmi wa khayra mâ bacdahu. Wa acûdhu bika min\r\nsharri mâ fî hâdhâ-l-yawmi wa sharri mâ bacdahu. Rabbi acûdhu bika mina-l-kasali,\r\nwa sû'i-l-kibari. Rabbi acûdhu bika min cadhâbin fi n-nâr wa cadhâbin fi-l-qabr.",
  "RepeatNumber": 1,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 78,
  "ZekarText": "Le matin :\r\nÔ Seigneur ! C'est par Toi que nous nous retrouvons au matin [ou au soir] et c'est par Toi que nous nous retrouvons au soir [ou au matin]. C'est par Toi que nous vivons et c'est par Toi que nous mourons et c'est vers Toi que se fera la résurrection [ou c'est vers Toi que se fera notre destinée].\r\n\r\nLe soir:\r\nÔ Seigneur ! C'est par Toi que nous nous retrouvons au soir et c'est par Toi que nous nous retrouvons au matin. C'est par Toi que nous vivons et c'est par Toi que nous mourons et c'est vers Toi que se fera notre destinée. \r\n\r\n\r\nAllahumma bika asbahnâ, wa bika amsaynâ,\r\nwa bika nahyâ, wa bika namûtu, wa ilaylka n-nushûr.",
  "RepeatNumber": 1,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 79,
  "ZekarText": "Ô Seigneur ! Tu es mon Dieu. Il n'y a d'autre divinité que Toi. Tu m'as créé et je suis ton esclave, je me conforme autant que je peux à mon engagement et à ma promesse vis-à-vis de Toi. Je me mets sous Ta protection contre le mal que j'ai commis. Je reconnais Ton bienfait à mon égard et je reconnais mon péché. Pardonne-moi car Il n'y a que Toi qui pardonne les péchés. \r\n\r\n\r\nAllâhumma anta rabbî, lâ ilâha illâ anta.\r\nKhalaqtanî wa anâ cabduka, wa anâ calâ cahdika wa wacdika mâ stata'tu.\r\nAcûdhu bika min sharri mâ sana'tu. Abû'u laka bi-nicmatika calayya wa abû'u bi-dhanbî.\r\nFa-ghfir lî fa-innahu lâ yaghfiru dh-dhunûba illâ ant.",
  "RepeatNumber": 1,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 80,
  "ZekarText": "Ô Seigneur ! Me voici au matin [ou au soir], je Te prends à témoin et je prends à témoins les porteurs de Ton Trône ainsi que Tes anges et toutes tes créatures, que c'est Toi Allah, il n'y a de divinité que Toi, Tu es Seul et sans associé, et que Mohammed est Ton esclave et Ton messager. [quatre fois] \r\n\r\n\r\nAllâhumma innî asbahtu ush-hiduka, wa ush-hidu hamalata carshika,\r\nwa malâ'ikataka, wa jamîca khalqika, annaka anta l-lâhu, lâ ilâha\r\nillâ anta, wahdaka lâ sharîka laka, wa anna Muhammadan [sallallahu calayhi\r\nwa sallama] cabduka wa rasûluk. (4fois)",
  "RepeatNumber": 4,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 81,
  "ZekarText": "Ô Seigneur ! Tout ce qui m'arrive comme bienfaits en ce jour qui se lève [ou ce soir], à moi ou à l'une de Tes créatures, provient de Toi Seul, sans associé. A Toi la louange ainsi que la gratitude. \r\n\r\nAllâhumma mâ asbaha bî min nicmatin aw bi-ahadin min khalqika,\r\nfa-minka wahdaka lâ sharîka laka. Fa-laka-l-hamdu wa laka sh-shukr.",
  "RepeatNumber": 1,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 82,
  "ZekarText": "Ô Seigneur ! Accorde-moi la santé (ou le salut). Ô Seigneur ! Accorde la santé à mon ouïe. Ô Seigneur ! Accorde la santé à ma vue. Il n'y a de divinité qu'Allah. Ô Seigneur ! Je cherche protection auprès de Toi contre la mécréance, la pauvreté et je me mets sous Ta protection contre les tourments de la tombe. Il n'y a pas de divinité sauf Toi. [trois fois] \r\n\r\nAllâhumma câfinî fî badanî. Allâhumma câfinî fî samcî.\r\nAllâhumma câfinî fî basarî. Lâ ilâha illâ anta.\r\nAllâhumma innî acûdhu bika mina-l-kufri, wa-l-faqri.\r\nWa acûdhu bika min cadhâbi-l-qabri.\r\nLâ ilâha illâ anta. (3fois)",
  "RepeatNumber": 3,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 83,
  "ZekarText": "Allah me suffit, il n'y a de divinité que Lui, c'est en Lui que je place ma confiance et Il est le Seigneur du Trône immense. [sept fois] \r\n\r\nHasbiya l-lâhu lâ ilâha illâ huwa calayhi tawakkaltu, wa huwa rabbu-l-carshi-l-cazîmi. (7fois)",
  "RepeatNumber": 7,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 84,
  "ZekarText": "Ô Seigneur ! Je te demande le pardon et la santé dans cette vie et dans l'au-delà. Ô Seigneur ! Je Te demande le pardon et la paix dans ma religion, ma vie, ma famille et mes biens. Ô Seigneur ! Cache mes défauts et mets-moi à l'abri de tous mes effrois. Ô Seigneur ! Protège-moi devant moi, derrière moi, sur ma droite, sur ma gauche et au-dessus de moi et je me mets sous la protection de Ta grandeur pour que je ne sois pas assassiné par en dessous de moi. \r\n\r\nAllâhummâ innî as'aluka-l-cafwa wa-l-câfiyata fi d-duniyâ wa-l-âkhirati.\r\nAllâhummâ innî as'aluka-l-cafwa wa-l-câfiyata fî dînî, wa dunyâya, wa ahlî, wa mâlî.\r\nAllâhumma stur cawrâtî, wa âmin rawcâtî. Allahumma hfaznî minm bayna yadayya,\r\nwa min khalfî, wa can yamînî, wa can shimâlî, wa min fawqî. Wa acûdhu bi azamatika\r\nan ughtâla min tahtî.",
  "RepeatNumber": 1,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 85,
  "ZekarText": "Ô Seigneur ! Le Connaisseur de l'invisible et du visible, le Créateur des cieux et de la terre, Seigneur et Maître de toute chose. J'atteste qu'il n'y a d'autre divinité sauf Toi. Je me mets sous Ta protection contre le mal de mon âme, contre le mal du diable et son polythéisme et contre le fait que je ne me nuise à moi-même ou que je ne nuise à un musulman. \r\n\r\nAllâhumma câlim-alghaybi wa sh-shahâdati, fâtira s-samâwâti wa-l ardi,\r\nrabba kulli shay'in wa malîkahu. Ash-hadu anlâ ilâha illâ anta.\r\nAcûdhu bika min sharrin nafsî, wa min sharri sh-shaytâni wa chirkihi,\r\nwa an aqtarifa calâ nafsî sû'an ajurrahu ilâ mouslim(in)",
  "RepeatNumber": 1,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 86,
  "ZekarText": "Au nom d'Allah, nul ne peut nuire en présence de Son nom sur terre et dans le ciel et Il est l'Audient, l'Omniscient. [trois fois] \r\n\r\nBismi l-lâhi l-ladhî lâ yadurrû maca smihi shay'un fi-l ardi wa lâ fi s-samâ'i, wa huwa s-samic-ul-calîm. (3fois)",
  "RepeatNumber": 3,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 87,
  "ZekarText": "J'ai agréé Allah comme mon seigneur, l'Islam comme ma religion et Mohammed (sws) comme mon prophète. [trois fois] \r\n\r\nRadîtu bi-l-lâhi rabban, wa bi-l-islâmi dînan, wa bi muhammadin [sallallahu calayhi wa sallama] nabiyyan. (3fois)",
  "RepeatNumber": 3,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 88,
  "ZekarText": "Ô le Vivant, Celui qui veille éternellement à la bonne marche de toute chose, j'implore secours auprès de Ta miséricorde. Améliore ma situation et ne me laisse pas à mon propre sort ne serait-ce le temps d'un clin d'œil. \r\n\r\nYâ hayyû, yâ qayyûmu bi rahmatika astaghîth(u).\r\nAslih lî sha'nî kullah(u)\r\nwa lâ takilnî ilâ nafsî tarfata cayn(in)",
  "RepeatNumber": 1,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 89,
  "ZekarText": "Nous voilà au matin [ou au soir] et le règne appartient à Allah, le Seigneur de l'univers. Ô Seigneur ! Je Te demande le bien de ce jour [ou de ce soir] : ce qu'il contient comme conquêtes, victoires, lumière, bénédiction et guidée. Je me mets sous Ta protection contre le mal de ce jour [ou de ce soir] et le mal qui vient après lui. \r\n\r\nAsbahnâ wa asbaha-l-mulku li-l-lâhi rabbi-l-câlamîn. Allahumma innî as'aluka\r\nkhayra hâdhâ-l-yawmi: fathahu, wa nusrahu, wa nûrahu, wa barakatahu,\r\nwa hudâhu. Wa acûdhu bika min sharri mâ fîhi wa sharri mâ bacdahu.",
  "RepeatNumber": 1,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 90,
  "ZekarText": "Nous voici au matin [ou au soir], et en nous se trouve la nature première qui est l'Islam, en nous, la parole du monothéisme ; nous sommes dans la religion de notre Prophète Mohammed (sws) et sur la voie de notre père Abraham qui vouait son culte exclusivement à Allah, soumis à Lui, et n'était point du nombre des associateurs. \r\n\r\nAsbahna calâ fitrati-l-islâmi, wa calâ kalimati-l-ikhlâsi, wa calâ nabiyyinâ Muhammadin,\r\nwa calâ millati abîna Ibrâhîma, hanîfan, musliman, wa mâ kâna mina-l-mushrikîn.",
  "RepeatNumber": 1,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 91,
  "ZekarText": "Gloire et pureté à Allah et à Lui la louange. [cent fois] \r\n\r\nSubhâna l-lâhi wa bi-hamdihi.",
  "RepeatNumber": 100,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 92,
  "ZekarText": "Il n'y a d'autre divinité qu'Allah Unique, sans associé. A Lui la royauté, à Lui la louange et Il est capable de toute chose. [dix fois, ou une fois au moins lorsque l'on éprouve de la paresse] \r\n\r\nLâ ilâha illa l-lâhu wahdahu lâ sharîka lah(u)\r\nlahu-l-mulku walahu-l-hamd(u),\r\nwa huwa calâ kulli shay'in qadîr. (10 fois)",
  "RepeatNumber": 10,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 93,
  "ZekarText": "Il n'y a d'autre divinité qu'Allah Unique, sans associé. A Lui la royauté, à Lui la louange et Il est capable de toute chose. [cent fois le matin] \r\n\r\nLâ ilâha illa l-lâhu wahdahu lâ sharîka lah(u)\r\nlahu-l-mulku walahu-l-hamd(u),\r\nwa huwa calâ kulli shay'in qadîr. (100 fois)",
  "RepeatNumber": 100,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 94,
  "ZekarText": "Gloire et pureté ainsi que louange à Allah autant de fois (que l'univers compte de) Ses créatures, autant de fois pour Le satisfaire, égal au poins de Son Trône et au nombre indéterminé de Ses paroles. [trois fois le matin] \r\n\r\nSubhâna l-lâhi wa bi-hamdihi, cadada khaqihi, wa ridâ nafsihi,\r\nwa zinata carshihi, wa midâda kalimâtihi. (3fois)",
  "RepeatNumber": 3,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 95,
  "ZekarText": "Ô Seigneur ! Je Te demande un savoir utile, une bonne subsistance et des œuvres agréées (par toi). [une fois le matin] \r\n\r\nAllahumma innî as'aluka cilman nâfican, wa rizqan tayyiban,\r\nwa camalan mutaqabbalan.",
  "RepeatNumber": 1,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 96,
  "ZekarText": "Je demande pardon à Allah et je me repens à Lui. [cent fois par jour] \r\n\r\nAstaghfiru l-lâha wa atûbu ilayh(i).",
  "RepeatNumber": 100,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 98,
  "ZekarText": "Ô Seigneur ! Prie et salue sur notre Prophète Mohammed. [dix fois] \r\n\r\nAllahumma salli wa sallim calâ nabiyyinâ Muhammad.",
  "RepeatNumber": 10,
  "Tabweeb": "Du matin et du soir"
 },
 {
  "ZekarID": 99,
  "ZekarText": "[Grouper ses deux mains en écuelle, y cracher sans émettre de salive, puis répéter :] Au Nom d’Allah le Tout Miséricordieux le Très Miséricordieux « Dis : C’est Lui Allah Seul et Unique - Allah le Seul à être imploré pour ce que nous désirons - Il n’a jamais engendré ni n’a été engendré – Et nul n’est égal à Lui. », au Nom d’Allah le Tout Miséricordieux le Très Miséricordieux « Dis : Je cherche protection auprès du Seigneur de l’aube naissante – Contre le mal des êtres qu’Il a créés – Contre le mal de l’obscurité quand elle s’approfondit – Contre le mal de celles qui soufflent sur les nœuds – et contre le mal de l’envieux quand il envie. », au Nom d’Allah le Tout Miséricordieux le Très Miséricordieux « Dis : Je cherche protection auprès du Seigneur des hommes – Le Souverain des hommes – Dieu des hommes – Contre le mal du mauvais conseiller furtif – Qui souffle le mal dans les poitrines des hommes – Qu’il soit djinn ou être humain. » [Puis passer les mains sur tout le corps, en commençant par la tête et le visage, puis la partie avant de son corps ] [refaire cela trois fois] ",
  "RepeatNumber": 3,
  "Tabweeb": "Du sommeil"
 },
 {
  "ZekarID": 100,
  "ZekarText": "Allah ! Nulle divinité autre que Lui, le Vivant qui veille éternellement à la bonne marche de toute chose. Ni somnolence ni sommeil ne Le saisissent. A Lui appartient tout ce qui est dans les cieux et sur la terre. Qui peut intercéder auprès de Lui sans Sa permission ? Il connaît leur passé et leur futur. Et ils ne savent de sa science que ce qu’Il veut. Son trône (Kursî) déborde les cieux et la terre dont la garde ne Lui coûte aucune peine. Et Il est le Très Haut, le Très Grand.",
  "RepeatNumber": 1,
  "Tabweeb": "Du sommeil"
 },
 {
  "ZekarID": 101,
  "ZekarText": "Le Messager a cru en ce qu’on a fait descendre vers lui venant de son Seigneur ainsi que les croyants. Tous ont cru en Allah, en Ses Anges, à Ses Livres et en Ses Messagers. Nous ne faisons pas de distinction entre Ses Messagers. Et ils ont dit : Nous avons entendu et obéi, Seigneur nous demandons Ton absolution. C’est vers Toi que sera le retour – Dieu n’impose à aucune âme une charge supérieure à sa capacité. Récompensée pour son bien et châtiée pour le mal qu’elle aura fait. Seigneur ne nous châtie pas s’il nous arrive d’oublier ou de commettre une erreur. Seigneur ! Ne nous charge pas d’un fardeau lourd comme Tu as chargé ceux qui vécurent avant nous. Seigneur ! Ne nous oblige pas à faire ce que nous ne pouvons supporter. Pardonne-nous, absous-nous et fais-nous miséricorde. Tu es notre Maître, accorde-nous la victoire sur les peuples infidèles.  ",
  "RepeatNumber": 1,
  "Tabweeb": "Du sommeil"
 },
 {
  "ZekarID": 102,
  "ZekarText": "C’est en Ton nom, Seigneur, que je me suis couché et en Ton nom que je me lève. Si Tu retiens mon âme, alors sois clément envers elle ; par contre, si Tu la laisses vivre, protège-la comme Tu protèges Tes serviteurs vertueux. \r\n\r\nBismika rabbî wadactu janbî wa bika arfacuhu. Fa-in amsakta nafsî fa-rhamhâ, wa in arsaltahâ fa-hfazhâ bi-mâ tahfazu bihi cibâdaka s-sâlihîn.",
  "RepeatNumber": 1,
  "Tabweeb": "Du sommeil"
 },
 {
  "ZekarID": 103,
  "ZekarText": "Ô Seigneur ! C’est Toi qui as créé mon âme et c’est Toi qui la fait mourir, c’est à Toi qu’appartient sa mort et sa vie. Si Tu la laisses vivre, alors protège-là ; et si Tu lui donnes la mort, alors pardonne-lui. Ô Seigneur, je Te demande le salut. \r\n\r\nAllâhumma innaka khalaqra nafsî wa anta tawaffâhâ. Laka mamâtuhâ wa mahyâhâ. In ahyaytahâ fa-hfazha, wa in amattahâ fa--ghfirlahâ. Allâhumma inni as'aluka-l-câfiyata.",
  "RepeatNumber": 1,
  "Tabweeb": "Du sommeil"
 },
 {
  "ZekarID": 104,
  "ZekarText": "Ô Seigneur ! Epargne-moi Ton châtiment le jour où Tu ressusciteras Tes esclaves. [trois fois] \r\n\r\nAllâhumma qinî cadhâbaka yawma tabcathu cibâdaka. (3fois)",
  "RepeatNumber": 3,
  "Tabweeb": "Du sommeil"
 },
 {
  "ZekarID": 105,
  "ZekarText": "C’est en Ton nom, Ô Seigneur, que je vis et que je meurs. \r\n\r\nBismika l-lâhumma amûtu wa ahyâ.",
  "RepeatNumber": 1,
  "Tabweeb": "Du sommeil"
 },
 {
  "ZekarID": 106,
  "ZekarText": "Gloire et Pureté à Allah [trente-trois fois], la louange est à Allah [trente-trois fois] et Allah est le Plus Grand [trente-quatre fois]. \r\n\r\nSubhâna l-lâh (33 fois), al-hamdu li-l-lâh (33fois), allâhu akbar (34 fois).",
  "RepeatNumber": 33,
  "Tabweeb": "Du sommeil"
 },
 {
  "ZekarID": 107,
  "ZekarText": "Ô Seigneur, Maître des sept cieux et Maître du Trône immense, notre Maître et le Maître de toute chose. Celui qui fend la graine et le noyau, et qui a fait descendre la Thora, l’Evangile et le Livre de Discernement (le Coran). Je cherche protection auprès de Toi contre le mal de toute chose que Tu saisis par le toupet. Ô seigneur ! Tu es le Premier, nul n’est avant Toi, Tu es le Dernier, nul n’est après Toi, Tu es l’Apparent, nul n’est au-dessus de Toi et Tu es le Caché, nul n’est au-dessous de Toi ; accorde-nous le moyen de payer la dette et accorde-nous de quoi éviter la pauvreté. \r\n\r\nAllâhumma rabba s-samâwâti s-sabci wa rabba-l-carshi-l-cazîmi ! Rabbanâ wa rabba kulli shay'in ! Fâliqa-l-habbi wa n-nawâ wa munzila t-tawrâti wa-l-injîli wa-l-furqâni.\r\nAcûdhu bika min sharri kulli shay'in anta âkhidhun bi-nâsiyatihi. Allâhumma anta-l-awwalu fa-laysa qablaka shay'un. Wa anta-l-âkhiru fa-laysa bacdaka shay'un.\r\nWa anta-z-zâhiru fa-laysa fawqaka shay'un. Wa anta-l-bâtinu fa-laysa dûnaka shay'un. Iqdi cannâ d-dayna wa aghninâ mina-l-faqri.",
  "RepeatNumber": 1,
  "Tabweeb": "Du sommeil"
 },
 {
  "ZekarID": 108,
  "ZekarText": "La louange est à Allah qui nous a procuré à manger et à boire, qui nous a protégé de tout mal et nous a assuré un asile. Or nombreux sont ceux qui n’ont personne pour les protéger et pour leur assurer le gîte. \r\n\r\nAl hamdu li-l-lâhi l-lâdhi atcamanâ, wa saqânâ, wa kafânâ, wa âwânâ. Fa-kam mimman lâ kâfiya lahu wa lâ mu'wî.",
  "RepeatNumber": 1,
  "Tabweeb": "Du sommeil"
 },
 {
  "ZekarID": 109,
  "ZekarText": "Ô Seigneur, le Connaisseur de l’invisible et du visible, le Créateur des cieux et de la terre, Seigneur et Maître de toute chose. J’atteste qu’il n’y a pas de divinité sauf Toi. Je me mets sous Ta protection contre le mal de mon âme, contre le mal du diable et son polythéisme et contre le fait de me faire du tort à moi-même ou de causer du tort à un musulman. \r\n\r\nAllâhumma câlim-alghaybi wa sh-shahâdati, fâtira s-samâwâti wa-l ardi,\r\nrabba kulli shay'in wa malîkahu. Ash-hadu anlâ ilâha illâ anta.\r\nAcûdhu bika min sharrin nafsî, wa min sharri sh-shaytâni wa chirkihi,\r\nwa an aqtarifa calâ nafsî sû'an ajurrahu ilâ mouslim(in).",
  "RepeatNumber": 1,
  "Tabweeb": "Du sommeil"
 },
 {
  "ZekarID": 110,
  "ZekarText": "Lire “Alif, Lâm, Mîm, la revelation…” (sourate “La Prosternation”, « As-Sajada ») et « Béni soit Celui dans la main de qui est la royauté » (sourate « La Royauté », « Al-Mulk »). ",
  "RepeatNumber": 1,
  "Tabweeb": "Du sommeil"
 },
 {
  "ZekarID": 111,
  "ZekarText": "Ô Seigneur ! Je t’ai soumis mon âme, je T’ai soumis toutes mes affaires, j’ai tourné mon visage vers Toi. Je m’en suis remis à Toi en toute chose. Je me suis adressé à Toi par amour et par crainte. Nul refuge contre Toi sauf auprès de Toi. J’ai cru au Livre que >Tu as descendu et au prophète que Tu as envoyé. \r\n\r\nAllâhumma aslamtu nafsî ilayka, wa fawwadtu amrpi ilayka, wa wajjahtu wajhî ilayka, wa alja'tu zahrî ilayka.\r\nRaghbatan wa rahbatan ilayka. Âmantu bi-kitâbika l-ladhî anzalta wa bi-nabiyyika l-ladhî arsalta.",
  "RepeatNumber": 1,
  "Tabweeb": "Du sommeil"
 },
 {
  "ZekarID": 112,
  "ZekarText": "Il n’y a de divinité qu’Allah l’Unique, le Dominateur Suprême, Seigneur des cieux et de la terre et de ce qu’il y a entre les deux, le Tout-Puissant, le Grand Pardonneur. \r\n\r\nLâ ilâha illâ l-lâhu-l-wâhidu-l-qahhâru, rabbu s-samâwâti wa-l-ardi wa mâ baynahumâ-l-cazîzu-l-ghaffar.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque l'on change de côté en dormant"
 },
 {
  "ZekarID": 113,
  "ZekarText": "Je me mets sous la protection des paroles parfaites d’Allah contre Sa colère, Son châtiment, le mal de Ses créatures et contre les incitations des diables et contre leur présence auprès de moi. \r\n\r\nAcûdhu bi-kalimâti l-lâhi t-tâmmâti min ghadabihi, wa ciqâbihi, wa sharri cibâdihi, wa min hamazâti sh-shayâtîni, wa an yahdurûni.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque l'on se réveille en sursaut ou que l'on se sent mal"
 },
 {
  "ZekarID": 115,
  "ZekarText": "[Cracher trois fois sans émettre de salive sur son côté gauche. Demander la protection auprès d’Allah contre le diable et contre ce qu’il a vu dans son rêve. Ne raconter à personne ce qu’il a vu. Changer le côté sur lequel il dormait.] ",
  "RepeatNumber": 3,
  "Tabweeb": "Ce que l'on doit faire après un songe ou un cauchemar"
 },
 {
  "ZekarID": 117,
  "ZekarText": "Ô Seigneur ! Guide-moi parmi ceux que Tu as guidés, accorde-moi le salut (ou la santé) parmi ceux auxquels Tu l’as accordé, prends-moi en charge parmi ceux que Tu as pris en charge, bénis ce que Tu m’as donné, épargne-moi le mal que Tu as décrété, car c’est Toi certes qui juge et on ne peut Te juger. Ne sera jamais humilié celui que Tu prends en charge (comme il ne sera jamais honoré celui que Tu as pris comme ennemi). Béni sois-Tu, ô Seigneur et sois exalté. \r\n\r\nAllâhumma hdinî fîman hadayta wa câfinî fîman câfayta, wa tawallanî fîman tawallayta, wa bârik lî fîmâ actayta, wa qinî sharra mâ qadayta. Fa-innaka taqdî wa lâ yuqdâ calayka. Innahu lâ yadhillu man wâlayta [wa lâ yacizzu man câdayta]. Tabârakata rabbanâ wa tacâlayta.",
  "RepeatNumber": 1,
  "Tabweeb": "Du Qunût dans la prière du Witr"
 },
 {
  "ZekarID": 118,
  "ZekarText": "Ô Seigneur! Je cherche protection dans Ta satisfaction contre Ta colère, dans Ton pardon contre Ton châtiment et en Toi contre Toi-même. Je ne pourrais Te louer ni Te remercier autant que Tu T’es loué Toi-même. \r\n\r\nAllâhumma innî acudhu bi-ridâka min sakhattika, wa bi-mucâfâtika min cuqûbatika. Wa acûdhu bika minka. Lâ uhs thanâ'an calayka, anta kama athnayta calâ nafsik.",
  "RepeatNumber": 1,
  "Tabweeb": "Du Qunût dans la prière du Witr"
 },
 {
  "ZekarID": 119,
  "ZekarText": "Ô Seigneur! C’est Toi seul que nous adorons, c’est Toi que nous prions, devant Toi que nous nous prosternons et c’est vers Toi que nous accourons. Nous espérons Ta miséricorde et nous craignons Ton châtiment car Ton châtiment atteindra sûrement les mécréants. Ô Seigneur! Nous demandons Ton aide et Ton pardon ; nous Te louons avec les plus belles formules, nous ne sommes pas ingrats envers Toi, nous croyons en Toi et nous nous soumettons à Toi. Et nous désavouons totalement ceux qui sont ingrats envers Toi. \r\n\r\nAllâhumma iyyâka nacbudu, wa laka nusallî wa nasjudu, wa ilayka nascâ wa nahfidu, najrû rahmataka wa nakhshâ cadhâbaka, inna cadhâbaka bi-l-kâfirîna mulhaqun. Allâhumma innâ nastacînuka wa nastaghfiruka, wa nuthnî calayka-l-khayra wa lâ nakfuruka, wa nu'minu bika, wa nakhdacu laka, wa nakhlacu man yakfuruka.",
  "RepeatNumber": 1,
  "Tabweeb": "Du Qunût dans la prière du Witr"
 },
 {
  "ZekarID": 120,
  "ZekarText": "Gloire et pureté au Souverain, le Digne de glorification [trois fois, la troisième fois élever la voix et ajouter :] (Seigneur des Anges et du Saint-Esprit (Jibrîl)*). \r\n\r\nSubhâna-l-maliki-l-quddûsi. [Rabbi-l-malâ'ikati wa r-rûhi.]",
  "RepeatNumber": 3,
  "Tabweeb": "Après la prière du Witr"
 },
 {
  "ZekarID": 121,
  "ZekarText": "Ô Seigneur! Je suis Ton serviteur, fils de Ton serviteur et de Ta servante, mon toupet est dans Ta main. Ton jugement s’accomplit sur moi, Ton décret sur moi est juste. Par les noms qui T’appartiennent avec lesquels Tu T’es nommé, ou que Tu as révélés dans Ton Livre ou que Tu as enseignés à l’une de Tes créatures, ou bien que Tu as gardé secret dans Ta science de l’inconnu, je Te demande de rendre le Coran le printemps de mon cœur, la lumière de ma poitrine, la dissipation de ma tristesse et la fin de mes soucis.  \r\n\r\nAllâhumma innî cabduka, ibnu cabdika, ibnu amatika. Nâsiyatî bi-yadika. Mâdin fiyya hukmuka, cadlun fiyya qadâ'uka. As'aluka bi-kulli smin huwa laka, sammayta bihi nafsaka, aw anzaltahu fî kitâbika, aw callamtahu ahadan min khalqika, aw ista'tharta bihi fî cilmi-l-ghaybi cindaka, an tajcala-l-qur'âna rabîca qalbî, wa nûra ssadrî, wa jalâ'a huznî, wa dhahâba hammî.",
  "RepeatNumber": 1,
  "Tabweeb": "En cas de soucis et de tristesse"
 },
 {
  "ZekarID": 122,
  "ZekarText": "Ô Seigneur! Je me mets sous Ta protection contre les soucis et la tristesse, contre l’incapacité et la paresse, contre l’avarice et la lâcheté, contre le poids de la dette et la domination des hommes. \r\n\r\nAllâhumma innî acûdhu bika mina-l-hammi wa-l-hazani, wa-l-cajzi wa-l-kasali, wa-l-bukhli wa-l-jubni, wa dalaci d-dayni wa ghalabati r-rijâl.",
  "RepeatNumber": 1,
  "Tabweeb": "En cas de soucis et de tristesse"
 },
 {
  "ZekarID": 123,
  "ZekarText": "Il n’y a de divinité qu’Allah le Très Grand et Plein de mansuétude. Il n’y a de divinité qu’Allah, le Seigneur du Trône immense. Il n’y a de divinité qu’Allah, le Seigneur des cieux et de la terre et Seigneur du Trône, le Généreux. \r\n\r\nLâ ilâha illâ l-lâhu-l-cazîmu-l-halîmu. Lâ ilâha illâ l-lâhu, rabbu-l-carshi-l-cazîm. Lâ ilâha illâ l-lâhu, rabbu s-samâwâti wa rabbu-l-ardi wa rabbu-l-carshi-l-karîm.",
  "RepeatNumber": 1,
  "Tabweeb": "En cas d'affliction"
 },
 {
  "ZekarID": 124,
  "ZekarText": "Ô Seigneur! C’est Ta miséricorde que j’espère, ne me laisse donc pas à mon propre sort ne serait-ce que le temps d’un clin d’œil et améliore ma situation. Il n’y a d’autre divinité sauf Toi. \r\n\r\nAllâhumma rahmataka arjû. Falâ takilnî ilâ nafsî tarfata caynin, wa aslih lî sha'nî kullahu. Lâ ilâha illâ anta.",
  "RepeatNumber": 1,
  "Tabweeb": "En cas d'affliction"
 },
 {
  "ZekarID": 125,
  "ZekarText": "Pas de divinité à part Toi ! Pureté à Toi ! J’étais vraiment du nombre des injustes. \r\n\r\nLâ ilâha illâ anta, subhânaka, innî kuntu mina z-zâlimîn.",
  "RepeatNumber": 1,
  "Tabweeb": "En cas d'affliction"
 },
 {
  "ZekarID": 126,
  "ZekarText": "Allah, Allah est mon Seigneur et je ne Lui donne aucun associé. \r\n\r\nAllâhu, Allâhu rabbî. Lâ ushriku bihi shay'an.",
  "RepeatNumber": 1,
  "Tabweeb": "En cas d'affliction"
 },
 {
  "ZekarID": 127,
  "ZekarText": "Ô Seigneur! Nous T’invoquons contre leur mal (littéralement : Nous Te plaçons dans leurs gorges) et dirige-le contre eux-mêmes. Nous nous mettons sous Ta protection contre leurs méfaits. \r\n\r\n\r\nAllâhumma innâ najcaluka fî nuhû rihim, wa nacûdhu bika min shurûrihim.",
  "RepeatNumber": 1,
  "Tabweeb": "En rencontrant l'ennemi ou des autorités"
 },
 {
  "ZekarID": 128,
  "ZekarText": "Ô Seigneur! Tu es mon soutien et mon protecteur. C’est par Toi que je me déplace, que je fonds sur l’ennemi et que je le combats. \r\n\r\nAllâhumma anta câdudî, wa anta nasîrî. Bika ajûlu, wa bika assûlu, wa bika uqâtil.",
  "RepeatNumber": 1,
  "Tabweeb": "En rencontrant l'ennemi ou des autorités"
 },
 {
  "ZekarID": 129,
  "ZekarText": "Allah nous suffit, Il est notre meilleur garant. \r\n\r\nHasbuna l-lâhu, wa nicma-l-wakîl.",
  "RepeatNumber": 1,
  "Tabweeb": "En rencontrant l'ennemi ou des autorités"
 },
 {
  "ZekarID": 130,
  "ZekarText": "Ô Seigneur ! Seigneur des sept cieux, de la terre et du Trône immense, sois pour moi un protecteur contre untel, fils d’untel, et contre ses alliés parmi Tes créatures, et contre le fait de subir un abus ou une tyrannie de leur part. Honoré soit Ton protégé, Exalté soit Ton éloge et il n’y a de divinité que Toi. \r\n\r\nAllâhumma rabba s-samâwâti s-sabci, wa rabba-l-carshi-l-cazîmi. Kun lî jâran min (citer son nom) wa ahzabihi min khalâ'iqika, an yafruta calayya ahadun minhum wa yatghâ.cAzza jâruka, wa jalla thanâ'uka, wa lâ ilâha illâ ant.",
  "RepeatNumber": 1,
  "Tabweeb": "De celui qui craint l'injustice du gouverneur"
 },
 {
  "ZekarID": 131,
  "ZekarText": "Allah est le Plus Grand, Allah est plus Puissant que toutes Ses créatures. Allah est plus Puissant que celui dont j’ai peur et dont je me méfie. Je me mets sous la protection d’Allah, il n’y a pas d’autre divinité sauf Lui, Celui qui retient les sept cieux de tomber sur la terre sauf quand Il le permettra, contre les méfaits de Ton esclave untel, contre ses soldats, ses partisans et ses partis, parmi les djinns et les humains. Ô Seigneur ! Sois mon protecteur contre leurs méfaits. Exalté soit Ton éloge, honoré soit Ton protégé, béni soit Ton nom et il n’y a pas de divinité à part Toi. \r\n\r\nAllâhu akbaru. Allâhu acazzu min khalqihi jamîcan. Allâhu acazzu mimmâ akhâfu wa ahdharu. Acûdhu bi-l-lâhi l-ladhî lâ ilâha illâ huwa-l-mumsiki s-samâwâti s-sabci an yaqacna calâ-l-ardi illâ bi-idhnihi, min sharri cabdika (citer son nom) wa junûdihi wa atbâcihi wa ashyâcihi mina-l-jinni wa-l-insi. Allâhumma kun lî jâran min sharrihim. Jalla thanâ'uka wa cazza âruka, wa tabâraka smuka, wa lâ ilâha ghayruka.",
  "RepeatNumber": 3,
  "Tabweeb": "De celui qui craint l'injustice du gouverneur"
 },
 {
  "ZekarID": 132,
  "ZekarText": "Ô Seigneur ! Toi qui as fait descendre le Livre, qui est prompt dans Ses comptes, vaincs les coalisés. Ô Seigneur, vaincs-les et fais-les trembler. \r\n\r\nAllâhumma ! Munzila-l-kitâbi, sarîca-l-hisâbi ! Ihzimi-l-ahzâba. Allâhumma hzimhum wa zalzilhum.",
  "RepeatNumber": 1,
  "Tabweeb": "Contre l'ennemi"
 },
 {
  "ZekarID": 135,
  "ZekarText": "Ô Seigneur ! Epargne-moi leurs méfaits de la façon qui Te plaira. \r\n\r\nAllâhumma kfinîhim bimâ shi'ta.",
  "RepeatNumber": 1,
  "Tabweeb": "De celui qui craint un groupe de gens"
 },
 {
  "ZekarID": 137,
  "ZekarText": "[Se réfugier auprès de Dieu. Evacuer de son esprit la pensée qui a provoqué ce doute.] \r\n\r\nAcûdhu bi-l-lâhi mina sh-shaytâni r-rajîm.",
  "RepeatNumber": 1,
  "Tabweeb": "De celui qui rencontre des doutes dans sa croyance"
 },
 {
  "ZekarID": 139,
  "ZekarText": "J’ai cru en Allah et en Ses Messagers. \r\n\r\nÂmantu bi-l-lâhi wa rusûlihi.",
  "RepeatNumber": 1,
  "Tabweeb": "De celui qui rencontre des doutes dans sa croyance"
 },
 {
  "ZekarID": 140,
  "ZekarText": "Lire « C’est Lui le Premier et le Dernier, l’Apparent et le Caché et Il est Omniscient. [Sourate « Le Fer », verset 3]. » \r\n\r\nHuwa-l-awwalu wa-l-âkhiru wa z-zâhiru wa-l-bâtinu, wa huwa bi-kulli shay'in calîm.",
  "RepeatNumber": 1,
  "Tabweeb": "De celui qui rencontre des doutes dans sa croyance"
 },
 {
  "ZekarID": 141,
  "ZekarText": "Ô Seigneur ! Accorde-moi de Tes biens licites pour m’éviter de rechercher Tes interdits et puisse Ta générosité m’atteindre pour m’éviter de recourir à tout autre que Toi. \r\n\r\nAllâhumma kfinî bi-halâlika can harâmika wa ghninî bi-fadlika camman siwâk.",
  "RepeatNumber": 1,
  "Tabweeb": "Pour se délivrer d'une dette"
 },
 {
  "ZekarID": 142,
  "ZekarText": "Ô Seigneur ! Je me mets sous Ta protection contre les soucis et la tristesse, contre l’incapacité et la paresse, contre l’avarice et la lâcheté, contre le poids de la dette et la domination des hommes. \r\n\r\nAllâhumma innî acûdhu bika mina-l-hammi wa-l-hazani, wa-l-cajzi wa-l-kasali, wa-l-bukhli wa-l-jubni, wa ddalaci d-dayni wa ghalabati r-rijâl.",
  "RepeatNumber": 1,
  "Tabweeb": "Pour se délivrer d'une dette"
 },
 {
  "ZekarID": 143,
  "ZekarText": "Je me mets sous la protection d’Allah contre Satan le maudit. [Cracher trois fois sur le côté gauche.] \r\n\r\nAcûdhu bi-l-lâhi mina sh-shaytâni r-rajîm.",
  "RepeatNumber": 3,
  "Tabweeb": "Contre la tentation dans la prière et au cours de la récitation du Coran"
 },
 {
  "ZekarID": 144,
  "ZekarText": "Ô Seigneur ! Il n’y a de chose facile que ce que Tu rends facile et si Tu le veux, Tu peux rendre la chose difficile facile. \r\n\r\nAllâhumma lâ sahla illâ mâ jacaltahu sahlan, wa anta tajcalu-l-hazana idhâ shi'ta sahlan.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque l'on rencontre une difficulté"
 },
 {
  "ZekarID": 145,
  "ZekarText": "[Faire correctement ses ablutions, se lever et faire deux unités de prière. Demander le pardon d’Allah.] ",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque l'on a commis un péché"
 },
 {
  "ZekarID": 146,
  "ZekarText": "[Demander la protection auprès d’Allah.] \r\n\r\nAcûdhu bi-l-lâhi mina sh-shaytâni r-rajîm.",
  "RepeatNumber": 1,
  "Tabweeb": "Ce qui chasse le diable et ses tentations"
 },
 {
  "ZekarID": 147,
  "ZekarText": "Faire l'appel à la prière (al-âdhan) ",
  "RepeatNumber": 1,
  "Tabweeb": "Ce qui chasse le diable et ses tentations"
 },
 {
  "ZekarID": 148,
  "ZekarText": "[Invoquer Dieu et réciter le Coran.] ",
  "RepeatNumber": 1,
  "Tabweeb": "Ce qui chasse le diable et ses tentations"
 },
 {
  "ZekarID": 149,
  "ZekarText": "Allah l’a prédestiné, et ce qu’Il a voulu, Il l’a fait. \r\n\r\nQaddaru l-lâhi wa mâ shâ'a facala.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsqu'il arrive une chose désagréable ou que l'on est dépassé par les événements"
 },
 {
  "ZekarID": 150,
  "ZekarText": "Qu’Allah bénisse ce qu’Il t’a accordé (cet enfant) et puisses-tu être reconnaissant envers Celui qui te l’a accordé. Puisse-t-il (cet enfant) atteindre sa pleine maturité et qu’Allah lui accorde le bon comportement envers toi.\r\n\r\n[Celui qui reçoit les félicitations dit :] Qu’Allah te bénisse tout ce qu’Il t’a accordé ! Qu’Allah te récompense par Ses grâces, t’accorde un nouveau-né comme le mien et te donne une rétribution abondante. \r\n\r\nBâraka l-lâhu laka fî-l-mawhûbi laka, wa shakarta-l-wâhiba, wa balagha ashuddahu, wa ruziqta birrahu.\r\nCe à quoi on répond :\r\nBâraka l-lâhu laka, wa bâraka calayka, wa jazâka l-lâhu khayran, wa razaqaka l-lâhu mithlahu, wa ajzala thawâbaka.",
  "RepeatNumber": 1,
  "Tabweeb": "Les félicitations à l'occasion d'une naissance"
 },
 {
  "ZekarID": 151,
  "ZekarText": "Je cherche pour vous protection auprès des paroles parfaites d’Allah contre tout démon, contre tout animal (ou toute chose) nuisible et contre tout mauvais œil. \r\n\r\nUcîdhukumâ bi-kalimâti l-lâhi t-tâmmati min kulli shaytânin wa hâmmatin, wa min kulli caynin lâmmatin.",
  "RepeatNumber": 1,
  "Tabweeb": "Pour demander la protection d'Allah sur les enfants"
 },
 {
  "ZekarID": 152,
  "ZekarText": "(Qu’il n’y ait) pas de mal, que cela soit pour toi une purification (de tes péchés) si Allah le veut. \r\n\r\nLâ ba'sa, tahûrun in shâ'a l-lâhu.",
  "RepeatNumber": 1,
  "Tabweeb": "Ce que l'on dit en visitant un malade"
 },
 {
  "ZekarID": 153,
  "ZekarText": "Je prie Allah le Très Grand, Seigneur du Trône immense de te guérir [sept fois]. \r\n\r\nAs'alu l-lâha-l-cazîma, rabba-l-carshi-l-cazîmi, an yashfiyaka.",
  "RepeatNumber": 7,
  "Tabweeb": "Ce que l'on dit en visitant un malade"
 },
 {
  "ZekarID": 154,
  "ZekarText": "[Celui qui rend visite à son frère musulman malade marchera sur un chemin plein de palmiers au Paradis jusqu’à ce qu’il s’assoie ; s’il s’assied, la miséricorde le couvrira entièrement. Si cette visite se fait le matin il verra soixante-dix mille Anges qui prieront pour lui jusqu’au soir, et si celle-ci se fait le soir, soixante-dix mille Anges prieront pour lui jusqu’au matin. ",
  "RepeatNumber": 1,
  "Tabweeb": "Le mérite de rendre visite à un malade"
 },
 {
  "ZekarID": 155,
  "ZekarText": "Ô Seigneur ! Pardonne-moi, accorde-moi Ta miséricorde et fais-moi rejoindre Le Très Haut Compagnon. \r\n\r\nAllâhumma ghfir lî, wa rhamnî, wa alhiqnî bi-r-rafîqi-l-aclâ.",
  "RepeatNumber": 1,
  "Tabweeb": "Du malade qui perd espoir de vivre"
 },
 {
  "ZekarID": 156,
  "ZekarText": "Il n’y a d’autre divinité qu’Allah, la mort est certes précédée d’une agonie (pénible). \r\n\r\nLâ ilâha illâ l-lâhu. Inna li-l-mawti la-sakarâtin.",
  "RepeatNumber": 1,
  "Tabweeb": "Du malade qui perd espoir de vivre"
 },
 {
  "ZekarID": 157,
  "ZekarText": "Il n’y a pas de divinité à part Allah et Allah est le Plus Grand, il n’y a pas de divinité à part Allah Seul, Il n’y a pas de divinité à part Allah Seul, sans associé, il n’y a pas de divinité à part Allah, à Lui la royauté, à Lui la louange, il n’y a pas de divinité à part Allah et il n’y a de force ni de puissance qu’en Allah. \r\n\r\nLâ ilâha illâ l-lâhu wa l-lâhu akbar. Lâ ilâha illâ l-lâhu wahdahu. Lâ ilâha illâ l-lâhu wahdahu lâ sharîka lahu. Lâ ilâha illâ l-lâhu, lahu-l-mulku wa lahu-l-hamdu. Lâ ilâha illâ l-lâhu, wa lâ hawla wa lâ quwwata illâ bi-l-lâhi.",
  "RepeatNumber": 1,
  "Tabweeb": "Du malade qui perd espoir de vivre"
 },
 {
  "ZekarID": 158,
  "ZekarText": "[Celui dont les dernières paroles seront :] Il n’y a de divinité qu’Allah [entrera au Paradis]. \r\n\r\nLâ ilâha illâ l-lâhu",
  "RepeatNumber": 1,
  "Tabweeb": "Faire prononcer au mourant la profession de foi (ach-Chahâda)"
 },
 {
  "ZekarID": 159,
  "ZekarText": "Certes nous appartenons à Allah, et c’est vers Lui que nous retournerons. Ô Seigneur ! Accorde-moi une rétribution dans mon malheur et fais-la suivre d’une (ou compense-moi par) chose bien meilleure. \r\n\r\nInnâ li-l-lâhi wa innâ ilayhi râjicuna. Allahumma 'jurnî musîbatî wa khluf lî khayran minhâ.",
  "RepeatNumber": 1,
  "Tabweeb": "De celui qui est atteint par un malheur"
 },
 {
  "ZekarID": 160,
  "ZekarText": "Ô Seigneur ! Pardonne à untel [le nommer], élève son rang parmi les bien-guidés, procure-lui un successeur dans sa descendance, pardonne-nous et pardonne-lui, ô Seigneur et Maitre des mondes ! Elargis-lui sa tombe et remplis-la de lumière. \r\n\r\nAllâhumma ghfir li-fulânin (citer son nom) wa rfac darajatahu fî-l-mahdiyyîna, wa khlufhu fî caqibihi fî-l-ghâbirîna. Wa ghfir lanâ wa lahu, yâ rabba-l-câlamîna, wa fsah lahu fî qabrihi wa nawwir lahu fîhi.",
  "RepeatNumber": 1,
  "Tabweeb": "Après avoir fermé les yeux du mort"
 },
 {
  "ZekarID": 161,
  "ZekarText": "Ô Seigneur ! Pardonne-lui et accorde-lui Ta miséricorde. Accorde-lui le salut et le pardon. Assure-lui une noble demeure. Elargis-lui sa tombe et lave-le avec l’eau, la neige et la grêle. Nettoie-le de ses péchés comme on nettoie le vêtement blanc de la saleté. Donne-lui en échange une demeure meilleure que la sienne et une épouse meilleure que la sienne. Fais-le entrer au Paradis et préserve-le du châtiment de la tombe (et du châtiment de l’Enfer). \r\n\r\nAllâhumma ghfir lahu wa rhamhu wa câfihi, wa cfu canhu, wa akrim nuzulahu, wa wassic mudkhalahu, wa ghsilhu bi-l-mâ'i wa th-thalji wa-l-baradi. Wa naqqihi mina-l-khatâya kamâ naqqayta th-thawba-l-abyada mina d-danasi. Wa abdilhu dâran khayran min dârihi, wa ahlan khayran min ahlihi, wa zawjan khayran min zawjihi. Wa dkhilhu-l-jannata wa acidh-hu min cadhâbi-l-qaqbr [wa cadhâbi n-nâr].",
  "RepeatNumber": 1,
  "Tabweeb": "Pour le mort pendant l'office funéraire"
 },
 {
  "ZekarID": 162,
  "ZekarText": "Ô Seigneur ! Pardonne à nos vivants et à nos morts, aux présents et aux absents, aux jeunes et aux vieux, aux hommes et aux femmes. Ô Seigneur ! Celui d’entre nous que Tu maintiens en vie, fais-le vivre sur la voie de l’Islam et celui d’entre nous dont Tu as repris l’âme, fais-le mourir dans la foi. Ô Seigneur ! Ne nous prive pas de sa récompense et ne nous égare pas après sa mort. \r\n\r\nAllâhumma ghfir li-hayyinâ wa mayyitinâ, wa shâhidinâ wa ghâ'ibinâ, wa saghîrinâ wa kabîrinâ, wa dhakarinâ wa unthânâ. Allâhumma man ahyaytahu minnâ fa-ahyihi calâ-l-islâmi. Wa man tawaffaytahu minnâ fa-tawaffahu calâ-l-îmâni. Allâhumma lâ tahrimnâ ajrahu wa la tudillabâ bacdahu.",
  "RepeatNumber": 1,
  "Tabweeb": "Pour le mort pendant l'office funéraire"
 },
 {
  "ZekarID": 163,
  "ZekarText": "Ô Seigneur ! Untel fils d’untel est sous Ta protection et à l’abri de Ton voisinage (compagnie). Préserve-le donc de la tentation de la tombe et du châtiment de l’enfer. Ô Toi digne de loyauté et de raison, pardonne-lui et accorde-lui Ta miséricorde car c’est Toi le Pardonneur, le Très Miséricordieux. \r\n\r\nAllâhumma inna (citer le nom) fî dhimmatika wa habli jiwârika. Fa-qihi min fitnati-l-qabri wa cadhâbi n-nâri. Wa anta ahlu-l-wafâ'i wa-l-hhaqqi. Fa-ghfir lahu wa rhamhu, innaka anta-l-ghafûru r-rahîm.",
  "RepeatNumber": 1,
  "Tabweeb": "Pour le mort pendant l'office funéraire"
 },
 {
  "ZekarID": 164,
  "ZekarText": "Ô Seigneur ! Il est Ton esclave, fils de Ton esclave (féminin), il a besoin de Ta miséricorde et Tu n’as nul besoin de son châtiment. S’il était bienfaiteur, augmente-lui le nombre de ses bonnes actions et s’il était pécheur alors pardonne-lui. \r\n\r\nAllâhumma cabduka wa bnu amatika ihtâja ilâ rahmatika. Wa anta ghaniyyun can cadhâbihi. In kâna muhsinan, fa-zid fî hasanâtihi. Wa in kâna musî'an fa-tajâwaz canhu.",
  "RepeatNumber": 1,
  "Tabweeb": "Pour le mort pendant l'office funéraire"
 },
 {
  "ZekarID": 165,
  "ZekarText": "Ô Seigneur ! Préserve-le du châtiment de la tombe. (* Ô Seigneur ! Rends-le un prédécesseur et une épargne pour ses parents et accepte son intercession (pour eux). Ô Seigneur ! Augmente grâce à lui le poids de leurs bonnes actions et accrois leur rétribution. Place-le parmi les croyants vertueux. Mets-le sous la tutelle d’Abraham et préserve-le par Ta miséricorde du châtiment de l’Enfer. Donne-lui en échange une demeure meilleure que la sienne et une famille meilleure que la sienne. Ô Seigneur ! Pardonne à nos ancêtres et à nos descendants et à ceux qui nous ont précédés dans la foi. \r\n\r\nAllâhumma acidh-hu min cadhâbi-l-qabr.\r\nAllâhumma jcalhu faratan wa dhukran li-wâlidayhi, wa shafîcan mujâban. Allâhumma thaqqil bihi mawâzînahumâ, wa aczim bihi ijûrahumâ, wa alhiqhu bi-sâlihi-l-mu'minîna. Wa jcalhu fî kafâlati Ibrâhîma, wa qihi bi-rahmatika cadhâba-l-jahîmi. Wa abdilhu dâran khayran min dârihi, wa ahlan khayran min ahlihi. Allâhumma ghfir li-aslâfinâ wa afrâtinâ wa man sabaqanâ bi-l-îmân",
  "RepeatNumber": 1,
  "Tabweeb": "Pour l'enfant mort lors de la prière sur lui"
 },
 {
  "ZekarID": 166,
  "ZekarText": "Ô Seigneur ! Fais-en pour nous un prédécesseur, un ascendant et une rétribution. \r\n\r\nAllâhumma jcalhu lanâ faratan wa salafan wa ajran.",
  "RepeatNumber": 1,
  "Tabweeb": "Pour l'enfant mort lors de la prière sur lui"
 },
 {
  "ZekarID": 167,
  "ZekarText": "Certes à Allah appartient ce qu’Il a repris et c’est à Lui aussi qu’appartient ce qu’Il a donné, et chaque chose pour Lui a un terme fixé à l’avance… Sois endurant et espère la récompense d’Allah.\r\n\r\nQu’Allah accroisse ta rétribution, t’accorde les meilleures condoléances et pardonne à ton défunt. \r\n\r\nInna li-l-lâhi mâ akhadha wa li-l-lâhi mâ actâ, wa kullu shay'in cindahu bi-ajalin musammân... Fa-l-tasbir wa-l-tahtasib.\r\n\r\nAczama l-lâhu ajraka, wa ahsana cazâ'ka, wa ghafara li-mayyitika.",
  "RepeatNumber": 1,
  "Tabweeb": "Les condoléances"
 },
 {
  "ZekarID": 168,
  "ZekarText": "Au nom d’Allah et conformément à la Sunna du Messager d’Allah. \r\n\r\nBismi l-lâhi wa calâ sunnati rasûli l-lâhi.",
  "RepeatNumber": 1,
  "Tabweeb": "En plaçant le mort dans sa tombe"
 },
 {
  "ZekarID": 169,
  "ZekarText": "Ô Seigneur ! Pardonne-lui ! Ô Seigneur ! Raffermis-le (car il est questionné par les Anges de la mort). \r\n\r\nAllâhumma ghfir lahu, Allâhumma thabbit-hu.",
  "RepeatNumber": 1,
  "Tabweeb": "Après l'inhumation du mort"
 },
 {
  "ZekarID": 170,
  "ZekarText": "Que le salut soit sur vous, habitant de ces demeures, croyants et musulmans. Nous allons, si Allah veut, certainement vous rejoindre. [Qu’Allah accorde Sa grâce à ceux qui sont morts avant nous et à ceux qui vont les suivre.] Je demande à Allah pour nous et pour vous le salut. \r\n\r\nAs-salâmu calaykum ahla d-diyâri mina-l-muminîna wa-l-muslimîna. Wa innâ in shâ'a l-lâhu bikum lâhiqûna [wa yarhamu l-lâhu-l-mustaqdimîna minnâ wa-l-musta'khirîna.] As'alu l-lâha lanâ wa lakumu-l-câfiyata.",
  "RepeatNumber": 1,
  "Tabweeb": "En visitant le cimetière"
 },
 {
  "ZekarID": 171,
  "ZekarText": "Ô Seigneur ! Je te demande le bien (de ce vent) et je me mets sous Ta protection contre son mal. \r\n\r\nAllâhumma innî as'aluka khayrahâ wa acûdhu bika min sharrihâ.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque le vent souffle"
 },
 {
  "ZekarID": 172,
  "ZekarText": "Ô Seigneur ! Je Te demande le bien (de ce vent), le bien qu’il contient et le bien avec lequel il a été envoyé. Et je me mets sous Ta protection contre son mal, le mal qui contient et contre le mal pour lequel il a été déchaîné. \r\n\r\nAllâhumma innî as'aluka khayrahâ wa khayra mâ fîhâ, wa khayra mâ ursilat bihi. Wa acûdhu bika min sharrihâ, wa sharri mâ fîhâ, wa sharri mâ ursilat bihi.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque le vent souffle"
 },
 {
  "ZekarID": 173,
  "ZekarText": "« Gloire et pureté à Celui dont le tonnerre Le glorifie par sa louange et aussi les Anges sous l’effet de sa crainte. » (partie du verset 13 de la sourate « Le Tonnerre » (« Ar-Ra’d »)) \r\n\r\nSubhâna l-ladhî yusabbihu r-racdu bi-hamdihi wa-l-malâ'ikatu min khîfatihi.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque le tonnerre gronde"
 },
 {
  "ZekarID": 174,
  "ZekarText": "Ô Seigneur ! Accorde-nous tout de suite, sans retard, une pluie bénéfique, utile, fertile, pleine de profits et sans aucun dommage. \r\n\r\nAllâhumma sqinâ ghaytan mughîthan, marî'an, murîcan, nâfican ghayra dârrin, câjilan ghayra âjilin.",
  "RepeatNumber": 1,
  "Tabweeb": "Parmi les invocations de demande de pluie"
 },
 {
  "ZekarID": 175,
  "ZekarText": "Ô Seigneur ! Accorde-nous Ton aide en faisant descendre de la pluie. Ô Seigneur ! Accorde-nous ton aide en faisant descendre la pluie. Ô Seigneur ! Accorde-nous ton aide en faisant descendre la pluie. \r\n\r\nAllâhumma aghithnâ ! Allâhumma aghithnâ ! Allâhumma aghithnâ !",
  "RepeatNumber": 1,
  "Tabweeb": "Parmi les invocations de demande de pluie"
 },
 {
  "ZekarID": 176,
  "ZekarText": "Ô Seigneur ! Abreuve Tes adorateurs, abreuve Tes bêtes. Répands Ta miséricorde et redonne la vie à la terre morte. \r\n\r\nAllâhumma sqi cibâdaka wa bahâ'imaka. Wa bshur rahmataka, wa ahyi baladaka-l-mayyita.",
  "RepeatNumber": 1,
  "Tabweeb": "Parmi les invocations de demande de pluie"
 },
 {
  "ZekarID": 177,
  "ZekarText": "Ô Seigneur ! Que ce soit une pluie utile ! \r\n\r\nAllâhumma sayyiban nâfican.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque la pluie tombe"
 },
 {
  "ZekarID": 178,
  "ZekarText": "Nous avons reçu la pluie grâce à la bonté d’Allah et Sa miséricorde. \r\n\r\nMutirnâ bi-fadli l-lâhi wa rahmatihi.",
  "RepeatNumber": 1,
  "Tabweeb": "Après la pluie"
 },
 {
  "ZekarID": 179,
  "ZekarText": "Ô Seigneur ! Fais tomber la pluie aux alentours et pas sur nous. Ô Seigneur ! Dirige-la vers les pâturages (collines), les montagnes, les creux des rivières (vallées) et les plantations. \r\n\r\nAllâhumma hawâlaynâ wa lâ calaynâ. Allâhumma calâ-l-âkâmi wa z-zirâbi wa butûni-l-awdiyati wa manâbiti sh-shajari.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque l'on a peur de la pluie"
 },
 {
  "ZekarID": 180,
  "ZekarText": "Allah est le Plus Grand ! Ô Seigneur ! Apporte-nous avec cette nouvelle lune la sécurité et la foi, le salut et l’Islam ainsi qu el a réussite dans tout ce que Tu aimes et que Tu agrées. Notre Seigneur et ton Seigneur est Allah. \r\n\r\nAllâhu akbaru. Allâhumma ahillahu calaynâ bi-l-amni, wa-l-îmâni, wa s-salâmati, wa-l-islâmi, wa t-tawfîqi limâ tuhibbu rabbanâ wa tardâ. Rabbunâ wa rabbuka l-lâhu.",
  "RepeatNumber": 1,
  "Tabweeb": "En voyant la nouvelle lune"
 },
 {
  "ZekarID": 181,
  "ZekarText": "La soif est dissipée, les veines sont abreuvées et la récompense restera avec la volonté d’Allah. \r\n\r\nDhahaba z-zama'u wa btallati-l-curûqu wa thabata-l-ajru in shâ'a l-lâhu.",
  "RepeatNumber": 1,
  "Tabweeb": "Au moment de rompre le jeûne"
 },
 {
  "ZekarID": 182,
  "ZekarText": "Ô Seigneur ! Je te demande par Ta miséricorde qui embrasse toute chose de me pardonner. \r\n\r\nAllâhumma innî as'aluka bi-rahmatika l-lâti wasicat kulla shay'in an taghfira lî.",
  "RepeatNumber": 1,
  "Tabweeb": "Au moment de rompre le jeûne"
 },
 {
  "ZekarID": 183,
  "ZekarText": "[Dire :] Au nom d’Allah. [ou, si on oublie de le faire en commençant, dire :] Au nom d’Allah, au début et à la fin. \r\n\r\nAu début du repas : Bismi l-lâhi.\r\nEn cas d'oubli : Bismi l-lâhi fî awwalihi wa âkhirihi.",
  "RepeatNumber": 1,
  "Tabweeb": "En commençant le repas"
 },
 {
  "ZekarID": 184,
  "ZekarText": "Ô Seigneur ! Place pour nous Ta bénédiction dans (ce mets) et accorde-nous une nourriture meilleure encore.\r\n[En ce qui concerne le lait :] Ô Seigneur, bénis-le nous et donne-nous en davantage. \r\n\r\nAllâhumma bârik lanâ fîhi, wa atcimnâ khayran minhu.\r\nAllâhumma bârik lanâ fîhi wa zidnâ minhu.",
  "RepeatNumber": 1,
  "Tabweeb": "En commençant le repas"
 },
 {
  "ZekarID": 185,
  "ZekarText": "Louange à Allah Qui m’a accordé cette nourriture et me l’a octroyé sans pouvoir ni force de ma part. \r\n\r\nAl hamdu li-l-lâhi ladhî atcamanî hâdhâ wa razaqanîhi min ghayrin hawlin minnî wa lâ quwwatin.",
  "RepeatNumber": 1,
  "Tabweeb": "A la fin du repas"
 },
 {
  "ZekarID": 186,
  "ZekarText": "A Allah revient la Louange abondante, pure et bénie. Nul ne peut Te louer et reconnaître Tes grâces comme Tu le mérites, ni ne peut se dispenser de Toi, ô mon Seigneur. \r\n\r\nAl hamdu li-l-lâhi hamdan kathîran, tayyiban, mubârakan fîhi, ghayra makfiyyin wa lâ muwaddacin, wa lâ mustaghnan canhu rabbanâ.",
  "RepeatNumber": 1,
  "Tabweeb": "A la fin du repas"
 },
 {
  "ZekarID": 187,
  "ZekarText": "Ô Seigneur ! Bénis-leur ce que Tu leur as donné comme subsistance, pardonne-leur et fais-leur miséricorde. \r\n\r\n\r\nAllâhumma bârik lahum fîmâ razaqtahum wa ghfir lahum wa rhamhum.",
  "RepeatNumber": 1,
  "Tabweeb": "De l'invité en faveur de l'hôte"
 },
 {
  "ZekarID": 188,
  "ZekarText": "Ô Seigneur ! Nourris celui qui m’a nourri et donne à boire à celui qui m’a donné à boire. \r\n\r\nAllâhumma atcim man atcamanî wa sqi man saqânî.",
  "RepeatNumber": 1,
  "Tabweeb": "En faveur de celui qui donne à boire"
 },
 {
  "ZekarID": 189,
  "ZekarText": "Que les jeûneurs mangent chez vous, que les gens vertueux prennent de votre nourriture et que les Anges prient pour vous. \r\n\r\nAftara cindakumu s-sâ'imûna, wa akala tacâmakumu-l-abrâru, wa sallat calaykumu-l-malâ'ikatu.",
  "RepeatNumber": 1,
  "Tabweeb": "Du jeûneur en faveur de celui qui lui fait rompre"
 },
 {
  "ZekarID": 190,
  "ZekarText": "[Quand l’un de vous est invité à un repas, qu’il y aille. S’il jeûne, qu’il fasse des prières (invocations) pour celui qui l’invite ; et s’il ne jeûne pas, qu’il mange. ",
  "RepeatNumber": 1,
  "Tabweeb": "Du jeûneur lorsqu'on lui présente à manger et qu'il ne rompt pas son jeûne"
 },
 {
  "ZekarID": 191,
  "ZekarText": "Je suis en état de jeûne, je suis en état de jeûne. \r\n\r\nInnî sâimun ! Innî sâimun !",
  "RepeatNumber": 1,
  "Tabweeb": "Ce que doit dire le jeûneur lorsqu'il se fait injurier"
 },
 {
  "ZekarID": 192,
  "ZekarText": "Ô Seigneur ! Bénis nos fruits, bénis notre ville, bénis notre Çâ (unité de mesure équivalent à quatre Mud) et bénis notre Mud. \r\n\r\nAmmâhumma bârik lanâ fî thamarinâ, wa bârik lanâ fî madînatinâ, wa bârik lanâ fî sâcinâ, wa bârik lanâ fî muddinâ.",
  "RepeatNumber": 1,
  "Tabweeb": "Ce que l'on dit lorsque l'on voit les premiers fruits"
 },
 {
  "ZekarID": 193,
  "ZekarText": "[Lorsque l’un d’entre vous éternue, qu’il dise :]\r\n- La louange est à Allah\r\n[et que son frère ou son compagnon lui dise :]\r\n- Qu’Allah te fasse miséricorde !\r\n[Et au premier de lui répondre :]\r\n- Qu’Allah vous guide et améliore votre situation ! \r\n\r\n- Al hamdu li-l-lâhi.\r\n- Yarhamuka l-lâhu.\r\n- Yahdîkumu l-lâhu wa yuslihu bâlakum.",
  "RepeatNumber": 1,
  "Tabweeb": "De l'éternuement"
 },
 {
  "ZekarID": 194,
  "ZekarText": "Qu’Allah vous guide et améliore votre situation. \r\n\r\nYahdîkumu l-lâhu wa yuslihu bâlakum.",
  "RepeatNumber": 1,
  "Tabweeb": "Ce que l'on dit au mécréant lorsqu'il loue Allah après avoir éternué"
 },
 {
  "ZekarID": 195,
  "ZekarText": "Qu’Allah bénisse pour toi (ton mariage), te bénisse et vous unisse dans le bonheur. \r\n\r\nBâraka l-lâhu laka, wa bâraka calayka, wa jamaca baynakumâ fî khayrin.",
  "RepeatNumber": 1,
  "Tabweeb": "En faveur du nouveau marié"
 },
 {
  "ZekarID": 196,
  "ZekarText": "Je Te demande son bienfait et le bienfait dont Tu as fait une nature en elle (lui), et je me place sous Ta protection contre son mal et le mal dont Tu as fait une nature en elle (lui). \r\n\r\nAllâhumma innî as'aluka khayrahâ, wa khayra mâ jabaltahâ calayhi. Wa acûdhu bika min sharrihâ wa sharri mâ jabaltahâ calayhi.",
  "RepeatNumber": 1,
  "Tabweeb": "De celui qui se marie ou achète une monture"
 },
 {
  "ZekarID": 197,
  "ZekarText": "Au nom d’Allah. Ô Seigneur ! Eloigne de nous le diable, et éloigne le diable de ce que Tu nous as accordé. \r\n\r\nBismi l-lâhi. Allâhumma jannibnâ sh-shaytâna, wa jannibi sh-shaytâna mâ razaqtanâ.",
  "RepeatNumber": 1,
  "Tabweeb": "Avant les rapports sexuels"
 },
 {
  "ZekarID": 198,
  "ZekarText": "Je me mets sous la protection d’Allah contre Satan le lapidé. \r\n\r\nAcûdhu bi-l-lâhi mina sh-shaytâni r-rajîm.",
  "RepeatNumber": 1,
  "Tabweeb": "Dans les moments de colère"
 },
 {
  "ZekarID": 199,
  "ZekarText": "La louange est à Allah, Qui m’a préservé des épreuves dont tu es affligé et m’a préféré à beaucoup de Ses créatures. \r\n\r\nAl hamdu li-l-lâhi l-ladhî câfânî mimmâ btalâka bihi wa faddalanî calâ kathîrin mimman khalaqa tafdîlan.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque l'on voit une personne éprouvée"
 },
 {
  "ZekarID": 200,
  "ZekarText": "[Ibn ‘Omar a rapporté que l’on a dénombré que le Messager d’Allah (SWT) prononçait, dans une seule assemblée, cent fois cette phrase jusqu’à ce qu’il se lève :] Seigneur, pardonne-moi et accepte mon repentir car Tu es Celui qui accepte le repentir et Tu es le Pardonneur. \r\n\r\nRabbi ghfir lî wa tub calayya. Innaka anta t-tawwâbu-l-ghafûr.",
  "RepeatNumber": 100,
  "Tabweeb": "Ce qui est dit dans une assemblée"
 },
 {
  "ZekarID": 201,
  "ZekarText": "Gloire et pureté à Toi, Ô Seigneur, et à Toi la louange. J’atteste qu’il n’y a pas d’autre divinité que Toi. Je Te demande pardon et me repens à Toi. \r\n\r\nSubhânaka l-lâhumma wa bi-hamdika. Ash-hadu an lâ ilâha illâ anta, astaghfiruka wa atûbu ilayka.",
  "RepeatNumber": 1,
  "Tabweeb": "L'expiation du verbiage dans une assemblée"
 },
 {
  "ZekarID": 202,
  "ZekarText": "A toi aussi. \r\n\r\nWa laka.",
  "RepeatNumber": 1,
  "Tabweeb": "En faveur de celui qui dit 'qu'Allah te pardonne'"
 },
 {
  "ZekarID": 203,
  "ZekarText": "Qu’Allah te rétribue avec la meilleure rétribution. \r\n\r\nJazâka l-lâhu khayran.",
  "RepeatNumber": 1,
  "Tabweeb": "En faveur de celui qui rend un service"
 },
 {
  "ZekarID": 204,
  "ZekarText": "[Apprendre par cœur les dix premiers versets de la sourate « La Caverne » (« Al Kahf »). Chercher refuge auprès d’Allah contre la tentation de l’Antéchrist après la dernière attestation (At-Tachahhud) de chaque prière rituelle.] \r\n\r\n- Voir invocations n°55 et 56",
  "RepeatNumber": 1,
  "Tabweeb": "Les choses par lesquelles Allah préserve de l'Antéchrist"
 },
 {
  "ZekarID": 205,
  "ZekarText": "Qu’Il t’aime, Celui pour Qui tu m’as aimé. \r\n\r\nAhabbaka l-ladhî ahbabtanî lahu.",
  "RepeatNumber": 1,
  "Tabweeb": "En faveur de celui qui dit 'je t'aime en Allah'"
 },
 {
  "ZekarID": 206,
  "ZekarText": "Qu’Allah te bénisse dans ta famille et dans tes biens. \r\n\r\nBâraka l-lâhu laka fî ahlika wa mâlika.",
  "RepeatNumber": 1,
  "Tabweeb": "En faveur de celui qui propose le don de ses biens"
 },
 {
  "ZekarID": 207,
  "ZekarText": "Qu’Allah bénisse ta famille et tes biens ; la récompense de la dette sont les louanges et l’acquittement. \r\n\r\nBâraka l-lâhu laka fî ahlika wa mâlika. Innamâ jazâ'u s-salafi-l-hamdu wa-l-adâ'.",
  "RepeatNumber": 1,
  "Tabweeb": "De celui qui s'acquitte de ses dettes en faveur de celui qui lui a accordé"
 },
 {
  "ZekarID": 208,
  "ZekarText": "Ô Seigneur ! Je me mets sous Ta protection contre le fait de Te donner des associés consciemment, et je Te demande pardon pour ce dont je ne suis pas conscient. \r\n\r\nAllâhumma innî acûdhu bika an ushrika bika wa anâ aclamu, wa astaghfiruka li-mâ lâ aclam.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque l'on craint le polythéisme (ach-Chirk)"
 },
 {
  "ZekarID": 209,
  "ZekarText": "Toi aussi, qu’Allah te bénisse. \r\n\r\nWa fîka bârakallah",
  "RepeatNumber": 1,
  "Tabweeb": "En faveur de celui qui dit 'qu'Allah te bénisse'"
 },
 {
  "ZekarID": 210,
  "ZekarText": "Ô Seigneur ! Il n’y a pas d’augure que Ton augure et il n’y a de bien que celui que Tu accordes, Il n’y a pas de mal sauf celui que Tu décrètes. Et il n’y a d’autre divinité à part Toi. \r\n\r\nAllâhumma, lâ tayra illâ tayruka, wa lâ khayra illâ khayruka, wa lâ ilâha ghayruka.",
  "RepeatNumber": 1,
  "Tabweeb": "Du mauvais présage"
 },
 {
  "ZekarID": 211,
  "ZekarText": "Au nom d’Allah, la louange est à Allah. « … Gloire à Celui qui a mis ceci à notre service alors que nous n’étions pas capables de les dominer. – Et c’est vers notre Seigneur que nous devons retourner. (sourate « L’Ornement », versets 13 et 14) » Louange à Allah, louange à Allah, louange à Allah. Allah est le Plus Grand, Allah est le Plus Grand, Allah est le Plus Grand. Gloire et pureté à Toi, Ô Seigneur ! Je me suis fait du tort à moi-même, pardonne-moi donc ! Car nul autre que Toi pardonne les péchés. \r\n\r\nBismi l-lâhi. Al hamdu li-l-lâhi. Subhâna l-ladhî sakhkhara lanâ hâdhâ wa mâ kunnâ lahu muqrinîn, wa innâ ilâ rabbinâ la-munqalibûn. Al hamdu li-l-lâhi, al hamdu li-l-lâhi, al hamdu li-l-lâhi. Allâhu akbaru, Allâhu akbaru, Allâhu akbaru. Subhânaka l-lâhumma innî zalamtu nafsî, fa-ghfir lî, fa-innahu lâ yaghfiru dh-dhunûba illâ ant.",
  "RepeatNumber": 1,
  "Tabweeb": "En enfourchant une monture ou en empruntant un moyen de transport"
 },
 {
  "ZekarID": 212,
  "ZekarText": "Allah est le Plus Grand, Allah est le Plus Grand, Allah est le Plus Grand. « … Gloire à Celui qui a mis ceci à notre service alors que nous n’étions pas capables de les dominer. – Et c’est vers notre Seigneur que nous devons retourner. (sourate « L’Ornement », versets 13 et 14) » Ô Seigneur ! Nous Te demandons dans ce voyage la bonté pieuse, la crainte ainsi que tout acte qui procurera Ta satisfaction. Ô Seigneur ! Tranquillise-nous dans ce voyage et diminue-nous-en la distance. Ô Seigneur ! Tu es le compagnon de voyage et le remplaçant dans la famille. Ô Seigneur ! Je me mets sous Ta protection contre les fatigues du voyage, contre tout paysage source de chagrin, et contre tout mal qui nous frapperait, de retour dans nos biens et nos familles.\r\n\r\nAu retour, on rajoute :  Nous voilà donc de retour, pleinement soumis et dévoués, et proclamant la Louange de notre Seigneur . \r\n\r\nAllâhu akbaru, Allâhu akbaru, Allâhu akbaru. Subhâna l-ladhî sakhkhara lanâ hâdhâ wa mâ kunnâ lahu muqrinîn, wa innâ ilâ rabbinâ la-munqalibûn. Allâhumma innâ nas-aluka fî safarinâ hâdhâ al-birra wa t-taqwâ wa mina-l-camali mâ tardâ. Allâhumma hawwin calayna safaranâ hâdhâ wa twi cannâ bucdahu. Allâhumma anta s-sâhibu fî s-safari, wa-l-khalîfatu fî-l-ahli. Allâhumma innî acûdhu bika min wacthâ'i s-safari wa ka'âbati-l-manzari, wa sû'i-l-munqalabi fî-lmâli wa-l-ahli.\r\nAu retour, répéter l'invocation et ajouter :\r\nÂyibûn, tâ'ibûn, câbidûn, li-rabbinâ hâmidûn.",
  "RepeatNumber": 1,
  "Tabweeb": "Du voyage"
 },
 {
  "ZekarID": 213,
  "ZekarText": "Ô Seigneur ! Seigneur des sept cieux et de ce qu’ils couvrent, Seigneur des sept terres et de ce qu’elles portent, Seigneur des démons et de ceux qu’ils égarent, Seigneur des vents et de ce qu’ils éparpillent. Je Te demande le bien de cette ville, le bien de ses habitants et le bien de ce qui s’y trouve. Et je me place sous Ta protection contre le mal de cette ville, le mal de ses habitants et le mal qui s’y trouve. \r\n\r\nAllâhumma rabba s-samâwâti s-sabci wa mâ zzlalna, wa rabba-l-aradîna s-sabci wa mâ aqlalna, wa rabba sh-shayâtîni wa mâ adlalna, wa rabba r-riyâhi wa mâ dharayna. As'alukakhayra hâdhihi-l-qaryati wa khayra ahlihâ wa khayra mâ fîhâ, wa acûdhu bika min sharrihâ wa sharri ahlihâ wa sharri mâ fîhâ.",
  "RepeatNumber": 1,
  "Tabweeb": "En entrant dans une ville ou un village"
 },
 {
  "ZekarID": 214,
  "ZekarText": "Il n’y a d’autre divinité qu’Allah Unique, sans associé. A Lui la royauté, à Lui la louange, Il donne la vie et donne la mort. Il est vivant et ne mourra jamais. Le bien est dans Sa main et Il est capable de toute chose. \r\n\r\nLâ ilâha illâ l-lâhu, wahdahu lâ sharîka lahu, lahu-l-mulku wa lahu-l-hamdu, yuhyî wa yumîtu, wa huwa hayyun lâ yamûtu, bi-yadihi-l-khayru, wa huwa calâ kulli shay'in qadîr.",
  "RepeatNumber": 1,
  "Tabweeb": "En entrant au marché"
 },
 {
  "ZekarID": 215,
  "ZekarText": "Au nom d’Allah. \r\n\r\nBismillâh.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque la monture trébuche"
 },
 {
  "ZekarID": 216,
  "ZekarText": "Je vous confie à Allah dont les dépôts confiés ne se perdent jamais. \r\n\r\nAstawdicukumu l-lâha l-ladhî lâ tadîcu wadâ'icuhu.",
  "RepeatNumber": 1,
  "Tabweeb": "Du voyageur au résident"
 },
 {
  "ZekarID": 217,
  "ZekarText": "Je confie à Allah le soin de préserver ta religion, ton honnêteté et tes dernières œuvres. \r\n\r\nAstawdicu l-lâha dînaka wa amânataka wa khawâtima camalika.",
  "RepeatNumber": 1,
  "Tabweeb": "Du résident au voyageur"
 },
 {
  "ZekarID": 218,
  "ZekarText": "Qu’Allah t’accorde la piété, qu’Il te pardonne tes péchés et qu’Il te facilite le bien où que tu te trouves. \r\n\r\nZawwadaka l-lâhu t-taqwâ, wa ghafara dhanbaka, wa yassara laka-l-khayra haythu mâ kunta.",
  "RepeatNumber": 1,
  "Tabweeb": "Du résident au voyageur"
 },
 {
  "ZekarID": 219,
  "ZekarText": "A chaque montée : « Allah est le Plus Grand ». A chaque descente : « Gloire et pureté à Allah ». \r\n\r\nLors d'une montée : Allâhu akbar.\r\nLors d'une descente : Subhânallâh.",
  "RepeatNumber": 1,
  "Tabweeb": "Proclamer la grandeur et la gloire d'Allah au cours du voyage"
 },
 {
  "ZekarID": 220,
  "ZekarText": "Puisse un témoin témoigner de notre louange à Allah pour tous Ses bienfaits et Sa grande générosité envers nous. Seigneur, sois notre compagnon en nous protégeant et en nous accordant Tes bienfaits. Je cherche protection auprès d’Allah contre le châtiment de l’Enfer. \r\n\r\nSammaca sâmicun bi-hamdi l-lâhi, wa husni balâ'ihi calayna. Rabbanâ sâhibnâ wa afdil calaynâ câ'idhan bi-l-lâhi mina n-nâr.",
  "RepeatNumber": 1,
  "Tabweeb": "Du voyageur aux dernières heures de la nuit"
 },
 {
  "ZekarID": 221,
  "ZekarText": "Je cherche refuge auprès des paroles parfaites d’Allah contre le mal de ce qu’Il a créé. \r\n\r\nAcûdhu bi-kalimâti l-lâhi t-tâmmâti min sharri mâ khalaq.",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque l'on campe en plein air"
 },
 {
  "ZekarID": 222,
  "ZekarText": "Allah est Grand [trois fois de suite, à chaque montée]. Il n’y a d’autre divinité qu’Allah Unique, sans associé. A Lui la royauté, à Lui la louange et Il est capable de toute chose. Nous voici de retour repentants, adorant notre Seigneur et Le louant. Allah a tenu Sa promesse, a secouru Son serviteur et a mis en déroute à Lui Seul les coalisés. \r\n\r\nChaque fois que l'on atteint un point élevé : Allâhu akbar (trois fois).\r\nDire ensuite : Lâ ilâha illâ l-lâhu, wahdahu lâ sharîka lahu, lahu-l-mulku wa lahu-l-hamdu, wa huwa calâ kulli shay'in qadîrun. Âyibûna, tâ'ibûna, câbidûna, li-rabbinâ hâmidûn.\r\nSadaqa l-lâhu wacdahu, wa nasara cabdahu wa hazama-l-ahzâba wahdahu.",
  "RepeatNumber": 1,
  "Tabweeb": "Du retour du voyage"
 },
 {
  "ZekarID": 223,
  "ZekarText": "« La louange est à Allah de par la grâce de qui se réalisent les bonnes choses » [pour une bonne nouvelle]. « La louange est à Allah en toutes circonstances » [pour une mauvaise nouvelle]. \r\n\r\nAl hamdu li-l-lâhi l-ladhî bi-nicmatihi tatimmu s-sâlihâtu.\r\nAl hamdu li-l-lâhi calâ kulli hâlin.",
  "RepeatNumber": 1,
  "Tabweeb": "Que dire lorsque l'on reçoit une bonne ou une mauvaise nouvelle"
 },
 {
  "ZekarID": 224,
  "ZekarText": "Le Prophète (saws) a dit : « Celui qui prie sur moi une prière, Allah lui accordera Sa miséricorde dix fois. \r\n\r\nAllâhumma salli calâ Muhammadin wa calâ âli Muhammadin kamâ sallayta calâ Ibrâhîma wa calâ âli Ibrâhîma. Innaka hamîdun, majîd. Allâhumma bârik calâ Muhammadin wa calâ âli Muhammadin kamâ bârakta calâ Ibrâhîma wa calâ âli Ibrâhîma. Innaka hamîdun, majîd.",
  "RepeatNumber": 10,
  "Tabweeb": "Le mérite de la prière sur le Prophète (saws)"
 },
 {
  "ZekarID": 225,
  "ZekarText": "Le Prophète (saws) a dit : Ne prenez pas mon tombeau comme un lieu de fête (ou de fréquentation) et priez sr moi car votre prière me parvient où que vous soyez. \r\n\r\nAllâhumma salli calâ Muhammadin wa calâ âli Muhammadin kamâ sallayta calâ Ibrâhîma wa calâ âli Ibrâhîma. Innaka hamîdun, majîd. Allâhumma bârik calâ Muhammadin wa calâ âli Muhammadin kamâ bârakta calâ Ibrâhîma wa calâ âli Ibrâhîma. Innaka hamîdun, majîd.",
  "RepeatNumber": 1,
  "Tabweeb": "Le mérite de la prière sur le Prophète (saws)"
 },
 {
  "ZekarID": 226,
  "ZekarText": "Le Prophète (saws) a dit : Certes, l’avare est celui auprès de qui on me mentionne sans qu’il ne prie sur moi. \r\nSalla l-lâhu calayhi wa sallam.",
  "RepeatNumber": 1,
  "Tabweeb": "Le mérite de la prière sur le Prophète (saws)"
 },
 {
  "ZekarID": 227,
  "ZekarText": "Le Prophète (saws) a dit : Allah exalté a des Anges qui parcourent la terre pour me communiquer le salut de ma communauté. ",
  "RepeatNumber": 1,
  "Tabweeb": "Le mérite de la prière sur le Prophète (saws)"
 },
 {
  "ZekarID": 228,
  "ZekarText": "Le Prophète (saws) a dit : A chaque fois que quelqu’un m’adresse le salut, Allah me redonne mon âme pour que je réponde à son salut. ",
  "RepeatNumber": 1,
  "Tabweeb": "Le mérite de la prière sur le Prophète (saws)"
 },
 {
  "ZekarID": 229,
  "ZekarText": "Le Messager d’Allah (saws) a dit : « Vous n’entrerez pas au Paradis tant que vous n’aurez pas la foi et vous n’aurez pas la foi tant que vous ne vous aimerez pas les uns les autres. Voulez-vous que je vous montre une chose qui vous fera aimer les uns les autres ? Saluez-vous entre vous. » \r\n\r\nAs-salâmu calaykum.",
  "RepeatNumber": 1,
  "Tabweeb": "Le mérite de saluer"
 },
 {
  "ZekarID": 230,
  "ZekarText": "Celui qui regroupe trois vertus regroupe ainsi toute la foi : être équitable, fût-ce à ton propre détriment, saluer tout le monde et dépenser malgré le besoin. ",
  "RepeatNumber": 1,
  "Tabweeb": "Le mérite de saluer"
 },
 {
  "ZekarID": 231,
  "ZekarText": "Selon ‘Abdullah Ibn ‘A mr Ibn Al-‘As, qu’Allah les agrée, un homme demanda au Prophète (saws) : « Quel est le meilleur islam ? » Il lui dit : « Que tu donne à manger et que tu salue celui que tu connais et celui que tu ne connais pas ». ",
  "RepeatNumber": 1,
  "Tabweeb": "Le mérite de saluer"
 },
 {
  "ZekarID": 232,
  "ZekarText": "Quand les Gens du Livre (les juifs et les chrétiens) vous adressent le salut, dites-leur : « et vous de même ». \r\n\r\nWa calaykum.",
  "RepeatNumber": 1,
  "Tabweeb": "La manière de rendre le salut au mécréant"
 },
 {
  "ZekarID": 233,
  "ZekarText": "Quand vous entendez le chant du coq, invoquez Allah qu’Il vous accorde de Sa générosité, car il (le coq) a vu un ange. Et lorsque vous entendez le braiement de l’âne, cherchez refuge auprès d’Allah contre le diable, car il (l’âne) a vu un diable. \r\n\r\nAcûdhu bi-l-lâhi mina sh-shaytâni r-rajîm.",
  "RepeatNumber": 1,
  "Tabweeb": "En entendant le chant du coq et le braiment de l'âne"
 },
 {
  "ZekarID": 234,
  "ZekarText": "Lorsque vous entendez les aboiements des chiens et le braiement des ânes la nuit, demandez-donc protection auprès d’Allah contre eux, car ils voient ce que vous ne pouvez voir. \r\n\r\nAcûdhu bi-l-lâhi mina sh-shaytâni r-rajîm.",
  "RepeatNumber": 1,
  "Tabweeb": "En entendant les aboiements des chiens la nuit"
 },
 {
  "ZekarID": 235,
  "ZekarText": "Ô Seigneur ! A chaque croyant que j’ai insulté, rends-lui cette insulte un moyen de se rapprocher de Toi le Jour de la Résurrection. \r\n\r\nAllâhumma fa-ayyumâ mu'minin sababtuhu, fa-jcal dhâlika lahu qurbatan ilayka yawma-l-qiyâmati.",
  "RepeatNumber": 1,
  "Tabweeb": "En faveur de ceux que l'on a insultés"
 },
 {
  "ZekarID": 236,
  "ZekarText": "Le Prophète (saws) a dit : « Si l’un de vous doit vanter les mérites de son ami qu’il dise : ‘Je crois qu’untel est comme cela, et Allah est Juge et je ne recommande personne à Allah (car Il sait tout). Je crois – s’il lui connaît ces qualités – qu’il possède telle et telle qualité.’ ». ",
  "RepeatNumber": 1,
  "Tabweeb": "Ce que l'on doit dire lorsqu'on vante les mérites de quelqu'un"
 },
 {
  "ZekarID": 237,
  "ZekarText": "Ô Seigneur ! Ne me châtie pour ce qu’ils disent, pardonne-moi pour ce qu’ils ne savent pas [et rends-moi meilleur que ce qu’ils pensent de moi]. \r\n\r\nAllâhumma lâ tu'âkhidhnî bi-mâ yaqûlûna, wa ghfir lî mâ lâ yaclamun, [wa jcalnî khayran mimmâ yazunnûn].",
  "RepeatNumber": 1,
  "Tabweeb": "Ce que doit dire celui qui reçoit des éloges"
 },
 {
  "ZekarID": 238,
  "ZekarText": "Me voilà, ô Seigneur, me voilà. Me voilà, Tu n’as pas d’associé, me voilà. En vérité la louange et la grâce T’appartiennent ainsi que la royauté. Tu n’as pas d’associé. \r\n\r\nLabbayka l-lâhumma labbayka. Lâ sharîka laka labbayka. Inna-l-hamda wa n-nicmata laka wa-l-mulku. Lâ sharîka laka.",
  "RepeatNumber": 1,
  "Tabweeb": "La Talbiya pour celui qui effectue le Haj et la 'Omra"
 },
 {
  "ZekarID": 239,
  "ZekarText": "Allah est le plus grand. \r\n\r\n\r\nAllâhu akbar.",
  "RepeatNumber": 1,
  "Tabweeb": "Le Takbîr en passant devant la pierre noire"
 },
 {
  "ZekarID": 240,
  "ZekarText": "Ô Seigneur, accorde-nous une belle part ici-bas et une belle part dans l’au-delà et préserve-nous du châtiment de l’enfer. \r\n\r\nRabbanâ âtinâ fî d-dunya hasanatan wa fî-l-âkhirati hasanatan wa qinâ cadhâba n-nâr.",
  "RepeatNumber": 1,
  "Tabweeb": "Entre le coin 'yéménite' et la pierre noire"
 },
 {
  "ZekarID": 241,
  "ZekarText": "« En vérité, As-Safâ et Al-Marwa sont parmi les rites cultuels d’Allah » ; je commence par où Allah a commencé [As-Safâ]. Il n’y a de divinité qu’Allah, Allah est le plus grand. Il n’y a d’autre divinité qu’Allah Unique, sans associé. A Lui la royauté, à Lui la louange et Il est capable de toute chose. Allah a tenu Sa promesse, a secouru Son serviteur et a mis en déroute à Lui Seul les coalisés [trois fois, entrecoupées de requêtes] [Faire de même sur Al-Marwa] \r\n\r\nVers Safâ : Inna s-safâ wa-l-marwata min shacâ'iri l-lâh. Abda'u bimâ badaa l-lâhu bihi.\r\nVers la Kacba : Lâ ilâha illâ l-lâhu, Allâhu akbar, Lâ ilâha illâ l-lâhu, wahdahu lâ sharîka lahu, lahu-l-mulku wa lahu-l-hamdu, wa huwa calâ kulli shay'in qadîrun. Lâ ilâha illâ l-lâhu wahdahu. Anjaza wacdahu, wa nasara cabdahu, wa hamaza-l-ahzâba wahdahu.",
  "RepeatNumber": 1,
  "Tabweeb": "En montant As-Safâ et Al-Marwa et l'invocation à y dire"
 },
 {
  "ZekarID": 242,
  "ZekarText": "Il n’y a d’autre divinité qu’Allah Unique, sans associé. A Lui la royauté, à Lui la louange et Il est capable de toute chose. \r\n\r\nLâ ilâha illâ l-lâhu wahdahu lâ sharîka lahu, lahu-l-mulku wa lahu lhamdu, wa huwa calâ kulli shay’in qadîr.",
  "RepeatNumber": 1,
  "Tabweeb": "Du jour de 'Arafat"
 },
 {
  "ZekarID": 243,
  "ZekarText": "Le Prophète (saws) monta sur sa chamelle Al-Qaswa jusqu’à ce qu’il arriva à Al-Mach’ar al-Harâm, il se tourna alors vers la Qibla (il invoqua Allah, proclama Sa grandeur, Le loua et L’unifia). Il resta ainsi debout à dire ses invocations jusqu’à ce qu’il fasse bien jour, puis il prit la route avant le lever du soleil. ",
  "RepeatNumber": 1,
  "Tabweeb": "Le rappel à Muzdalifa"
 },
 {
  "ZekarID": 244,
  "ZekarText": "Allah est le plus grand [à chaque jet de cailloux] [Avancer vers la Qibla et faire des invocations en levant les mains, après la première stèle et après la deuxième.]  \r\n\r\nAllâhu akbar.",
  "RepeatNumber": 1,
  "Tabweeb": "Dire : 'Allah est le plus Grand' en lapidant les stèles"
 },
 {
  "ZekarID": 245,
  "ZekarText": "Gloire et pureté à Allah ! \r\n\r\nSubhâna l-lâh.",
  "RepeatNumber": 1,
  "Tabweeb": "Lors de l'étonnement et de l'admiration"
 },
 {
  "ZekarID": 246,
  "ZekarText": "Allah est le Plus Grand. \r\n\r\nAllâhu akbar.",
  "RepeatNumber": 1,
  "Tabweeb": "Lors de l'étonnement et de l'admiration"
 },
 {
  "ZekarID": 247,
  "ZekarText": "Quand une bonne nouvelle parvenait au Prophète (saws) ou lorsqu’il recevait une chose qui le rendait heureux, il se prosternait immédiatement devant Allah – qu’Il soit honoré et élevé – pour Lui manifester sa gratitude. ",
  "RepeatNumber": 1,
  "Tabweeb": "Lorsque l'on reçoit une bonne nouvelle"
 },
 {
  "ZekarID": 248,
  "ZekarText": "[En posant sa main sur l’endroit douloureux : ] Au nom d’Allah [trois fois], je me mets sous la protection d’Allah et de Son pouvoir contre le mal que je ressens et que je cherche à éloigner [sept fois]. \r\n\r\nBismi l-lâhi (3 fois), puis : Acûdhu bi-l-lâhi wa qudratihi min sharri mâ ajidu wa uhâdhiru (7 fois).",
  "RepeatNumber": 3,
  "Tabweeb": "Que doit dire celui qui ressent une douleur dans son corps"
 },
 {
  "ZekarID": 249,
  "ZekarText": "Si l’un de vous voit chez son frère, chez lui-même ou dans ses biens une chose qui lui plaise, qu’il invoque donc les bénédictions d’Allah car le mauvais œil est certes une vérité. \r\n\r\nAllâhumma bârik calayhi.",
  "RepeatNumber": 1,
  "Tabweeb": "Contre le mauvais oeil"
 },
 {
  "ZekarID": 250,
  "ZekarText": "Il n’y a de divinité qu’Allah ! \r\n\r\nLâ ilâha illâ l-lâhu.",
  "RepeatNumber": 1,
  "Tabweeb": "En cas de frayeur"
 },
 {
  "ZekarID": 251,
  "ZekarText": "Au nom d’Allah, et Allah est le Plus Grand. (Ô Seigneur ! Ceci vient de Toi et est pour Toi.) Ô Seigneur ! Accepte cela de moi. \r\n\r\nBismi l-lâhi wa l-lâhu akbar. [Allâhumma minka wa laka]. Allâhumma taqabbal minnî.",
  "RepeatNumber": 1,
  "Tabweeb": "En égorgeant une bête"
 },
 {
  "ZekarID": 252,
  "ZekarText": "Je cherche protection auprès de paroles parfaites d’Allah que ni les vertueux ni les pervers ne peuvent outrepasser, contre le mal de ce qu’Il a créé, ce qu’Il a donné comme progéniture et a accordé comme existence, contre le mal de ce qui descend du ciel, contre le mal de ce qui monte au ciel, contre le mal de qui se répand sur la terre, contre le mal de ce qui sort de la terre, contre les tourments de la nuit et du jour et contre le mal de tout visiteur la nuit à l’improviste, sauf celui qui apporte le bien, ô Seigneur Tout Miséricordieux. \r\n\r\nAcûdhu bi-kalimâti l-lâhi t-tâmmâti l-lâti lâ yujâwaizuhunna barrun wa lâ fâjirun min sharri mâ khalaqa wa bara'a wa dhara'a, wa min sharri mâ yanzilu mina s-amâci wa min sharri mâ yacrujuhu fîhâ, wa min sharri mâ dhara'a fî-l-ardi wa min sharri mâ yakhruju minhâ, wa min sharri fitani l-layli wa n-nahâri, wa min sharri kulli târiqin illâ târiqan yatruqu bi-khayrin yâ rahmân.",
  "RepeatNumber": 1,
  "Tabweeb": "Pour écarter la ruse et le complot des diables rebelles"
 },
 {
  "ZekarID": 253,
  "ZekarText": "Le Messager d’Allah (saws) a dit : « Par Allah, je demande certainement pardon à Allah et je me repens à Lui plus de soixante-dix fois par jour. » ",
  "RepeatNumber": 70,
  "Tabweeb": "La demande d'absolution et le repentir"
 },
 {
  "ZekarID": 254,
  "ZekarText": "Le Messager d’Allah (saws) a dit : Ô gens ! Revenez à Allah et implorez pardon car je me repens moi-même cent fois par jour. ",
  "RepeatNumber": 100,
  "Tabweeb": "La demande d'absolution et le repentir"
 },
 {
  "ZekarID": 255,
  "ZekarText": "Je demande pardon à Allah en dehors de qui il n’y a pas d’autre divinité, le Puissant, le Vivant, qui assure la bonne marche et la subsistance de toute chose et je reviens à Lui. \r\n\r\nAstaghfiru l-lâha-l-cazîma l-ladhî lâ ilâha illâ huwa-l-hayyu-l-qayyûmu, wa atûbu ilayhi.",
  "RepeatNumber": 1,
  "Tabweeb": "La demande d'absolution et le repentir"
 },
 {
  "ZekarID": 256,
  "ZekarText": "Le Messager d’Allah (saws) a dit : C’est dans les dernières heures de la nuit qu’Allah est le plus près de Son serviteur. Alors, si tu peux être parmi ceux qui L’évoquent à ce moment-là, sois-en. ",
  "RepeatNumber": 1,
  "Tabweeb": "La demande d'absolution et le repentir"
 },
 {
  "ZekarID": 257,
  "ZekarText": "Le Messager d’Allah (saws) a dit : Le serviteur n'est jamais aussi proche de son Seigneur qu'il ne l'est lorsqu'il se prosterne devant Lui. Multipliez donc les invocations (à ce moment). ",
  "RepeatNumber": 1,
  "Tabweeb": "La demande d'absolution et le repentir"
 },
 {
  "ZekarID": 258,
  "ZekarText": "Le Messager d’Allah (saws) a dit : Il arrive certainement à mon cœur de se distraire, seulement pour cela, j’implore Allah de me pardonner cent fois par jour. ",
  "RepeatNumber": 1,
  "Tabweeb": "La demande d'absolution et le repentir"
 },
 {
  "ZekarID": 259,
  "ZekarText": "Le Prophète SAWS a dit : Quiconque répète  Gloire, pureté et Louange à Dieu , cent fois pendant la journée, verra ses fautes effacées, fussent-elles comme l'écume de la mer. \r\n\r\nSubhâna l-lâhi wa bi-hamdihi. (100 fois)",
  "RepeatNumber": 100,
  "Tabweeb": "Les mérites de dire 'gloire à Allah, louange à Allah, il n'y a de divinité qu'Allah, Allah est le plus Grand'"
 },
 {
  "ZekarID": 260,
  "ZekarText": "Quiconque répète  Il n’y a d’autre divinité qu’Allah Unique, sans associé. A Lui la royauté, à Lui la louange et Il est capable de toute chose  à dix reprises, se verra attribuer la même récompense que celui qui aura affranchi quatre esclaves parmi les enfants d'Ismâîl. \r\n\r\nLâ ilâha illâ l-lâhu, wahdahu lâ sharîka lahu, lahu-l-mulku wa lahu-l-hamdu, wa huwa calâ kulli shay'in qadîr. (10 fois)",
  "RepeatNumber": 10,
  "Tabweeb": "Les mérites de dire 'gloire à Allah, louange à Allah, il n'y a de divinité qu'Allah, Allah est le plus Grand'"
 },
 {
  "ZekarID": 261,
  "ZekarText": "Le Prophète SAWS a dit :  Ne vous indiquerais-je point deux paroles à la fois faciles à prononcer, lourdes dans la balance et très appréciées du Tout Miséricordieux ?  Gloire et pureté à Allah ainsi que louange, et gloire à Allah le Tout Puissant.   \r\n\r\nSubhâna l-lâhi wa bi-hamdihi. Subhâna l-lâhi-l-cazîm.",
  "RepeatNumber": 1,
  "Tabweeb": "Les mérites de dire 'gloire à Allah, louange à Allah, il n'y a de divinité qu'Allah, Allah est le plus Grand'"
 },
 {
  "ZekarID": 262,
  "ZekarText": "Dire :  Gloire et pureté à Allah, la louange est à Allah, il n’y a de divinité qu’Allah et Allah est le Plus Grand , dépasse pour moi tout ce sur quoi le soleil se lève chaque jour. \r\n\r\nSubhâna l-lâhi, wa-l-hamdu li-l-lâhi, wa lâ ilâha illâ l-lâhu, wa l-lâhu akbar.",
  "RepeatNumber": 1,
  "Tabweeb": "Les mérites de dire 'gloire à Allah, louange à Allah, il n'y a de divinité qu'Allah, Allah est le plus Grand'"
 },
 {
  "ZekarID": 263,
  "ZekarText": "Le Prophète SAWS a dit :  L'un de vous pense-t-il qu'il lui serait difficile d'accomplir mille bonnes actions chaque jour ? . Une personne dans l'assistance dit alors :  Et comment serait-il possible à l'un d'entre nous de parvenir à cela ?  Et le Prophète SAWS de répondre : Il lui suffit de proclamer une centaine de fois la gloire de Dieu pour qu'on lui inscrive mille bonnes actions et qu'on lui efface mille péchés. ",
  "RepeatNumber": 100,
  "Tabweeb": "Les mérites de dire 'gloire à Allah, louange à Allah, il n'y a de divinité qu'Allah, Allah est le plus Grand'"
 },
 {
  "ZekarID": 264,
  "ZekarText": "Quiconque dit :  Gloire et pureté à Allah le Tout Puissant, ainsi que Louange.  verra un palmier lui être planté au Paradis. \r\n\r\nSubhâna l-lâhi-l-cazîmi wa bi-hamdihi.",
  "RepeatNumber": 1,
  "Tabweeb": "Les mérites de dire 'gloire à Allah, louange à Allah, il n'y a de divinité qu'Allah, Allah est le plus Grand'"
 },
 {
  "ZekarID": 265,
  "ZekarText": "Un compagnon raconte :  Le Prophète SAWS me dit : Ô Abdallah Ibn Qays ! Ne t'indiquerais-je point ce qui constitue l'un des trésors du Paradis ? Je lui dis :  Bien sûr, ô Messager de Dieu !  Et lui de me dire :  Dis : Il n’y a de force ni de puissance qu’en Allah.   \r\n\r\nLâ hawla wa lâ quwwata illâ bi-l-lâhi.",
  "RepeatNumber": 1,
  "Tabweeb": "Les mérites de dire 'gloire à Allah, louange à Allah, il n'y a de divinité qu'Allah, Allah est le plus Grand'"
 },
 {
  "ZekarID": 266,
  "ZekarText": "Les paroles les plus appréciées auprès de Dieu sont au nombre de quatre :  Gloire et pureté à Allah, louange à Allah, il n’y a d’autre divinité qu’Allah, Allah est le Plus Grand.  [et peu importe par laquelle de ces propositions on commence] \r\n\r\nSubhâna l-lâhi, wa-l-hamdu li-l-lâhi, wa lâ ilâha illâ l-lâhu, wa l-lâhu akbar.",
  "RepeatNumber": 1,
  "Tabweeb": "Les mérites de dire 'gloire à Allah, louange à Allah, il n'y a de divinité qu'Allah, Allah est le plus Grand'"
 },
 {
  "ZekarID": 267,
  "ZekarText": "Un bédouin se présenta auprès du Messager de Dieu SAWS et lui dit :  Enseigne-moi une parole que je puisse répéter. . Le Prophète SAWS lui recommanda alors de dire :\r\n Il n’y a d’autre divinité qu’Allah Seul sans associé, Allah est le Plus Grand dans toute Sa grandeur. La louange est à Allah en abondance. Gloire et pureté à Allah, maître des Univers. Il n’est de puissance ni de force que par Allah, le Puissant, le Sage. \r\nLe bédouin dit alors :  Ces mots sont pour mon Seigneur. Que me revient-il alors ?  Et le Prophète SAWS de dire :\r\n Ô Seigneur ! Pardonne-moi, accorde-moi Ta miséricorde, guide-moi sur le droit chemin et procure-moi ma subsistance. \r\n\r\n[La version d'Abû Dâwûd précise que le Prophète SAWS a dit lorsque ce bédouin s'en repartit :  Il repart les mains emplies de biens. ] \r\n\r\nLâ ilâha illâ l-lâhu, wahdahu lâ sharîka lahu. Allâhu akbaru kabîran, wa-l-hamdu li-l-lâhi kathîran. Subhâna l-lâhi rabbi-l-câlamîna. Lâ hawla wa la quwwata illâ bi-l-lâhi-l-cazîzi-l-hakîm.\r\nAllâhumma ghfir lî, wa rhamnî, wa hdinî, wa rzuqnî.",
  "RepeatNumber": 1,
  "Tabweeb": "Les mérites de dire 'gloire à Allah, louange à Allah, il n'y a de divinité qu'Allah, Allah est le plus Grand'"
 },
 {
  "ZekarID": 268,
  "ZekarText": "Il est rapporté que lorsqu'une personne embrassait l'Islam, le Prophète SAWS lui enseignait l'accomplissement de la prière et lui recommandait ensuite d'invoquer Dieu par ces mots :  Ô Seigneur ! Pardonne-moi, accorde-moi Ta miséricorde, guide-moi sur le droit chemin, accorde-moi le salut (ou la santé) et procure-moi ma subsistance.  \r\n\r\nAllâhumma ghfir lî, wa rhamnî, wa hdinî, wa câfinî, wa rzuqnî.",
  "RepeatNumber": 1,
  "Tabweeb": "Les mérites de dire 'gloire à Allah, louange à Allah, il n'y a de divinité qu'Allah, Allah est le plus Grand'"
 },
 {
  "ZekarID": 269,
  "ZekarText": "La plus méritoire des invocations est certes :  La louange est à Dieu  et la meilleure des formules de rappel est :  Nulle divinité n'est digne d'être adorée en dehors de Dieu . \r\n\r\nAl hamdu li-l-lâh.\r\nLâ ilâha illâ l-lâh.",
  "RepeatNumber": 1,
  "Tabweeb": "Les mérites de dire 'gloire à Allah, louange à Allah, il n'y a de divinité qu'Allah, Allah est le plus Grand'"
 },
 {
  "ZekarID": 270,
  "ZekarText": "Le Prophète SAWS a dit :  (Vous indiquerais-je ce que sont) les oeuvres pieuses et durables ? :  Gloire et pureté à Allah, la louange est à Allah, il n’y a de divinité qu’Allah, Allah est le Plus Grand et il n’y a de puissance ni de force qu’en Allah.   \r\n\r\nSubhâna l-lâhi, wa-l-hamdu li-l-lâhi, wa lâ ilâha illâ l-lâhu, wa l-lâhu akbaru, wa lâ hawla wa lâ quwwata illâ bi-l-lâhi.",
  "RepeatNumber": 1,
  "Tabweeb": "Les mérites de dire 'gloire à Allah, louange à Allah, il n'y a de divinité qu'Allah, Allah est le plus Grand'"
 },
 {
  "ZekarID": 271,
  "ZekarText": "‘Abduallah Ibn ‘Amr – qu’Allah les agrée – rapporte : J’ai vu le Prophète SAWS faire le Tasbîh en utilisant la main droite afin de compter le nombre de formules de glorifications qu'il répétait.  ",
  "RepeatNumber": 1,
  "Tabweeb": "La manière dont le Prophète (saws) glorifiait Allah (at-Tasbîh)"
 },
 {
  "ZekarID": 272,
  "ZekarText": "Lorsque la nuit tombe, retenez vos enfants car c’est le moment où les diables s’éparpillent. Après cela (la nuit tombée), vous pouvez les laisser sortir, seulement fermez les portes en mentionnant le nom d’Allah car le diable ne peut pas ouvrir une porte fermée. Bouchez les outres en mentionnant le nom d’Allah, couvrez les récipients, même si vous ne trouvez pour cela qu’un bâton, en mentionnant le nom d’Allah, et éteignez les lampes. ",
  "RepeatNumber": 1,
  "Tabweeb": "Parmi les règles générales et bénéfiques"
 },
 {
  "ZekarID": 273,
  "ZekarText": "Ô Seigneur ! Prie sur Mohammed et sur ses épouses et sa descendance comme Tu as prié sur la famille d'Ibrâhîm, et bénis Mohammed, ses épouses et sa descendance comme Tu as béni la famille d'Ibrâhîm. Tu es certes digne de louange et de glorification. \r\n\r\nAllâhumma salli calâ Muhammadin wa calâ azwâjihi wa dhurriyyâtihi kamâ sallayta calâ âli Ibrâhîm. Wa bârik calâ Muhammadin wa calâ azwâjihi wa dhurriyyâtihi kamâ bârakta calâ âli Ibrâhîm. Innaka hamîdun majîd.",
  "RepeatNumber": 1,
  "Tabweeb": "La prière sur le Prophète (saws) après l'attestation de foi"
 },
 {
  "ZekarID": 274,
  "ZekarText": "Je cherche protection auprès d'Allah le Très-Grand, auprès de Son visage majestueux et Son royaume éternel, contre Satan le maudit.\r\n[Au nom d'Allah, que la prière et le salut soient sur le Messager d'Allah.]\r\nÔ Seigneur ! Ouvre-moi les portes de Ta miséricorde. \r\n\r\nAcûdhu bi-l-lâhi-l-cazîmi, wa bi-wajhihi-l-karîmi, wa sultânihi-l-qadîmi, mina sh-shaytâni r-râjim.\r\n[Bismi l-lâhi, wa s-salâtu wa s-salâmu calâ rasûli l-lâhi]. Allâhumma ftah lî abwâba rahmatik.",
  "RepeatNumber": 1,
  "Tabweeb": "En entrant à la mosquée"
 }
],
"categories":[
 {
  "CategoryID": 1,
  "Category": "Lorsqu'on se réveille"
 },
 {
  "CategoryID": 2,
  "Category": "Lorsqu'on s'habille"
 },
 {
  "CategoryID": 3,
  "Category": "Lorsque l'on met un vêtement neuf"
 },
 {
  "CategoryID": 4,
  "Category": "Ce que l'on dit à celui qui met un vêtement neuf"
 },
 {
  "CategoryID": 5,
  "Category": "Avant de se déshabiller"
 },
 {
  "CategoryID": 6,
  "Category": "En entrant aux toilettes"
 },
 {
  "CategoryID": 7,
  "Category": "En sortant des toilettes"
 },
 {
  "CategoryID": 8,
  "Category": "Ce que l'on dit avant les ablutions"
 },
 {
  "CategoryID": 9,
  "Category": "Ce que l'on dit après les ablutions"
 },
 {
  "CategoryID": 10,
  "Category": "En entrant\/sortant de la maison"
 },
 {
  "CategoryID": 11,
  "Category": "En entrant\/sortant de la maison"
 },
 {
  "CategoryID": 12,
  "Category": "En allant à la mosquée"
 },
 {
  "CategoryID": 13,
  "Category": "En entrant à la mosquée"
 },
 {
  "CategoryID": 14,
  "Category": "En sortant de la mosquée"
 },
 {
  "CategoryID": 15,
  "Category": "De l'appel à la prière"
 },
 {
  "CategoryID": 16,
  "Category": "De l'ouverture de la prière"
 },
 {
  "CategoryID": 17,
  "Category": "De l'inclinaison"
 },
 {
  "CategoryID": 18,
  "Category": "En se redressant de l'inclinaison"
 },
 {
  "CategoryID": 19,
  "Category": "De la prosternation"
 },
 {
  "CategoryID": 20,
  "Category": "Entre les deux prosternations"
 },
 {
  "CategoryID": 21,
  "Category": "De la prosternation de la récitation du Coran"
 },
 {
  "CategoryID": 22,
  "Category": "L'attestation de foi"
 },
 {
  "CategoryID": 23,
  "Category": "La prière sur le Prophète (saws) après l'attestation de foi"
 },
 {
  "CategoryID": 24,
  "Category": "Après le dernier Tachahhud juste avant les salutations"
 },
 {
  "CategoryID": 25,
  "Category": "Après la prière"
 },
 {
  "CategoryID": 26,
  "Category": "De la prière dite de consultation (al-Istikhâra)"
 },
 {
  "CategoryID": 27,
  "Category": "Du matin et du soir"
 },
 {
  "CategoryID": 28,
  "Category": "Du sommeil"
 },
 {
  "CategoryID": 29,
  "Category": "Lorsque l'on change de côté en dormant"
 },
 {
  "CategoryID": 30,
  "Category": "Lorsque l'on se réveille en sursaut ou que l'on se sent mal"
 },
 {
  "CategoryID": 31,
  "Category": "Ce que l'on doit faire après un songe ou un cauchemar"
 },
 {
  "CategoryID": 32,
  "Category": "Du Qunût dans la prière du Witr"
 },
 {
  "CategoryID": 33,
  "Category": "Après la prière du Witr"
 },
 {
  "CategoryID": 34,
  "Category": "En cas de soucis et de tristesse"
 },
 {
  "CategoryID": 35,
  "Category": "En cas d'affliction"
 },
 {
  "CategoryID": 36,
  "Category": "En rencontrant l'ennemi ou des autorités"
 },
 {
  "CategoryID": 37,
  "Category": "De celui qui craint l'injustice du gouverneur"
 },
 {
  "CategoryID": 38,
  "Category": "Contre l'ennemi"
 },
 {
  "CategoryID": 39,
  "Category": "De celui qui craint un groupe de gens"
 },
 {
  "CategoryID": 40,
  "Category": "De celui qui rencontre des doutes dans sa croyance"
 },
 {
  "CategoryID": 41,
  "Category": "Pour se délivrer d'une dette"
 },
 {
  "CategoryID": 42,
  "Category": "Contre la tentation dans la prière et au cours de la récitation du Coran"
 },
 {
  "CategoryID": 43,
  "Category": "Lorsque l'on rencontre une difficulté"
 },
 {
  "CategoryID": 44,
  "Category": "Lorsque l'on a commis un péché"
 },
 {
  "CategoryID": 45,
  "Category": "Ce qui chasse le diable et ses tentations"
 },
 {
  "CategoryID": 46,
  "Category": "Lorsqu'il arrive une chose désagréable ou que l'on est dépassé par les événements"
 },
 {
  "CategoryID": 47,
  "Category": "Les félicitations à l'occasion d'une naissance"
 },
 {
  "CategoryID": 49,
  "Category": "Pour demander la protection d'Allah sur les enfants"
 },
 {
  "CategoryID": 50,
  "Category": "Ce que l'on dit en visitant un malade"
 },
 {
  "CategoryID": 51,
  "Category": "Le mérite de rendre visite à un malade"
 },
 {
  "CategoryID": 52,
  "Category": "Du malade qui perd espoir de vivre"
 },
 {
  "CategoryID": 53,
  "Category": "Faire prononcer au mourant la profession de foi (ach-Chahâda)"
 },
 {
  "CategoryID": 54,
  "Category": "De celui qui est atteint par un malheur"
 },
 {
  "CategoryID": 55,
  "Category": "Après avoir fermé les yeux du mort"
 },
 {
  "CategoryID": 56,
  "Category": "Pour le mort pendant l'office funéraire"
 },
 {
  "CategoryID": 57,
  "Category": "Pour l'enfant mort lors de la prière sur lui"
 },
 {
  "CategoryID": 58,
  "Category": "Les condoléances"
 },
 {
  "CategoryID": 59,
  "Category": "En plaçant le mort dans sa tombe"
 },
 {
  "CategoryID": 60,
  "Category": "Après l'inhumation du mort"
 },
 {
  "CategoryID": 61,
  "Category": "En visitant le cimetière"
 },
 {
  "CategoryID": 62,
  "Category": "Lorsque le vent souffle"
 },
 {
  "CategoryID": 63,
  "Category": "Lorsque le tonnerre gronde"
 },
 {
  "CategoryID": 64,
  "Category": "Parmi les invocations de demande de pluie"
 },
 {
  "CategoryID": 65,
  "Category": "Lorsque la pluie tombe"
 },
 {
  "CategoryID": 66,
  "Category": "Après la pluie"
 },
 {
  "CategoryID": 67,
  "Category": "Lorsque l'on a peur de la pluie"
 },
 {
  "CategoryID": 68,
  "Category": "En voyant la nouvelle lune"
 },
 {
  "CategoryID": 69,
  "Category": "Au moment de rompre le jeûne"
 },
 {
  "CategoryID": 70,
  "Category": "En commençant le repas"
 },
 {
  "CategoryID": 71,
  "Category": "A la fin du repas"
 },
 {
  "CategoryID": 72,
  "Category": "De l'invité en faveur de l'hôte"
 },
 {
  "CategoryID": 73,
  "Category": "En faveur de celui qui donne à boire"
 },
 {
  "CategoryID": 74,
  "Category": "Du jeûneur en faveur de celui qui lui fait rompre"
 },
 {
  "CategoryID": 75,
  "Category": "Du jeûneur lorsqu'on lui présente à manger et qu'il ne rompt pas son jeûne"
 },
 {
  "CategoryID": 76,
  "Category": "Ce que doit dire le jeûneur lorsqu'il se fait injurier"
 },
 {
  "CategoryID": 77,
  "Category": "Ce que l'on dit lorsque l'on voit les premiers fruits"
 },
 {
  "CategoryID": 78,
  "Category": "De l'éternuement"
 },
 {
  "CategoryID": 79,
  "Category": "Ce que l'on dit au mécréant lorsqu'il loue Allah après avoir éternué"
 },
 {
  "CategoryID": 80,
  "Category": "En faveur du nouveau marié"
 },
 {
  "CategoryID": 81,
  "Category": "De celui qui se marie ou achète une monture"
 },
 {
  "CategoryID": 82,
  "Category": "Avant les rapports sexuels"
 },
 {
  "CategoryID": 83,
  "Category": "Dans les moments de colère"
 },
 {
  "CategoryID": 84,
  "Category": "Lorsque l'on voit une personne éprouvée"
 },
 {
  "CategoryID": 85,
  "Category": "Ce qui est dit dans une assemblée"
 },
 {
  "CategoryID": 86,
  "Category": "L'expiation du verbiage dans une assemblée"
 },
 {
  "CategoryID": 87,
  "Category": "En faveur de celui qui dit 'qu'Allah te pardonne'"
 },
 {
  "CategoryID": 88,
  "Category": "En faveur de celui qui rend un service"
 },
 {
  "CategoryID": 89,
  "Category": "Les choses par lesquelles Allah préserve de l'Antéchrist"
 },
 {
  "CategoryID": 90,
  "Category": "En faveur de celui qui dit 'je t'aime en Allah'"
 },
 {
  "CategoryID": 91,
  "Category": "En faveur de celui qui propose le don de ses biens"
 },
 {
  "CategoryID": 92,
  "Category": "De celui qui s'acquitte de ses dettes en faveur de celui qui lui a accordé"
 },
 {
  "CategoryID": 93,
  "Category": "Lorsque l'on craint le polythéisme (ach-Chirk)"
 },
 {
  "CategoryID": 94,
  "Category": "En faveur de celui qui dit 'qu'Allah te bénisse'"
 },
 {
  "CategoryID": 95,
  "Category": "Du mauvais présage"
 },
 {
  "CategoryID": 96,
  "Category": "En enfourchant une monture ou en empruntant un moyen de transport"
 },
 {
  "CategoryID": 97,
  "Category": "Du voyage"
 },
 {
  "CategoryID": 98,
  "Category": "En entrant dans une ville ou un village"
 },
 {
  "CategoryID": 99,
  "Category": "En entrant au marché"
 },
 {
  "CategoryID": 100,
  "Category": "Lorsque la monture trébuche"
 },
 {
  "CategoryID": 101,
  "Category": "Du voyageur au résident"
 },
 {
  "CategoryID": 102,
  "Category": "Du résident au voyageur"
 },
 {
  "CategoryID": 103,
  "Category": "Proclamer la grandeur et la gloire d'Allah au cours du voyage"
 },
 {
  "CategoryID": 104,
  "Category": "Du voyageur aux dernières heures de la nuit"
 },
 {
  "CategoryID": 105,
  "Category": "Lorsque l'on campe en plein air"
 },
 {
  "CategoryID": 106,
  "Category": "Du retour du voyage"
 },
 {
  "CategoryID": 107,
  "Category": "Que dire lorsque l'on reçoit une bonne ou une mauvaise nouvelle"
 },
 {
  "CategoryID": 108,
  "Category": "Le mérite de la prière sur le Prophète (saws)"
 },
 {
  "CategoryID": 109,
  "Category": "Le mérite de saluer"
 },
 {
  "CategoryID": 110,
  "Category": "La manière de rendre le salut au mécréant"
 },
 {
  "CategoryID": 111,
  "Category": "En entendant le chant du coq et le braiment de l'âne"
 },
 {
  "CategoryID": 112,
  "Category": "En entendant les aboiements des chiens la nuit"
 },
 {
  "CategoryID": 113,
  "Category": "En faveur de ceux que l'on a insultés"
 },
 {
  "CategoryID": 114,
  "Category": "Ce que l'on doit dire lorsqu'on vante les mérites de quelqu'un"
 },
 {
  "CategoryID": 115,
  "Category": "Ce que doit dire celui qui reçoit des éloges"
 },
 {
  "CategoryID": 116,
  "Category": "La Talbiya pour celui qui effectue le Haj et la 'Omra"
 },
 {
  "CategoryID": 117,
  "Category": "Le Takbîr en passant devant la pierre noire"
 },
 {
  "CategoryID": 118,
  "Category": "Entre le coin 'yéménite' et la pierre noire"
 },
 {
  "CategoryID": 119,
  "Category": "En montant As-Safâ et Al-Marwa et l'invocation à y dire"
 },
 {
  "CategoryID": 120,
  "Category": "Du jour de 'Arafat"
 },
 {
  "CategoryID": 121,
  "Category": "Le rappel à Muzdalifa"
 },
 {
  "CategoryID": 122,
  "Category": "Dire : 'Allah est le plus Grand' en lapidant les stèles"
 },
 {
  "CategoryID": 123,
  "Category": "Lors de l'étonnement et de l'admiration"
 },
 {
  "CategoryID": 124,
  "Category": "Lorsque l'on reçoit une bonne nouvelle"
 },
 {
  "CategoryID": 125,
  "Category": "Que doit dire celui qui ressent une douleur dans son corps"
 },
 {
  "CategoryID": 126,
  "Category": "Contre le mauvais oeil"
 },
 {
  "CategoryID": 127,
  "Category": "En cas de frayeur"
 },
 {
  "CategoryID": 128,
  "Category": "En égorgeant une bête"
 },
 {
  "CategoryID": 130,
  "Category": "Pour écarter la ruse et le complot des diables rebelles"
 },
 {
  "CategoryID": 131,
  "Category": "La demande d'absolution et le repentir"
 },
 {
  "CategoryID": 132,
  "Category": "Les mérites de dire 'gloire à Allah, louange à Allah, il n'y a de divinité qu'Allah, Allah est le plus Grand'"
 },
 {
  "CategoryID": 133,
  "Category": "La manière dont le Prophète (saws) glorifiait Allah (at-Tasbîh)"
 },
 {
  "CategoryID": 134,
  "Category": "Parmi les règles générales et bénéfiques"
 }
]
}